K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #define SCREEN_WIDTH (TFT_HEIGHT-1)   // We are rotated horizontal so width and height are reversed.
  #define SCREEN_HEIGHT (TFT_WIDTH-1)
  #define SCROLL_BOX_LEFT_SIDE 3
  
  #ifdef FEATURE_TFT_HOSYOND_320x480_LCD
    #define SCREEN_BOX_HEIGHT 180    // This is set to the working area defined in the currently red border area.  
    // 170 for the 170x320 and 240x320 displays
    // On screens that are larger than 170px, the extra area is intended to be used for buttons or status windows.
    // you can set this to full height and increase the LCD_ROWS setting but 5 rows seems plenty to avoid much clutter.
    #define SCROLL_BOX_TOP 39   // 1 row below the status bar border line
    #define STATUS_BAR_FONT 4   // 2  or FM9 or FS9
    #define ICON_COLUMN_WIDTH COLUMN_WIDTH    // width of mono-spaced status bar font in pixels
    #define SCROLL_BOX_FONT FMB12   // 4
    #define ICON_SPACING (ICON_COLUMN_WIDTH+3)   
    #define GRID_ANCHOR (180)
    #define WPM_ANCHOR (280)
    #define ICON_ANCHOR (380)
    #define STATUS_BAR_X_CURSOR (8)
  #else
  #define SCREEN_BOX_HEIGHT 170    // This is set to the working area defined in the currently red border area.  
    // 170 for the 170x320 and 240x320 displays
    // On screens that are larger than 170px, the extra area is intended to be used for buttons or status windows.
    // you can set this to full height and increase the LCD_ROWS setting but 5 rows seems plenty to avoid much clutter. 
    #define SCROLL_BOX_TOP 29   // 1 row below the status bar border line
    #define STATUS_BAR_FONT 2   // 2  or FM9 or FS9
    #define ICON_COLUMN_WIDTH 12    // width of mono-spaced status bar font in pixels
    #define SCROLL_BOX_FONT FMB12   // 4
    #define ICON_SPACING (ICON_COLUMN_WIDTH+2)
    #define GRID_ANCHOR (110)
    #define WPM_ANCHOR (180)
    #define ICON_ANCHOR (250)
    #define STATUS_BAR_X_CURSOR (6)
  #endif
  #define SCROLL_BOX_WIDTH (TFT_HEIGHT-(2*SCROLL_BOX_LEFT_SIDE)) // pixel width of scroll box area
  #define SCROLL_BOX_HEIGHT (SCREEN_BOX_HEIGHT-SCROLL_BOX_TOP-3)  // pixel height of scroll box area inside borders
  #define SCROLL_TEXT_TOP_LINE (SCROLL_BOX_TOP+20)   // stat of first row of text
  #define SCROLL_TEXT_LEFT_SIDE (SCROLL_BOX_LEFT_SIDE+8)   // start of text columns
  
  #define TFT_GREY 0x5AEB // New color
  #define FONT_HEIGHT ((lcd.fontHeight()+2))    // using 2px padding for line separation
  
  #define SCROLL_BOX_ROW1 (SCROLL_TEXT_TOP_LINE)
  #define SCROLL_BOX_ROW2 (SCROLL_TEXT_TOP_LINE+FONT_HEIGHT)
  #define SCROLL_BOX_ROW3 (SCROLL_TEXT_TOP_LINE+(2*FONT_HEIGHT))
  #define SCROLL_BOX_ROW4 (SCROLL_TEXT_TOP_LINE+(3*FONT_HEIGHT))
  #define SCROLL_BOX_ROW5 (SCROLL_TEXT_TOP_LINE+(4*FONT_HEIGHT))
  #define SCROLL_BOX_CENTER (SCROLL_BOX_WIDTH/2)
  #define SCROLL_BOX_BOTTOM (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT)
  #define BUTTON_ROW (SCROLL_BOX_TOP+SCROLL_BOX_HEIGHT+8)
  #define TFT_VIEWPORT_EXISTS (lcd.checkViewport(SCROLL_BOX_LEFT_SIDE+3, SCROLL_BOX_TOP+4, 1, 1))
  #define TFT_SET_VIEWPORT (lcd.setViewport(SCROLL_BOX_LEFT_SIDE+2, SCROLL_BOX_TOP+2, SCROLL_BOX_WIDTH-4, SCROLL_BOX_HEIGHT-4, false))
  #define TFT_SET_WINDOW (lcd.setWindow(SCROLL_BOX_LEFT_SIDE+1, SCROLL_BOX_TOP+1, SCROLL_BOX_WIDTH-2, SCROLL_BOX_HEIGHT-2))
#endif

#if defined(HARDWARE_ESP32_DEV)
  #include <driver/gpio.h>
  #include <freertos/event_groups.h>
  #include <freertos/task.h>
  volatile bool paddle_left_state  = true;   // 1 is pulled high, 0 is contact closed
  volatile bool paddle_right_state = true;
  volatile bool straight_key_state = true;
  static EventGroupHandle_t Key_Events = NULL;
  #ifdef FEATURE_MCP23017_EXPANDER
    #include "i2cdev.h"
    #include <mcp23x17.h>
    #include <Wire.h>
    #define MCP23X17_ADDR 0x27
    static mcp23x17_t MCP23017 = { I2C_NUM_0 };
  #endif
#endif

#if defined(FEATURE_LCD_HD44780)
  #include <Wire.h>
  #include <hd44780.h>
  #include <hd44780ioClass/hd44780_I2Cexp.h>
  #define WIRECLOCK 400000L
#endif

#if defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE)
 // #include <BasicTerm.h>
#endif

#if defined(FEATURE_CW_DECODER) && defined(OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR)
  #include <goertzel.h>
#endif
#if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220127
#include <WiFi.h>
#include <WifiClient.h>
#include <WiFiServer.h>
#define EthernetClient WiFiClient
#define EthernetServer WiFiServer
#define EthernetUDP WiFiUDP
#endif

#if defined(FEATURE_ETHERNET)
#if !defined(ARDUINO_MAPLE_MINI) && !defined(ARDUINO_GENERIC_STM32F103C) && !defined(HARDWARE_ESP32_DEV)//sp5iou 20180329 20220127
  #include <Ethernet.h>  // if this is not included, compilation fails even though all ethernet code is #ifdef'ed out
  #if defined(FEATURE_INTERNET_LINK)
    #include <EthernetUdp.h>
  #endif //FEATURE_INTERNET_LINK
#endif //!defined(ARDUINO_MAPLE_MINI) && !defined(ARDUINO_GENERIC_STM32F103C) //sp5iou 20180329  
#endif //FEATURE_ETHERNET


#if defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_USB_MOUSE)  // note_usb_uncomment_lines
  // #include <hidboot.h>  // Arduino 1.6.x (and maybe 1.5.x) has issues with these three lines, moreover we noted that Arduino 1.8.6 it's not afected by an issue during USB Shield SPI init see https://github.com/felis/USB_Host_Shield_2.0/issues/390
  // #include <usbhub.h>   // Uncomment the three lines if you are using FEATURE_USB_KEYBOARD or FEATURE_USB_MOUSE
  // #include <Usb.h>      // Note: the most updated USB Library can be downloaded at https://github.com/felis/USB_Host_Shield_2.0
#endif

#if defined(FEATURE_CW_COMPUTER_KEYBOARD) 
  #include <Keyboard.h>  // Have a problem with Keyboard.h not found?  See https://github.com/k3ng/k3ng_cw_keyer/issues/35
                           // For some unknown reason this line uncommented in Arduino 1.8.1 <sometimes?> causes compilation error (sigh) 
#endif //defined(FEATURE_CW_COMPUTER_KEYBOARD)

#if defined(FEATURE_4x4_KEYPAD)|| defined (FEATURE_3x4_KEYPAD)
  #include <Keypad.h>
#endif

#if defined(FEATURE_SD_CARD_SUPPORT)
  #include <SPI.h>
  #include <SD.h>
#endif //FEATURE_SD_CARD_SUPPORT

#if defined(ARDUINO_SAMD_VARIANT_COMPLIANCE)
  extern uint32_t __get_MSP(void);
  #define SP __get_MSP()
#endif  

