K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
#define memory_area_start (sizeof(configuration)+5)

// Variables and stuff
struct config_t {  // 120 bytes total
  
  uint8_t paddle_mode;                                                   
  uint8_t keyer_mode;            
  uint8_t sidetone_mode;
  uint8_t pot_activated;
  uint8_t length_wordspace;
  uint8_t autospace_active;
  uint8_t current_ptt_line;
  uint8_t current_tx;
  uint8_t weighting;
  uint8_t dit_buffer_off;
  uint8_t dah_buffer_off;
  uint8_t cmos_super_keyer_iambic_b_timing_percent;
  uint8_t cmos_super_keyer_iambic_b_timing_on;
  uint8_t link_receive_enabled;
  uint8_t paddle_interruption_quiet_time_element_lengths;
  uint8_t wordsworth_wordspace;
  uint8_t wordsworth_repetition;
  uint8_t cli_mode;
  uint8_t ptt_buffer_hold_active;
  uint8_t ptt_disabled;
  uint8_t beacon_mode_on_boot_up;
  uint8_t keying_compensation;
    // 22 bytes

  unsigned int wpm;
  unsigned int hz_sidetone;
  unsigned int dah_to_dit_ratio;
  unsigned int wpm_farnsworth;
  unsigned int memory_repeat_time;
  unsigned int wpm_command_mode;
  unsigned int link_receive_udp_port; 
  unsigned int wpm_ps2_usb_keyboard;
  unsigned int wpm_cli;
  unsigned int wpm_winkey;
  unsigned int cw_echo_timing_factor;
  unsigned int autospace_timing_factor;
    // 24 bytes 

  uint8_t ip[4];
  uint8_t gateway[4];  
  uint8_t subnet[4]; 
  uint8_t dns_server[4];
    // 16 bytes

  uint8_t link_send_ip[4][FEATURE_INTERNET_LINK_MAX_LINKS];   // FEATURE_INTERNET_LINK_MAX_LINKS = 2
  uint8_t link_send_enabled[FEATURE_INTERNET_LINK_MAX_LINKS];
  unsigned int link_send_udp_port[FEATURE_INTERNET_LINK_MAX_LINKS];
    // 14 bytes

  unsigned int ptt_lead_time[6];
  unsigned int ptt_tail_time[6];
  unsigned int ptt_active_to_sequencer_active_time[5];
  unsigned int ptt_inactive_to_sequencer_inactive_time[5];
    // 44 bytes

  int sidetone_volume;
    // 2 bytes
#if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220129
  char wifissid[20]=WIFI_SSID;//Initialize configuration.wifissid with default set in keyer_settings...h file
  char wifipassword[20]=WIFI_PASSWORD;//Initialize configuration.wifipassword with default set in keyer_settings...h file
    //40 bytes
#endif
} configuration;

// Forward declarations to make esp-idf happy

void add_to_send_buffer(byte incoming_serial_byte);
int paddle_pin_read(int pin_to_read);
void display_serial_number_character(char snumchar);
int memory_start(byte memory_number); 
int memory_end(byte memory_number);
void tx_and_sidetone_key (int state);
void send_char(byte cw_char, byte omit_letterspace);
void boop();
void beep();
void check_serial();
void remove_from_send_buffer();
void winkey_port_write(byte byte_to_send,byte override_filter);
void cli_timing_command(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments,byte command_called);
void serial_change_wordspace(PRIMARY_SERIAL_CLS * port_to_use);
int serial_get_number_input(byte places,int lower_limit, int upper_limit,PRIMARY_SERIAL_CLS * port_to_use,int raise_error_message);
void cli_extended_commands(PRIMARY_SERIAL_CLS * port_to_use);
void serial_switch_tx(PRIMARY_SERIAL_CLS * port_to_use);
void serial_tune_command (PRIMARY_SERIAL_CLS * port_to_use);
void write_settings_to_eeprom(int initialize_eeprom) ;
void check_dit_paddle();
void check_dah_paddle();
void clear_send_buffer();
void loop_element_lengths(float lengths, float additional_time_ms, int speed_wpm_in);
void speed_set(int wpm_set);
int convert_cw_number_to_ascii (long number_in);
void cli_timing_print(PRIMARY_SERIAL_CLS * port_to_use);
void cli_paddle_echo_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_play_memory(byte memory_number);
void switch_to_tx_silent(byte tx) ;
void serial_set_dit_to_dah_ratio(PRIMARY_SERIAL_CLS * port_to_use);
void serial_program_memory(PRIMARY_SERIAL_CLS * port_to_use);
void serial_status(PRIMARY_SERIAL_CLS * port_to_use) ;
void cli_autospace_timing_factor(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_receive_practice_menu(PRIMARY_SERIAL_CLS * port_to_use,byte practice_mode);
void serial_wordsworth_menu(PRIMARY_SERIAL_CLS * port_to_use);
void receive_transmit_echo_practice(PRIMARY_SERIAL_CLS * port_to_use, byte practice_mode_called) ;
void serial_set_weighting(PRIMARY_SERIAL_CLS * port_to_use);
void process_serial_command(PRIMARY_SERIAL_CLS * port_to_use);
void serial_set_sidetone_freq(PRIMARY_SERIAL_CLS * port_to_use);
void serial_status_memories(PRIMARY_SERIAL_CLS * port_to_use);
void initialize_eeprom_memories();
void serial_set_serial_number(PRIMARY_SERIAL_CLS * port_to_use);
void repeat_play_memory(PRIMARY_SERIAL_CLS * port_to_use);
void serial_set_memory_repeat(PRIMARY_SERIAL_CLS * port_to_use);
void initialize_eeprom();
void cli_eeprom_dump(PRIMARY_SERIAL_CLS * port_to_use);
void serial_practice_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called);
void serial_random_menu(PRIMARY_SERIAL_CLS * port_to_use);
void random_practice(PRIMARY_SERIAL_CLS * port_to_use,byte random_mode,byte group_size) ;
void wordsworth_practice(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type);
void initialize_eeprom();
void serial_cw_practice(PRIMARY_SERIAL_CLS * port_to_use);
void serial_practice_non_interactive(PRIMARY_SERIAL_CLS * port_to_use,byte practice_type_called);
void cli_keying_compensation(PRIMARY_SERIAL_CLS * port_to_use,String command_arguments);
void serial_wpm_set(PRIMARY_SERIAL_CLS * port_to_use) ;
void serial_set_farnsworth(PRIMARY_SERIAL_CLS * port_to_use);
void send_serial_number(byte cut_numbers,int increment_serial_number,byte buffered_sending);
void serial_receive_transmit_echo_menu(PRIMARY_SERIAL_CLS * port_to_use);
byte play_memory(byte memory_number);
void mydelay(unsigned long ms);
void display_scroll_print_char(char charin);
void popup(bool show);
void sinewave_interrupt_compute();
void initialize_sinewave_generator();
void initialize_tonsin();
#ifdef FEATURE_TOUCH_DISPLAY
//---------------------------------------------------------------------
// Buttons and Popup Window for Touch Displays
//---------------------------------------------------------------------

  // row 1 buttons which is calculated as button_id + (button_row*10)
  #define BUTTON_F1 0
  #define BUTTON_1  1
  #define BUTTON_2  2
  #define BUTTON_3  3
  #define BUTTON_4  4
  #define CW_BOX1   5
  // row 2 buttons which is calculated as button_id + (button_row*10)
  #define BUTTON_F2 10
  #define BUTTON_5  11
  #define BUTTON_6  12
  #define BUTTON_7  13
  #define BUTTON_8  14
  #define CW_BOX2   15

