K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #define NUM_BUTTON_ROWS  2; // number of rows of buttons
  char popup_text[(LCD_COLUMNS*LCD_ROWS)+20] = {}; // Text to display in popup
  bool popup_active = false;
  uint16_t t_x = 0, t_y = 0;    // Variables to store touch coordinates
  bool button_active = false;
  uint8_t repeat_key_ID = false;
#endif

 #ifdef FEATURE_TOUCH_DISPLAY
  //TFT_eSPI_Button btn_f1;             // Button instance
  //TFT_eSPI_Button btn_1;
  //TFT_eSPI_Button btn_2;
  //TFT_eSPI_Button btn_3;
  //TFT_eSPI_Button btn_4;
  //TFT_eSPI_Button btn_CW_box;
  //TFT_eSPI_Button* btn[] = {&btn_f1, &btn_1, &btn_2, &btn_3, &btn_4, &btn_CW_box};
  const uint8_t buttonCount = 6;  // sizeof(btn) / sizeof(btn[0]);

  struct BTN_Timer {
    TFT_eSPI_Button p_btn;
    uint8_t len;
    uint32_t duration;
  } btn[buttonCount] = {};
  
  void process_buttons(); //uint8_t button_ID);
  int touch_button_available();
  #define USE_TOUCH_TASK
  #ifdef USE_TOUCH_TASK
    void check_touch_buttons(void * pvParameters);
  #else
    void check_touch_buttons(void);
  #endif
#endif

// ________________________________
// 
#ifdef FEATURE_TFT_DISPLAY
void initialize_TFT_LCD_display(void);
void initialize_m5stack_core2();
int32_t h = 320;  // calculate actual at run time
int32_t w = 240;
#endif
// ________________________________
// 
#ifdef FEATURE_BT_KEYBOARD
// QUEUESIZE must be a power of two 
#define QUEUESIZE       (128)
#define QUEUEMASK       (QUEUESIZE-1)
#define DEBUG false
int aborted = 0;
int qhead = 0;
int qtail = 0;
char queue[QUEUESIZE];
char queuepop();
void queueadd(const char ch);
int queueempty();
int queue_available();
void queueflush();
int queuefull();
void boop_beep();
void check_paddles();
void service_dit_dah_buffers();
void sidetone_adj(int hz);
void adjust_dah_to_dit_ratio(int adjustment);
void ps2_usb_keyboard_play_memory(byte memory_number);
void ps2_keyboard_program_memory(byte memory_number);
void ptt_unkey();
void ptt_key();
void put_serial_number_in_send_buffer();
void check_ptt_tail();
int uppercase (int charbytein);
void service_send_buffer(byte no_print);
int ps2_keyboard_get_number_input(byte places,int lower_limit, int upper_limit);
bool BT_Keyboard_Lost = false;
bool Keyboard_Disconnected_signal = false;
bool Keyboard_Connected_signal = false;
void BT_Keyboard_Status(void);

//#define USE_BT_TASK // for BT check in a task
#ifdef USE_BT_TASK
  void check_bt_keyboard(void * pvParameters);
#else
  void check_bt_keyboard(void);
#endif
#endif  //FEATURE_BT_KEYBOARD
// ________________________________
// 
byte sending_mode = UNDEFINED_SENDING;
byte command_mode_disable_tx = 0;
byte current_tx_key_line = tx_key_line_1;
#ifdef FEATURE_SO2R_BASE
  byte current_tx_ptt_line = ptt_tx_1;
#endif
byte manual_ptt_invoke = 0;
byte manual_ptt_invoke_ptt_input_pin = 0;
byte qrss_dit_length = initial_qrss_dit_length;
byte keyer_machine_mode = KEYER_NORMAL;   // KEYER_NORMAL, BEACON, KEYER_COMMAND_MODE
byte char_send_mode = 0; // CW, HELL, AMERICAN_MORSE
byte key_tx = 0;         // 0 = tx_key_line control suppressed
byte dit_buffer = 0;     // used for buffering paddle hits in iambic operation
byte dah_buffer = 0;     // used for buffering paddle hits in iambic operation
byte button0_buffer = 0;
byte being_sent = 0;     // SENDING_NOTHING, SENDING_DIT, SENDING_DAH
byte key_state = 0;      // 0 = key up, 1 = key down
byte config_dirty = 0;
unsigned long ptt_time = 0; 
byte ptt_line_activated = 0;
byte speed_mode = SPEED_NORMAL;
#if defined(FEATURE_COMMAND_LINE_INTERFACE) || defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_MEMORY_MACROS) || defined(FEATURE_MEMORIES) || defined(FEATURE_COMMAND_MODE)
  unsigned int serial_number = 1;
#endif
byte pause_sending_buffer = 0;
byte length_letterspace = default_length_letterspace;
//byte keying_compensation = default_keying_compensation;
byte first_extension_time = default_first_extension_time;
byte ultimatic_mode = ULTIMATIC_NORMAL;
float ptt_hang_time_wordspace_units = default_ptt_hang_time_wordspace_units;
byte last_sending_mode = MANUAL_SENDING;
byte zero = 0;
byte iambic_flag = 0;
unsigned long last_config_write = 0;
uint16_t memory_area_end = 0;
int keyboard_button = 0;  // used at end to detect if a valid button was just pressed.

#ifdef FEATURE_SLEEP
  unsigned long last_activity_time = 0;
#endif

#ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
  unsigned long last_active_time = 0;
#endif

#ifdef FEATURE_DISPLAY
  enum lcd_statuses {LCD_CLEAR, LCD_REVERT, LCD_TIMED_MESSAGE, LCD_SCROLL_MSG};
  #define default_display_msg_delay 1000
#endif //FEATURE_DISPLAY

#ifdef FEATURE_LCD_ADAFRUIT_I2C
  #define RED 0x1
  #define YELLOW 0x3
  #define GREEN 0x2
  #define TEAL 0x6
  #define BLUE 0x4
  #define VIOLET 0x5
  #define WHITE 0x7
  byte lcdcolor = GREEN;  // default color for RGB LCD display
#endif //FEATURE_LCD_ADAFRUIT_I2C

#if defined(OPTION_WINKEY_2_SUPPORT) && defined(FEATURE_WINKEY_EMULATION)
  byte wk2_mode = 1;
  #ifndef FEATURE_SO2R_BASE
    byte wk2_both_tx_activated = 0;
  #endif //FEATURE_SO2R_BASE
  byte wk2_paddle_only_sidetone = 0;
#endif //defined(OPTION_WINKEY_2_SUPPORT) && defined(FEATURE_WINKEY_EMULATION)

#ifdef FEATURE_DISPLAY
  byte lcd_status = LCD_CLEAR;
  unsigned long lcd_timed_message_clear_time = 0;
  byte lcd_previous_status = LCD_CLEAR;
  byte lcd_scroll_buffer_dirty = 0;
  String lcd_scroll_buffer[LCD_ROWS];
  byte lcd_scroll_flag = 0;
  byte lcd_paddle_echo = 1;
  byte lcd_send_echo = 1;
#endif //FEATURE_DISPLAY

#ifdef DEBUG_VARIABLE_DUMP
  long dit_start_time;
  long dit_end_time;
  long dah_start_time;
  long dah_end_time;
#endif //DEBUG_VARIABLE_DUMP

#ifdef FEATURE_BUTTONS
  int button_array_high_limit[analog_buttons_number_of_buttons];
  int button_array_low_limit[analog_buttons_number_of_buttons];
  long button_last_add_to_send_buffer_time = 0;
#endif //FEATURE_BUTTONS

byte pot_wpm_low_value;

#ifdef FEATURE_POTENTIOMETER
  byte pot_wpm_high_value;
  byte last_pot_wpm_read;
  int pot_full_scale_reading = default_pot_full_scale_reading;
#endif //FEATURE_POTENTIOMETER

#if defined(FEATURE_SERIAL)
  #if !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
    byte loop_element_lengths_breakout_flag;
    byte dump_current_character_flag;
  #endif
  byte incoming_serial_byte;
  long primary_serial_port_baud_rate;
  byte cw_send_echo_inhibit = 0;
  #ifdef FEATURE_COMMAND_LINE_INTERFACE
    byte serial_backslash_command;
    byte cli_paddle_echo = cli_paddle_echo_on_at_boot;
    byte cli_prosign_flag = 0;
    byte cli_wait_for_cr_to_send_cw = 0;
    #if defined(FEATURE_STRAIGHT_KEY_ECHO)
      byte cli_straight_key_echo = cli_straight_key_echo_on_at_boot;
    #endif   
  #endif //FEATURE_COMMAND_LINE_INTERFACE  
#endif //FEATURE_SERIAL

