K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #ifdef FEATURE_SO2R_ANTENNA
    uint8_t so2r_antenna_1 = 0;
    uint8_t so2r_antenna_2 = 0;
  #endif //FEATURE_SO2R_ANTENNA
#endif //FEATURE_SO2R_BASE

byte async_eeprom_write = 0;

/*---------------------------------------------------------------------------------------------------------


 “What we do for ourselves dies with us. What we do for others and the world remains and is immortal.” 

― Albert Pike


---------------------------------------------------------------------------------------------------------*/
// Subroutines --------------------------------------------------------------------------------------------

// Are you a radio artisan ?
#if defined FEATURE_BUTTONS
#include "src\buttonarray\buttonarray.h"
#endif //FEATURE_BUTTONS

void service_sending_pins(){

  static byte last_sending_mode = 255;

  if ((sending_mode == AUTOMATIC_SENDING) || (sending_mode == AUTOMATIC_SENDING_INTERRUPTED)){
    if (last_sending_mode != AUTOMATIC_SENDING){
      if (pin_sending_mode_automatic){
        digitalWrite(pin_sending_mode_automatic,HIGH);
      }
      if (pin_sending_mode_manual){
        digitalWrite(pin_sending_mode_manual,LOW);
      }
    }
  }
  if ((sending_mode == MANUAL_SENDING) || (sending_mode == UNDEFINED_SENDING)){
    if (last_sending_mode != MANUAL_SENDING){
      if (pin_sending_mode_automatic){
        digitalWrite(pin_sending_mode_automatic,LOW);
      }
      if (pin_sending_mode_manual){
        digitalWrite(pin_sending_mode_manual,HIGH);
      }
    }
  }

}



//-------------------------------------------------------------------------------------------------------


byte service_tx_inhibit_and_pause(){

  byte return_code = 0;
  static byte pause_sending_buffer_active = 0;

  if (tx_inhibit_pin){
    if ((digitalRead(tx_inhibit_pin) == tx_inhibit_pin_active_state)){
      dit_buffer = 0;
      dah_buffer = 0; 
      return_code = 1;
      if (send_buffer_bytes){
        clear_send_buffer();
        send_buffer_status = SERIAL_SEND_BUFFER_NORMAL;
        #ifdef FEATURE_MEMORIES
          play_memory_prempt = 1;
          repeat_memory = 255;
        #endif
        #ifdef FEATURE_WINKEY_EMULATION
          if (winkey_sending && winkey_host_open) {
            winkey_port_write(0xc2|winkey_sending|winkey_xoff,0); // 0xc2 - BREAKIN bit set high
            winkey_interrupted = 1;
          }
        #endif
      }
    }
  }

  if (tx_pause_pin){
    if ((digitalRead(tx_pause_pin) == tx_pause_pin_active_state)){
      dit_buffer = 0;
      dah_buffer = 0; 
      return_code = 1;
      if (!pause_sending_buffer_active){
        pause_sending_buffer = 1;
        pause_sending_buffer_active = 1;
        mydelay(10);
      }
    } else {
      if (pause_sending_buffer_active){
        pause_sending_buffer = 0;
        pause_sending_buffer_active = 0;
        mydelay(10);
      } 
    }

    
  }  

  return return_code;

}

//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_BEACON_SETTING)
  void service_beacon(){
    if ((configuration.beacon_mode_on_boot_up) && (!send_buffer_bytes)){
      serial_play_memory(0);
    }
  }
#endif //FEATURE_BEACON_SETTING

//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_COMPETITION_COMPRESSION_DETECTION)
  void service_competition_compression_detection(){


    static byte compression_detection_indicator_on = 0;
    static unsigned long last_compression_check_time = 0;
    
    
    

    if ((millis() - last_compression_check_time) > 1000){
      float time_average = 0;
      if (time_array_index == COMPETITION_COMPRESSION_DETECTION_ARRAY_SIZE){
        for (int i = 0;i < COMPETITION_COMPRESSION_DETECTION_ARRAY_SIZE;i++){
          time_average = time_average + time_array[i];
        }
        time_average = time_average / COMPETITION_COMPRESSION_DETECTION_ARRAY_SIZE;
        if (time_average < ((1200/configuration.wpm)*COMPETITION_COMPRESSION_DETECTION_AVERAGE_ALARM_THRESHOLD)){
          if (!compression_detection_indicator_on){
            compression_detection_indicator_on = 1;
            digitalWrite(compression_detection_pin,HIGH);
            #if defined(DEBUG_FEATURE_COMPETITION_COMPRESSION_DETECTION)
              debug_serial_port->print(F("service_competition_compression_detection: time_array: "));
              for (int i = 0;i < COMPETITION_COMPRESSION_DETECTION_ARRAY_SIZE;i++){
                debug_serial_port->print(time_array[i]);
                debug_serial_port->print(F(" "));
              }            
              debug_serial_port->print(F("\n\rservice_competition_compression_detection: COMPRESSION DETECTION ON  average: "));
              debug_serial_port->println(time_average);              
            #endif
          }

        } else {
          if (compression_detection_indicator_on){
            compression_detection_indicator_on = 0;
            digitalWrite(compression_detection_pin,LOW);
            #if defined(DEBUG_FEATURE_COMPETITION_COMPRESSION_DETECTION)
              debug_serial_port->print(F("service_competition_compression_detection: time_array: "));
              for (int i = 0;i < COMPETITION_COMPRESSION_DETECTION_ARRAY_SIZE;i++){
                debug_serial_port->print(time_array[i]);
                debug_serial_port->print(F(" "));
              }                 
              debug_serial_port->print(F("\n\rservice_competition_compression_detection: COMPRESSION DETECTION OFF  average: "));
              debug_serial_port->println(time_average);
            #endif
          }
        }
      }
      last_compression_check_time = millis();
    }

  }
#endif //FEATURE_COMPETITION_COMPRESSION_DETECTION

//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_4x4_KEYPAD) || defined(FEATURE_3x4_KEYPAD)
void service_keypad(){

  // Code contributed by Jack, W0XR

  char key = kpd.getKey();

  if(key){ // Check for a valid key.

    #if defined(DEBUG_KEYPAD_SERIAL)
      debug_serial_port->print(F("service_keypad: key:"));
      debug_serial_port->println(key);
    #endif

