K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    if (keyer_awake){
      digitalWrite(keyer_awake,KEYER_AWAKE_PIN_AWAKE_STATE);
    }

    last_activity_time = millis();
    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
      last_active_time = millis(); 
    #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

    #ifdef DEBUG_SLEEP
      debug_serial_port->println(F("check_sleep: I'm awake!"));
    #endif //DEBUG_SLEEP
  }


}
#endif //FEATURE_SLEEP
#endif //HARDWARE_ESP32_DEV
//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
void check_backlight() {

  static unsigned long last_bl_check = 0 ;

  if (millis() - last_bl_check < 1000) return;   // not time-critical

  last_bl_check = millis();
  
  if ((last_bl_check - last_active_time) > ((unsigned long)dim_backlight_inactive_time*60000)){
    
    #ifdef DEBUG_BACKLIGHT
      debug_serial_port->println(F("check_backlight: I'm asleep!"));
    #endif //DEBUG_BACKLIGHT

    if (keyer_power_led){
      analogWrite(keyer_power_led,keyer_power_led_asleep_duty);
    }      
    lcd.noBacklight();
    
  } else {
    
    #ifdef DEBUG_BACKLIGHT
      debug_serial_port->println(F("check_backlight: I'm awake!"));
    #endif //DEBUG_BACKLIGHT

    if (keyer_power_led){
      analogWrite(keyer_power_led,keyer_power_led_awake_duty);
    }
    lcd.backlight();
  }


}
#endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

//-------------------------------------------------------------------------------------------------------
// claer the scrollable text area of the display
#ifdef FEATURE_DISPLAY

void lcd_scroll_box_clear() {
    mydelay(1);
    #ifdef FEATURE_TFT_DISPLAY
      //if (TFT_VIEWPORT_EXISTS) {
      //    debug_serial_port->println("Close Viewport");
          lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, 6, TFT_BLACK);
      //    lcd.resetViewport();
      //}
      //else {
      //    debug_serial_port->println("Clear scroll box, no Close Viewport");
      //    lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP, SCROLL_BOX_WIDTH, SCROLL_BOX_HEIGHT, 6, TFT_BLACK);
          lcd.setTextColor(TFT_WHITE, TFT_BLACK);
      //}
    #else
        lcd.clear();
        lcd.noCursor();//sp5iou 20180328
    #endif
}
#endif

#ifdef FEATURE_BT_KEYBOARD
char bt_keyboard_read() {
  #ifndef USE_BT_TASK
    check_bt_keyboard();
  #endif
  return queuepop();
}

int bt_keyboard_available() {
  #ifndef USE_BT_TASK
    check_bt_keyboard();
  #endif
  return queue_available();
}
#endif // FEATURE_BT_KEYBOARD

int touch_key_read() {  // if touch_button_available then ther eis a non-zero touch key value set in keyboard_button
  #if defined(FEATURE_TOUCH_DISPLAY)
    #ifndef USE_TOUCH_TASK
      check_touch_buttons();    
    #endif 
    if (button_active) process_buttons();
    return queuepop();
    #else
      return 0;
  #endif
}

int touch_button_available() {
  #if defined(FEATURE_TOUCH_DISPLAY)
    #ifndef USE_TOUCH_TASK
      check_touch_buttons();
    #endif
    if (button_active) process_buttons();
    return queue_available();
  #else
    return 0;
  #endif
}

#ifdef FEATURE_TFT_DISPLAY
void update_icons(void) {
    
    static char GridSq[12] = "CN87xs\0";
    static char last_GridSq[12] = "\0";
    const int32_t row = STATUS_BAR_X_CURSOR;

    lcd.setTextDatum(MY_DATUM);
    //lcd.setFreeFont(STATUS_BAR_FONT);
    lcd.setTextFont(STATUS_BAR_FONT);
    lcd.setTextColor(TFT_BLUE, TFT_BLACK);
    if (strncmp(GridSq, last_GridSq, 6))  // grid changed. update display
    {
      lcd.setTextColor(TFT_DARKCYAN, TFT_BLACK);
      //lcd.drawString("           ", GRID_ANCHOR-1, row;  // 8 digit grid square
      lcd.drawString(GridSq,        GRID_ANCHOR, row);   // blank out space 
      strncpy(last_GridSq, GridSq, 6);  // write grid square
    }

//    GRID_ANCHOR (SCREEN_WIDTH/4)
//    #define WPM_ANCHOR (SCREEN_WIDTH/2)
//    #define ICON_ANCHOR (479-5-(5*COLUMN_WIDTH))
//    #define ICON_WIDTH COLUMN_WIDTH

    char WPM[7] = "\0";
    static int last_WPM = 0;

    if (last_WPM != (int) configuration.wpm)  // wpm changed, update display
    {
      lcd.setTextColor(TFT_CYAN, TFT_BLACK);
      itoa(configuration.wpm, WPM, 10);
      strncat(WPM, "WPM", 6);
      lcd.drawString("       ", WPM_ANCHOR, row);  // erase old
      lcd.drawString(WPM,       WPM_ANCHOR, row);  // WPM rate
      last_WPM = configuration.wpm;
    }

    if (last_sending_mode != sending_mode)    // modes are : Auto, Manual, Auto-Interrupted
    {
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      lcd.drawChar(' ', ICON_ANCHOR, row);
      if (sending_mode == AUTOMATIC_SENDING ) {
          lcd.setTextColor(TFT_ORANGE, TFT_BLACK);
          lcd.drawChar('A', ICON_ANCHOR, row);
      }
      if (sending_mode == AUTOMATIC_SENDING_INTERRUPTED ) {
          lcd.setTextColor(TFT_ORANGE, TFT_BLACK);
          lcd.drawChar('I', ICON_ANCHOR, row);
      }
      if (sending_mode == MANUAL_SENDING ) {
          lcd.setTextColor(TFT_PINK, TFT_BLACK);
          lcd.drawChar('M', ICON_ANCHOR, row);
      }
    }
    static byte last_keyer_machine_mode = 255;

    if (last_keyer_machine_mode != keyer_machine_mode)    // modes are : Beacon KEYER_NORMAL KEYER_COMMAND_MODE
    {
      lcd.setTextColor(TFT_BLACK, TFT_BLACK);
      lcd.drawChar(' ', ICON_ANCHOR+ICON_SPACING, row);
      if (keyer_machine_mode == BEACON ) {
          lcd.setTextColor(TFT_ORANGE, TFT_BLACK);
          lcd.drawChar('B', ICON_ANCHOR+ICON_SPACING, row);
      }
      if (keyer_machine_mode == KEYER_NORMAL ) {
          lcd.setTextColor(TFT_LIGHTGREY, TFT_BLACK);
          lcd.drawChar('N', ICON_ANCHOR+ICON_SPACING, row);
      }
      if (keyer_machine_mode == KEYER_COMMAND_MODE ) {
          lcd.setTextColor(TFT_PINK, TFT_BLACK);
          lcd.drawChar('C', ICON_ANCHOR+ICON_SPACING, row);
      }
      last_keyer_machine_mode = keyer_machine_mode;
    }

    static byte last_ptt_line_activated= 255;

    if (last_ptt_line_activated != ptt_line_activated)  // Tx state changed
    {
      lcd.drawChar(' ', ICON_ANCHOR+(2*ICON_SPACING), row); // Tx Rx state
      if (ptt_line_activated) {
          lcd.setTextColor(TFT_RED, TFT_BLACK);
          lcd.drawChar('T', ICON_ANCHOR+(2*ICON_SPACING), row);
      } else {
          lcd.setTextColor(TFT_GREEN, TFT_BLACK);
          lcd.drawChar('R', ICON_ANCHOR+(2*ICON_SPACING), row);
      }
      last_ptt_line_activated = ptt_line_activated;
    }

    static byte last_pause_sending_buffer = 254;

    if (last_pause_sending_buffer != pause_sending_buffer)
    {
      if (pause_sending_buffer != 0) {
          lcd.setTextColor(TFT_GOLD, TFT_BLACK);
          lcd.drawChar('P', ICON_ANCHOR+(3*ICON_SPACING), row);   // Sending Paused
      } else {
          lcd.setTextColor(TFT_BLACK, TFT_BLACK);
          lcd.drawChar('P', ICON_ANCHOR+(3*ICON_SPACING), row);   
      }
      last_pause_sending_buffer = pause_sending_buffer;
    }

    
