K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
#ifdef FEATURE_DISPLAY
void clear_display_row(byte row_number)
{
    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
        lcd.backlight();
    #endif  //FEATURE_LCD_BACKLIGHT_AUTO_DIM

    #ifndef FEATURE_TFT_DISPLAY
        lcd.noCursor();//sp5iou 20180328
    #endif
  
      // blank out line
    #ifdef FEATURE_TFT_DISPLAY
        lcd.setTextColor(TFT_BLACK, TFT_BLACK);
        lcd.setFreeFont(TFT_FONT_MEDIUM);
        lcd.fillRoundRect(SCROLL_BOX_LEFT_SIDE, SCROLL_BOX_TOP+2+(row_number*FONT_HEIGHT), SCROLL_BOX_WIDTH, FONT_HEIGHT, 6, TFT_BLACK);
        lcd.setTextColor(TFT_WHITE, TFT_BLACK);

        // Loop method
        //int32_t y1 = SCROLL_TOP_LINE+(row_number*FONT_HEIGHT);
        //int32_t x1 = SCROLL_LEFT_SIDE-4+(x*COLUMN_WIDTH);
        //lcd.drawChar(' ', x1, y1);
        //lcd.setTextColor(TFT_WHITE, TFT_BLACK);
    #else
        for (byte x = 0; x < LCD_COLUMNS; x++) {
          lcd.setCursor(x,row_number);
          lcd.print(F(" "));
        }
    #endif
}
#endif

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_DISPLAY
void lcd_center_print_timed(String lcd_print_string, byte row_number, unsigned int duration)
{
  #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
    lcd.backlight();
  #endif  //FEATURE_LCD_BACKLIGHT_AUTO_DIM
  //lcd.noCursor();//sp5iou 20180328
  if (lcd_status != LCD_TIMED_MESSAGE) {
    lcd_previous_status = lcd_status;
    lcd_status = LCD_TIMED_MESSAGE;
    lcd_scroll_box_clear();  // for TFT clears the viewport
  } else {
    clear_display_row(row_number);
  }
  #ifdef FEATURE_TFT_DISPLAY
    lcd.setTextColor(TFT_WHITE, TFT_BLACK); 
    lcd.setFreeFont(TFT_FONT_MEDIUM);
    lcd.setTextDatum(MC_DATUM);
      uint32_t y1 = SCROLL_TEXT_TOP_LINE+(row_number*FONT_HEIGHT);
      lcd.drawString(lcd_print_string, SCROLL_BOX_CENTER, y1, 4);
    lcd.setTextDatum(MY_DATUM);   // restore o generic dataum
  #else
    lcd.setCursor(((LCD_COLUMNS - lcd_print_string.length())/2),row_number);
    lcd.print(lcd_print_string);
  #endif
  mydelay(5);
  lcd_timed_message_clear_time = millis() + duration;
}
#endif

//-------------------------------------------------------------------------------------------------------

void check_for_dirty_configuration()
{
  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering check_for_dirty_configuration"));
  #endif

  //if ((config_dirty) && ((millis()-last_config_write)>30000) && (!send_buffer_bytes) && (!ptt_line_activated)) {
  if ((config_dirty) && ((millis()-last_config_write)>eeprom_write_time_ms) && (!send_buffer_bytes) && (!ptt_line_activated) && (!dit_buffer) && (!dah_buffer) && (!async_eeprom_write) && (paddle_pin_read(paddle_left) == HIGH)  && (paddle_pin_read(paddle_right) == HIGH) ) {
    write_settings_to_eeprom(0);
    last_config_write = millis();
    #ifdef DEBUG_EEPROM
      debug_serial_port->println(F("check_for_dirty_configuration: wrote config\n"));
    #endif
  }

}

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_MEMORIES
void check_memory_repeat() {

  #ifdef DEBUG_LOOP
  debug_serial_port->println(F("loop: entering check_memory_repeat"));
  #endif    
  
  if ((repeat_memory < number_of_memories) && ((millis() - last_memory_repeat_time) > configuration.memory_repeat_time)) {
    add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
    add_to_send_buffer(repeat_memory);
    add_to_send_buffer(' ');  // add display space between messages to clean up presentation.
    last_memory_repeat_time = millis();
    #ifdef DEBUG_MEMORIES
    debug_serial_port->print(F("check_memory_repeat: added repeat_memory to send buffer\n\r"));
    #endif
  }
  
  if (repeat_memory == 255){last_memory_repeat_time = 0;}

}
#endif

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_DEAD_OP_WATCHDOG
void check_for_dead_op()

  // if the dit or dah paddle is stuck, disable the transmitter line after 100 straight dits or dahs
  // go in and out of command mode to clear or just reset the unit

{
  
  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering check_for_dead_op"));
  #endif    
    
  if (dead_op_watchdog_active && ((dit_counter > 100) || (dah_counter > 100))) {
    key_tx = 0;
  }
}
#endif
//-------------------------------------------------------------------------------------------------------

#if (defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_BT_KEYBOARD)) && defined(FEATURE_MEMORIES)

void repeat_memory_msg(byte memory_number){
  
  #ifdef FEATURE_MEMORIES
    repeat_memory = memory_number;
    #ifdef FEATURE_DISPLAY
      if (LCD_COLUMNS < 9){
        lcd_center_print_timed("RptMem" + String(memory_number+1), 0, default_display_msg_delay); 
      } else {
        lcd_center_print_timed("Repeat Memory " + String(memory_number+1), 0, default_display_msg_delay); 
      }
      service_display();
    #endif //FEATURE_DISPLAY
  #endif //FEATURE_MEMORIES
}

#endif //defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_BT_KEYBOARD))

//-------------------------------------------------------------------------------------------------------

#if defined (FEATURE_PS2_KEYBOARD) || defined (FEATURE_BT_KEYBOARD)

void check_ps2_keyboard()
{
    static byte keyboard_tune_on = 0;
    static byte ps2_prosign_flag = 0;
    int work_int = 0;
    uint8_t keystroke = 0;

    #ifdef DEBUG_LOOP
        debug_serial_port->print(F("loop: entering check_ps2_keyboard char = "));
        //debug_serial_port->println(queue);
        if (a != 0) 
            debug_serial_port->println(a);
    #endif    

    /* NOTE!!! This entire block of code is repeated again below the #else.  This was done to fix a bug with Notepad++ not
            collapsing code correctly when while() statements are encapsulated in #ifdef/#endifs.                        */

    #ifdef FEATURE_MEMORIES

        #if defined (FEATURE_PS2_KEYBOARD) || defined(FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)

            #if defined(FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)

                while ((bt_keyboard_available() || touch_button_available()) && (play_memory_prempt == 0)) 
                {  
                    // use BT keyboard char stream  
                    if (bt_keyboard_available())
                      keystroke = bt_keyboard_read();
                    if (touch_button_available())
                      keystroke = touch_key_read();  // certain buttons will be translated to equivalent keystrokes
            #else  // Do PS2 keyboard
                while ((keyboard.available() || touch_button_available()) && (play_memory_prempt == 0)) 
                {      
                    // read the next key                    
                    if (bt_keyboard_available())
                      keystroke = keyboard.read();
                    if (touch_button_available())
                      keystroke = touch_key_read();  // certain buttons will be translated to equivalent keystrokes
            #endif
                    #if defined(DEBUG_PS2_KEYBOARD) || defined(DEBUG_BT_KEYBOARD)
                        debug_serial_port->print(F("check_ps2_keyboard: keystroke: "));
                        debug_serial_port->println(keystroke,DEC);
                    #endif //DEBUG_PS2_KEYBOARD

                    #ifdef FEATURE_SLEEP
                        last_activity_time = millis(); 
                    #endif //FEATURE_SLEEP
                    #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
                        last_active_time = millis(); 
                    #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

