K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                    #if defined (FEATURE_BT_KEYBOARD) 
                        if (bt_keyboard_mode == BT_KEYBOARD_NORMAL) 
                    #else
                        if (ps2_keyboard_mode == PS2_KEYBOARD_NORMAL)
                    #endif
                        {
                            switch (keystroke) 
                            {
                                case PS2_LEFTARROW : sidetone_adj(20); break;
                                case PS2_RIGHTARROW : sidetone_adj(-20); break;
                                //case PS2_PAGEUP : sidetone_adj(20); break;
                                //case PS2_PAGEDOWN : sidetone_adj(-20); break;
                                //case PS2_RIGHTARROW : adjust_dah_to_dit_ratio(int(configuration.dah_to_dit_ratio/10)); break;
                                //case PS2_LEFTARROW : adjust_dah_to_dit_ratio(-1*int(configuration.dah_to_dit_ratio/10)); break;
                                case PS2_UPARROW : speed_set(configuration.wpm+1); break;
                                case PS2_DOWNARROW : speed_set(configuration.wpm-1); break;
                                case PS2_HOME :
                                configuration.dah_to_dit_ratio = initial_dah_to_dit_ratio;
                                key_tx = 1;
                                config_dirty = 1;
                                #ifdef FEATURE_DISPLAY
                                    #ifdef OPTION_MORE_DISPLAY_MSGS
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("DfltRtio", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Default ratio", 0, default_display_msg_delay);
                                    }
                                    service_display();
                                    #endif
                                #endif           
                                break;
                                case PS2_TAB :
                                if (pause_sending_buffer) {
                                    pause_sending_buffer = 0;
                                    #ifdef FEATURE_DISPLAY
                                    #ifdef OPTION_MORE_DISPLAY_MSGS
                                        lcd_center_print_timed(" Resume ", 1, default_display_msg_delay);
                                    #endif
                                    #endif                 
                                } else {
                                    pause_sending_buffer = 1;
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("  Pause  ", 1, default_display_msg_delay);
                                    #endif            
                                }
                                break;  // pause

                                case PS2_SCROLL :   // Prosign next two characters
                                ps2_prosign_flag = 1;
                                #ifdef FEATURE_DISPLAY
                                    #ifdef OPTION_MORE_DISPLAY_MSGS
                                    lcd_center_print_timed("Prosign", 0, default_display_msg_delay);
                                    #endif
                                #endif          
                                break;

                                #ifdef FEATURE_MEMORIES
                                case PS2_F1 : ps2_usb_keyboard_play_memory(0); break;
                                case PS2_F2 : ps2_usb_keyboard_play_memory(1); break;
                                case PS2_F3 : ps2_usb_keyboard_play_memory(2); break;
                                #ifndef OPTION_SAVE_MEMORY_NANOKEYER
                                    case PS2_F4 : ps2_usb_keyboard_play_memory(3); break;
                                    case PS2_F5 : ps2_usb_keyboard_play_memory(4); break;
                                    case PS2_F6 : ps2_usb_keyboard_play_memory(5); break;
                                    case PS2_F7 : ps2_usb_keyboard_play_memory(6); break;
                                    case PS2_F8 : ps2_usb_keyboard_play_memory(7); break;
                                    case PS2_F9 : ps2_usb_keyboard_play_memory(8); break;
                                    case PS2_F10 : ps2_usb_keyboard_play_memory(9); break;
                                    case PS2_F11 : ps2_usb_keyboard_play_memory(10); break;
                                    case PS2_F12 : ps2_usb_keyboard_play_memory(11); break;
                                #endif //OPTION_SAVE_MEMORY_NANOKEYER
                                case PS2_F1_ALT : if (number_of_memories > 0) {repeat_memory_msg(0);} break;
                                case PS2_F2_ALT : if (number_of_memories > 1) {repeat_memory_msg(1);} break;
                                case PS2_F3_ALT : if (number_of_memories > 2) {repeat_memory_msg(2);} break;
                                #ifndef OPTION_SAVE_MEMORY_NANOKEYER
                                    case PS2_F4_ALT : if (number_of_memories > 3) {repeat_memory_msg(3);} break;
                                    case PS2_F5_ALT : if (number_of_memories > 4) {repeat_memory_msg(4);} break;
                                    case PS2_F6_ALT : if (number_of_memories > 5) {repeat_memory_msg(5);} break;
                                    case PS2_F7_ALT : if (number_of_memories > 6) {repeat_memory_msg(6);} break;
                                    case PS2_F8_ALT : if (number_of_memories > 7) {repeat_memory_msg(7);} break;
                                    case PS2_F9_ALT : if (number_of_memories > 8) {repeat_memory_msg(8);} break;
                                    case PS2_F10_ALT : if (number_of_memories > 9) {repeat_memory_msg(9);} break;
                                    case PS2_F11_ALT : if (number_of_memories > 10) {repeat_memory_msg(10);} break;
                                    case PS2_F12_ALT : if (number_of_memories > 11) {repeat_memory_msg(11);} break;
                                #endif //OPTION_SAVE_MEMORY_NANOKEYER
                                #endif //FEATURE_MEMORIES

                                case PS2_DELETE : if (send_buffer_bytes) { send_buffer_bytes--; } break;
                                case PS2_ESC :  // clear the serial send buffer and a bunch of other stuff

                                if (manual_ptt_invoke) {
                                    manual_ptt_invoke = 0;
                                    ptt_unkey();
                                }
                                if (keyboard_tune_on) {
                                    sending_mode = MANUAL_SENDING;
                                    tx_and_sidetone_key(0);
                                    keyboard_tune_on = 0;
                                }
                                if (pause_sending_buffer) {
                                    pause_sending_buffer = 0;
                                }
                                clear_send_buffer();
                                #ifdef FEATURE_BT_KEYBOARD 
                                    queueflush();
                                #endif

                                #ifdef FEATURE_MEMORIES
                                    //clear_memory_button_buffer();
                                    play_memory_prempt = 1;   // should stop playing memory
                                    repeat_memory = 255;
                                #endif

                                #ifdef FEATURE_DISPLAY   // clear out the old text on the scrollable portion of display
                                    lcd_center_print_timed("Abort", 0, default_display_msg_delay);
                                    for (uint16_t i = 0; i < (LCD_ROWS); i++) {
                                        lcd_scroll_buffer[i].clear();
                                }         
                                #endif
                                break;

                                #ifdef FEATURE_MEMORIES
                                case PS2_F1_SHIFT  :
                                    ps2_keyboard_program_memory(0);
                                    break;

                                case PS2_F2_SHIFT  :
                                    ps2_keyboard_program_memory(1);
                                    break;

                                case PS2_F3_SHIFT  :
                                    ps2_keyboard_program_memory(2);
                                    break;


                                #ifndef OPTION_SAVE_MEMORY_NANOKEYER
                                    case PS2_F4_SHIFT  :
                                    ps2_keyboard_program_memory(3);
                                    break;

                                    case PS2_F5_SHIFT  :
                                    ps2_keyboard_program_memory(4);
                                    break;

                                    case PS2_F6_SHIFT  :
                                    ps2_keyboard_program_memory(5);
                                    break;

                                    case PS2_F7_SHIFT  :
                                    ps2_keyboard_program_memory(6);
                                    break;

                                    case PS2_F8_SHIFT  :
                                    ps2_keyboard_program_memory(7);
                                    break;

