K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                                case PS2_T_CTRL :
                                #ifdef FEATURE_MEMORIES
                                    repeat_memory = 255;
                                #endif
                                if (keyboard_tune_on) {
                                    sending_mode = MANUAL_SENDING;
                                    tx_and_sidetone_key(0);
                                    keyboard_tune_on = 0;
                                    #ifdef FEATURE_DISPLAY
                                    lcd_status = LCD_REVERT;
                                    #endif // FEATURE_DISPLAY
                                } else {
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("Tune", 0, default_display_msg_delay);
                                    #endif      
                                    sending_mode = MANUAL_SENDING;
                                    tx_and_sidetone_key(1);
                                    keyboard_tune_on = 1;
                                }
                                break;

                                case PS2_U_CTRL :
                                if (ptt_line_activated) {
                                    manual_ptt_invoke = 0;
                                    ptt_unkey();
                                    #ifdef FEATURE_DISPLAY
                                    lcd_status = LCD_REVERT;
                                    #endif // FEATURE_DISPLAY            
                                } else {
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("PTTInvk", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("PTT Invoke", 0, default_display_msg_delay);
                                    }
                                    #endif      
                                    manual_ptt_invoke = 1;
                                    ptt_key();
                                }
                                break;

                                case PS2_W_CTRL :
                                #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                    lcd_center_print_timed("WPM Adj", 0, default_display_msg_delay);
                                    } else {
                                    lcd_center_print_timed("WPM Adjust", 0, default_display_msg_delay);
                                    }        
                                #else
                                    boop_beep();
                                #endif
                                queueflush();
                                work_int = ps2_keyboard_get_number_input(3,0,1000);
                                if (work_int > 0) {
                                    speed_set(work_int);
                                    #ifdef FEATURE_DISPLAY
                                    lcd_status = LCD_REVERT;
                                    #else
                                    beep();
                                    #endif
                                    config_dirty = 1;
                                }
                                break;

                                case PS2_F1_CTRL :
                                switch_to_tx_silent(1);
                                #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 1", 0, default_display_msg_delay);
                                #endif          
                                break;

                                case PS2_F2_CTRL :
                                if ((ptt_tx_2) || (tx_key_line_2)) {
                                    switch_to_tx_silent(2);          
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 2", 0, default_display_msg_delay);
                                    #endif                      
                                }
                                break;
                                #ifndef OPTION_SAVE_MEMORY_NANOKEYER
                                case PS2_F3_CTRL :
                                if ((ptt_tx_3)  || (tx_key_line_3)) {
                                    switch_to_tx_silent(3);                       
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 3", 0, default_display_msg_delay);
                                    #endif                                  
                                }
                                break;

                                case PS2_F4_CTRL :
                                if ((ptt_tx_4)  || (tx_key_line_4)) {
                                    switch_to_tx_silent(4);   
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 4", 0, default_display_msg_delay);
                                    #endif                                  
                                }
                                break;

                                case PS2_F5_CTRL :
                                if ((ptt_tx_5)  || (tx_key_line_5)) {
                                    switch_to_tx_silent(5);  
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 5", 0, default_display_msg_delay);
                                    #endif                      
                                }
                                break;

                                case PS2_F6_CTRL :
                                if ((ptt_tx_6)  || (tx_key_line_6)) {
                                    switch_to_tx_silent(6);
                                    #ifdef FEATURE_DISPLAY
                                    lcd_center_print_timed("TX 6", 0, default_display_msg_delay);
                                    #endif                                  
                                }
                                break;
                                #endif //OPTION_SAVE_MEMORY_NANOKEYER

                                #ifdef FEATURE_AUTOSPACE
                                case PS2_Z_CTRL:
                                if (configuration.autospace_active) {
                                    configuration.autospace_active = 0;
                                    config_dirty = 1;
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("AutoSOff", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Autospace Off", 0, default_display_msg_delay);
                                    }
                                    #endif                                  
                                } else {
                                    configuration.autospace_active = 1;
                                    config_dirty = 1;
                                    #ifdef FEATURE_DISPLAY
                                    if (LCD_COLUMNS < 9){
                                        lcd_center_print_timed("AutoSpOn", 0, default_display_msg_delay);
                                    } else {
                                        lcd_center_print_timed("Autospace On", 0, default_display_msg_delay);
                                    }            
                                    #endif                                  
                                }
                                break;
                                #endif

                                default :
                                if ((keystroke > 31) && (keystroke < 255 /*123*/)) {
                                    if (ps2_prosign_flag) {
                                    add_to_send_buffer(SERIAL_SEND_BUFFER_PROSIGN);
                                    ps2_prosign_flag = 0;
                                    }
                                    keystroke = uppercase(keystroke);
                                    add_to_send_buffer(keystroke);
                                    #ifdef FEATURE_MEMORIES
                                    repeat_memory = 255;
                                    #endif
                                }
                                break;
                            }
                        } 
                        else 
                        {
                            ;  // nothing for now                        
                        }                        
                }  //while ((keyboard.available()) && (play_memory_prempt == 0))
        #endif
    #endif
}

#endif //FEATURE_PS2_KEYBOARD || defined (FEATURE_BT_KEYBOARD)

//-------------------------------------------------------------------------------------------------------
#if (defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_BT_KEYBOARD)) && defined(FEATURE_MEMORIES)
void ps2_usb_keyboard_play_memory(byte memory_number){

  if (memory_number < number_of_memories) {
    add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
    add_to_send_buffer(memory_number);
    #ifdef FEATURE_MEMORIES
    repeat_memory = 255;
    #endif //FEATURE_MEMORIES
  }
}
#endif  //defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD)
//-------------------------------------------------------------------------------------------------------
#if (defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_BT_KEYBOARD)) && defined(FEATURE_MEMORIES)
void ps2_keyboard_program_memory(byte memory_number)
{

  char keystroke;
  byte looping = 1;
  byte error = 0;
  int temp_memory_index = 0;
  byte temp_memory[(memory_end(memory_number)-memory_start(memory_number) + 1)];
  int x;
  String keyboard_string;

