K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #ifdef FEATURE_DISPLAY
    String lcd_string;
    if (LCD_COLUMNS < 9){
      lcd_string = "Pgm Mem";
    } else {
      lcd_string = "Program Memory";
    }
  #endif

  if (memory_number > (number_of_memories - 1)) {
    boop();
    return;
  }
  
  #ifdef FEATURE_DISPLAY
    if (memory_number < 9) {
      lcd_string.concat(' ');
    }
    lcd_string.concat(memory_number+1);
    lcd_center_print_timed(lcd_string, 0, default_display_msg_delay);
  #else
    boop_beep();
  #endif
  repeat_memory = 255;
  while (looping) {
    #ifdef HARDWARE_ESP32_DEV
      mydelay(1);
    #endif
    #ifdef FEATURE_PS2_KEYBOARD
    while (keyboard.available() == 0) {
    #endif
    #ifdef FEATURE_BT_KEYBOARD
    while (bt_keyboard_available() == 0) {
      mydelay(5);
    #endif
      if (keyer_machine_mode == KEYER_NORMAL) {          // might as well do something while we're waiting
        check_paddles();
        service_dit_dah_buffers();
      }
    }

    #ifdef FEATURE_PS2_KEYBOARD
        keystroke = keyboard.read();
        #ifdef DEBUG_PS2_KEYBOARD
        debug_serial_port->println(keystroke,DEC);
        #endif
    #endif

    #ifdef FEATURE_BT_KEYBOARD
        keystroke = bt_keyboard_read();
        #ifdef DEBUG_BT_KEYBOARD
            debug_serial_port->println(keystroke,DEC);
        #endif
    #endif

    if (keystroke == 13) {        // did we get a carriage return?
      looping = 0;
    } else {
      if (keystroke == PS2_BACKSPACE) {
        if (temp_memory_index) {
          temp_memory_index--;
          #ifdef FEATURE_DISPLAY
            keyboard_string = keyboard_string.substring(0,keyboard_string.length()-1);
            lcd_center_print_timed(keyboard_string, 1, default_display_msg_delay);
          #endif    
        }
      } else {
        if (keystroke == PS2_ESC) {
          looping = 0;
          error = 1;
        } else {
          keystroke = uppercase(keystroke);
          #ifdef FEATURE_DISPLAY
            keyboard_string.concat(char(keystroke));
            if (keyboard_string.length() > LCD_COLUMNS) {
              lcd_center_print_timed(keyboard_string.substring((keyboard_string.length()-LCD_COLUMNS)), 1, default_display_msg_delay);
            } else {         
              lcd_center_print_timed(keyboard_string, 1, default_display_msg_delay);
            }
          #endif
          temp_memory[temp_memory_index] = keystroke;
          temp_memory_index++;
          if (temp_memory_index > (memory_end(memory_number)-memory_start(memory_number))) {
            looping = 0;
          }
        }
      }
    }
  }  //while (looping)

  if (error) {
    #ifdef FEATURE_DISPLAY
      lcd_status = LCD_REVERT;
    #else
    boop();
    #endif
  } else {
    for (x = 0;x < temp_memory_index;x++) {  // write to memory
      EEPROM.write((memory_start(memory_number)+x),temp_memory[x]);
      if ((memory_start(memory_number) + x) == memory_end(memory_number)) {    // are we at last memory location?
        x = temp_memory_index;
      }

    }
    // write terminating 255
    EEPROM.write((memory_start(memory_number)+x),255);
    debug_serial_port->print(F("\nWrote Keyboard Memory "));
    debug_serial_port->println(memory_number);
    #if defined(HARDWARE_ESP32_DEV)
      EEPROM.commit();
    #endif
    #ifdef FEATURE_DISPLAY
      lcd_center_print_timed("Done", LCD_ROWS-2, default_display_msg_delay);
    #else    
      beep();
    #endif
  }
}
#endif

//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_PS2_KEYBOARD) || defined (FEATURE_BT_KEYBOARD)

int ps2_keyboard_get_number_input(byte places,int lower_limit, int upper_limit)
{

  byte looping = 1;
  byte error = 0;
  byte numberindex = 0;
  int numbers[6];
  char keystroke;
  String keyboard_string;

  #ifdef FEATURE_MEMORIES
    repeat_memory = 255;
  #endif

  while (looping) {
    #ifdef HARDWARE_ESP32_DEV
      mydelay(1);
    #endif
    #ifdef FEATURE_PS2_KEYBOARD
    if (keyboard.available() == 0) {        // wait for the next keystroke
    #endif
    #ifdef FEATURE_BT_KEYBOARD
    if (bt_keyboard_available() == 0) {
    #endif
        if (keyer_machine_mode == KEYER_NORMAL) {          // might as well do something while we're waiting
        check_paddles();
        service_dit_dah_buffers();
        service_send_buffer(PRINTCHAR);

        check_ptt_tail();
        #ifdef FEATURE_POTENTIOMETER
          if (configuration.pot_activated) {
            check_potentiometer();
          }
        #endif

        #ifdef FEATURE_SIDETONE_SWITCH
          check_sidetone_switch();
        #endif

        #ifdef FEATURE_ROTARY_ENCODER
          check_rotary_encoder();
        #endif //FEATURE_ROTARY_ENCODER
      }
    } else {
      #ifdef FEATURE_PS2_KEYBOARD        
        keystroke = keyboard.read();
      #endif
      #ifdef FEATURE_BT_KEYBOARD
        keystroke = bt_keyboard_read();
      #endif      
      //debug_serial_port->println(F("[0x"));
      //debug_serial_port->println(keystroke, HEX);
      //debug_serial_port->println(']');
      if ((keystroke > 47) && (keystroke < 58)) {    // ascii 48-57 = "0" - "9")
        numbers[numberindex] = keystroke;
        numberindex++;
        #ifdef FEATURE_DISPLAY
          keyboard_string.concat(String(keystroke-48));
          lcd_center_print_timed(keyboard_string, 1, default_display_msg_delay);
        #endif                     
        if (numberindex > places){
            looping = 0;
            error = 1;
        }
      } else {
        if (keystroke == PS2_BACKSPACE) {
          if (numberindex) {
            numberindex--;
            #ifdef FEATURE_DISPLAY
              keyboard_string = keyboard_string.substring(0,keyboard_string.length()-1);
              lcd_center_print_timed(keyboard_string, 1, default_display_msg_delay);
            #endif             
          }
        } else {
          if (keystroke == PS2_ENTER) {   // carriage return - get out
            looping = 0;
          } else {                 // bogus input - error out
            looping = 0;
            error = 1;
          }
        }
      }
    }
  }
  if (error) {
    boop();
    return(-1);
  } else {
    int y = 1;
    int return_number = 0;
    for (int x = (numberindex - 1); x >= 0 ; x = x - 1) {
      return_number = return_number + ((numbers[x]-48) * y);
      y = y * 10;
    }
    if ((return_number > lower_limit) && (return_number < upper_limit)) {
      return(return_number);
    } else {
      boop();
      return(-1);
    }
  }
}
#endif

//-------------------------------------------------------------------------------------------------------
#if (defined(FEATURE_PS2_KEYBOARD) || defined(FEATURE_USB_KEYBOARD) || defined(FEATURE_BT_KEYBOARD)) && !defined(OPTION_SAVE_MEMORY_NANOKEYER)
void put_serial_number_in_send_buffer()
{

  String serial_number_string;

  #ifdef FEATURE_MEMORIES
  repeat_memory = 255;
  #endif

