K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    while (!all_delays_satisfied){
      mydelay(1);
      #ifdef FEATURE_SEQUENCER
        if (sequencer_1_pin){
          if (((millis() - ptt_activation_time) >= configuration.ptt_active_to_sequencer_active_time[0]) || sequencer_1_active){
            digitalWrite(sequencer_1_pin,sequencer_pins_active_state);
            sequencer_1_ok = 1;
            sequencer_1_active = 1;
          }          
        } else {
          sequencer_1_ok = 1;
        }
        if (sequencer_2_pin){
          if (((millis() - ptt_activation_time) >= configuration.ptt_active_to_sequencer_active_time[1]) || sequencer_2_active){
            digitalWrite(sequencer_2_pin,sequencer_pins_active_state);
            sequencer_2_ok = 1;
            sequencer_2_active = 1;
          } 
        } else {
          sequencer_2_ok = 1;
        }
        if (sequencer_3_pin){
          if (((millis() - ptt_activation_time) >= configuration.ptt_active_to_sequencer_active_time[2]) || sequencer_3_active){
            digitalWrite(sequencer_3_pin,sequencer_pins_active_state);
            sequencer_3_ok = 1;
            sequencer_3_active = 1;
          } 
        } else {
          sequencer_3_ok = 1;
        }
        if (sequencer_4_pin){
          if (((millis() - ptt_activation_time) >= configuration.ptt_active_to_sequencer_active_time[3]) || sequencer_4_active){
            digitalWrite(sequencer_4_pin,sequencer_pins_active_state);
            sequencer_4_ok = 1;
            sequencer_4_active = 1;
          } 
        } else {
          sequencer_4_ok = 1;
        }
        if (sequencer_5_pin){
          if (((millis() - ptt_activation_time) >= configuration.ptt_active_to_sequencer_active_time[4]) || sequencer_5_active){
            digitalWrite(sequencer_5_pin,sequencer_pins_active_state);
            sequencer_5_ok = 1;
            sequencer_5_active = 1;
          } 
        } else {
          sequencer_5_ok = 1;
        }

        if (((millis() - ptt_activation_time) >= configuration.ptt_lead_time[configuration.current_tx-1]) && sequencer_1_ok && sequencer_2_ok && sequencer_3_ok && sequencer_4_ok && sequencer_5_ok){
          all_delays_satisfied = 1;
        }

      #else //FEATURE_SEQUENCER
        #if defined(FEATURE_WINKEY_EMULATION) && !defined(OPTION_WINKEY_PINCONFIG_PTT_CONTROLS_PTT_HOLD)
          if (((millis() - ptt_activation_time) >= configuration.ptt_lead_time[configuration.current_tx-1]) || (winkey_host_open && !winkey_pinconfig_ptt_bit) ) {
            all_delays_satisfied = 1;
          }
        #else
          if ((millis() - ptt_activation_time) >= configuration.ptt_lead_time[configuration.current_tx-1]){
            all_delays_satisfied = 1;
          }
        #endif
      #endif //FEATURE_SEQUENCER

    } //while (!all_delays_satisfied)

  }
  ptt_time = millis();
}
//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_SEQUENCER
void check_sequencer_tail_time(){

  if (sequencer_ptt_inactive_time){
    if (sequencer_1_pin){
      if (sequencer_1_active && ((millis() - sequencer_ptt_inactive_time) >= configuration.ptt_inactive_to_sequencer_inactive_time[0])){
        digitalWrite(sequencer_1_pin,sequencer_pins_inactive_state);
        sequencer_1_active = 0;
      }          
    }
    if (sequencer_2_pin){
      if (sequencer_2_active && ((millis() - sequencer_ptt_inactive_time) >= configuration.ptt_inactive_to_sequencer_inactive_time[1])){
        digitalWrite(sequencer_2_pin,sequencer_pins_inactive_state);
        sequencer_2_active = 0;
      } 
    }
    if (sequencer_3_pin){
      if (sequencer_3_active && ((millis() - sequencer_ptt_inactive_time) >= configuration.ptt_inactive_to_sequencer_inactive_time[2])){
        digitalWrite(sequencer_3_pin,sequencer_pins_inactive_state);
        sequencer_3_active = 0;
      } 
    }
    if (sequencer_4_pin){
      if (sequencer_4_active && ((millis() - sequencer_ptt_inactive_time) >= configuration.ptt_inactive_to_sequencer_inactive_time[3])){
        digitalWrite(sequencer_4_pin,sequencer_pins_inactive_state);
        sequencer_4_active = 0;
      } 
    }
    if (sequencer_5_pin){
      if (sequencer_5_active && ((millis() - sequencer_ptt_inactive_time) >= configuration.ptt_inactive_to_sequencer_inactive_time[4])){
        digitalWrite(sequencer_5_pin,sequencer_pins_inactive_state);
        sequencer_5_active = 0;
      } 
    }
  }

  if (!sequencer_1_active && !sequencer_2_active && !sequencer_3_active && !sequencer_4_active && !sequencer_5_active){
    sequencer_ptt_inactive_time = 0;
  }


}
#endif //FEATURE_SEQUENCER

//-------------------------------------------------------------------------------------------------------
void ptt_unkey(){

  if (ptt_line_activated) {

    #ifdef FEATURE_SO2R_BASE
      if (current_tx_ptt_line) {
        digitalWrite (current_tx_ptt_line, ptt_line_inactive_state);
    #else
      if (configuration.current_ptt_line) {
        digitalWrite (configuration.current_ptt_line, ptt_line_inactive_state);
        #if defined(OPTION_WINKEY_2_SUPPORT) && defined(FEATURE_WINKEY_EMULATION)
          if ((wk2_both_tx_activated) && (ptt_tx_2)) {
            digitalWrite (ptt_tx_2, ptt_line_inactive_state);
          }
        #endif
      #endif //FEATURE_SO2R_BASE
    }
    ptt_line_activated = 0;
    #ifdef FEATURE_SEQUENCER
      sequencer_ptt_inactive_time = millis();
    #endif

    #ifdef FEATURE_SO2R_BASE
      if (so2r_pending_tx) {
        so2r_tx = so2r_pending_tx;
        so2r_pending_tx = 0;
        so2r_set_tx();
      }

      so2r_set_rx();
    #endif //FEATURE_SO2R_BASE

  }
}

//-------------------------------------------------------------------------------------------------------
void check_ptt_tail()
{
  #ifdef DEBUG_LOOP
    debug_serial_port->println(F("loop: entering check_ptt_tail"));
  #endif

  #ifdef FEATURE_SO2R_BASE
    if (so2r_ptt) {
      return;
    }
  #endif

  //static byte manual_ptt_invoke_ptt_input_pin = 0;

  if (ptt_input_pin){
    if ((digitalRead(ptt_input_pin) == ptt_input_pin_active_state)){
      if (!manual_ptt_invoke){
        manual_ptt_invoke = 1;
        manual_ptt_invoke_ptt_input_pin = 1;
        ptt_key();
        return; 
      }
    } else {
      if ((manual_ptt_invoke) && (manual_ptt_invoke_ptt_input_pin)){
        manual_ptt_invoke = 0;
        manual_ptt_invoke_ptt_input_pin = 0;
        if (!key_state){
          ptt_unkey();
        }
      }
    }  
  }


  #if !defined(FEATURE_WINKEY_EMULATION)
    if (key_state) {
      ptt_time = millis();
    } else {
      if ((ptt_line_activated) && (manual_ptt_invoke == 0)) {
        //if ((millis() - ptt_time) > ptt_tail_time) {
        if (last_sending_mode == MANUAL_SENDING) {
          #ifndef OPTION_INCLUDE_PTT_TAIL_FOR_MANUAL_SENDING

