K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
	  case 1111:   // H - set weighting and dah to dit ratio to defaults
          configuration.weighting = default_weighting;
          configuration.dah_to_dit_ratio = initial_dah_to_dit_ratio;
          config_dirty = 1;
          #ifdef FEATURE_DISPLAY
            if (LCD_COLUMNS < 9){
              lcd_center_print_timed("Dflt W+R", 0, default_display_msg_delay); 
            } else {
              lcd_center_print_timed("Dflt Wght & Ratio", 0, default_display_msg_delay); 
            }              
          #endif         
          #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
            send_chars((char*)command_h_weight_dit_dah_ratio_default);  
          #else               
            send_char(command_mode_acknowledgement_character, 0);
          #endif  
          break;  
        case 11:                                                     // I - toggle TX enable / disable
          if (command_mode_disable_tx) {
            command_mode_disable_tx = 0;
            #ifdef FEATURE_DISPLAY
              lcd_center_print_timed("TX On", 0, default_display_msg_delay);
            #endif  
            #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              send_chars((char*)command_i_tx_on);  
            #endif       
          } else {
            command_mode_disable_tx = 1;
            #ifdef FEATURE_DISPLAY
              lcd_center_print_timed("TX Off", 0, default_display_msg_delay);
            #endif        
            #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              send_chars((char*)command_i_tx_off);  
            #endif        
          }
          #if !defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT)
            send_char(command_mode_acknowledgement_character, 0);
          #endif
          break;
        case 1222: command_dah_to_dit_ratio_adjust(); break;                        // J - dah to dit ratio adjust
        #ifndef OPTION_NO_ULTIMATIC
        case 212:                                                                   // K - turn dit and dah buffers on and off
          if (configuration.keyer_mode == ULTIMATIC){
            //send_char('O',KEYER_NORMAL);
            if (configuration.dit_buffer_off){
              configuration.dit_buffer_off = 0;
              configuration.dah_buffer_off = 0;
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS < 9){
                  lcd_center_print_timed("BffersOn", 0, default_display_msg_delay);
                }
                if (LCD_COLUMNS > 17){
                  lcd_center_print_timed("Dit Dah Buffers On", 0, default_display_msg_delay);                  
                } else {
                  lcd_center_print_timed("Buffers On", 0, default_display_msg_delay);
                }                 
              #endif
              #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
                send_chars((char*)command_k_dit_dah_buffers_on);  
              #else
                send_char(command_mode_acknowledgement_character, 0); 
              #endif            
            } else {
              configuration.dit_buffer_off = 1;
              configuration.dah_buffer_off = 1;
              #ifdef FEATURE_DISPLAY
                if (LCD_COLUMNS < 9){
                  lcd_center_print_timed("BffrsOff", 0, default_display_msg_delay);
                }
                if (LCD_COLUMNS > 18){
                  lcd_center_print_timed("Dit Dah Buffers Off", 0, default_display_msg_delay);                  
                } else {
                  lcd_center_print_timed("Buffers Off", 0, default_display_msg_delay);
                }                                  
              #endif  
              #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
                send_chars((char*)command_k_dit_dah_buffers_off);  
              #else
                send_char(command_mode_acknowledgement_character, 0); 
              #endif                           
            }
          } else {
            #ifdef FEATURE_DISPLAY
              lcd_center_print_timed("Error", 0, default_display_msg_delay);
            #endif      
            #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              send_chars((char*)command_error);  
            #else               
              boop();
            #endif                     
          }
          break;
          #endif //OPTION_NO_ULTIMATIC

        case 1211: command_weighting_adjust();break; // L - weight adjust

        case 22: // M - Set command mode WPM
          command_speed_mode(COMMAND_SPEED_MODE_COMMAND_MODE_WPM); 
          break;

        #ifdef FEATURE_MEMORIES
          case 1221: command_program_memory(); break;                       // P - program a memory
        #endif //FEATURE_MEMORIES  Acknowledgement: LA3ZA fixed!
        case 21: // N - paddle mode toggle
          if (configuration.paddle_mode == PADDLE_NORMAL) {
            configuration.paddle_mode = PADDLE_REVERSE;
            #ifdef FEATURE_DISPLAY
              if (LCD_COLUMNS < 9){
                lcd_center_print_timed("Pdl Rev", 0, default_display_msg_delay);
              } else {
                lcd_center_print_timed("Paddle Reverse", 0, default_display_msg_delay);
              }               
            #endif //FEATURE_DISPLAY
            #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              send_chars((char*)command_n_paddle_reverse);  
            #endif               
          } else {
            #ifdef FEATURE_DISPLAY
              if (LCD_COLUMNS < 9){
                lcd_center_print_timed("Pdl Norm", 0, default_display_msg_delay);
              } else {
                lcd_center_print_timed("Paddle Normal", 0, default_display_msg_delay);
              }               
            #endif //FEATURE_DISPLAY   
            #if defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              send_chars((char*)command_n_paddle_normal);  
            #endif                    
            configuration.paddle_mode = PADDLE_NORMAL;
          }
          config_dirty = 1;
          #if !defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
            send_char(command_mode_acknowledgement_character, 0);
          #endif  
          break;  
        case 222: // O - cycle through sidetone modes on, paddle only and off - enhanced by Marc-Andre, VE2EVN
          if (configuration.sidetone_mode == SIDETONE_PADDLE_ONLY) {
            #ifdef FEATURE_DISPLAY
              if (LCD_COLUMNS < 9) {
                lcd_center_print_timed("ST Off", 0, default_display_msg_delay);
              } else {
                lcd_center_print_timed("Sidetone Off", 0, default_display_msg_delay);
              }
            #endif 
            #ifdef DEBUG_COMMAND_MODE
              debug_serial_port->println(F("command_mode: SIDETONE_OFF"));
            #endif
            configuration.sidetone_mode = SIDETONE_OFF;
            #if !defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              boop();
            #else
              send_chars((char*)command_o_sidetone_off); 
            #endif
          } else if (configuration.sidetone_mode == SIDETONE_ON) {
            #ifdef FEATURE_DISPLAY
              if (LCD_COLUMNS < 9){
                lcd_center_print_timed("ST Pdl O", 0, default_display_msg_delay);
              }
              if (LCD_COLUMNS > 19) {
                lcd_center_print_timed("Sidetone Paddle Only", 0, default_display_msg_delay);
              } else {
                lcd_center_print_timed("Sidetone", 0, default_display_msg_delay);
                lcd_center_print_timed("Paddle Only", 1, default_display_msg_delay);
              }
            #endif 
            #ifdef DEBUG_COMMAND_MODE
              debug_serial_port->println(F("command_mode: SIDETONE_PADDLE_ONLY"));
            #endif             
            configuration.sidetone_mode = SIDETONE_PADDLE_ONLY;
            #if !defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              beep();
              mydelay(200);
              beep();
            #else
              send_chars((char*)command_o_sidetone_paddle_only); 
            #endif
          } else {
            #ifdef FEATURE_DISPLAY
              if (LCD_COLUMNS < 9) {
                lcd_center_print_timed("ST On", 0, default_display_msg_delay);
              } else {
                lcd_center_print_timed("Sidetone On", 0, default_display_msg_delay);
              }
            #endif 
            #ifdef DEBUG_COMMAND_MODE
              debug_serial_port->println(F("command_mode: SIDETONE_ON"));
            #endif             
            configuration.sidetone_mode = SIDETONE_ON;
            #if !defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
              beep();
            #else
              send_chars((char*)command_o_sidetone_on); 
            #endif
          }
          config_dirty = 1;        
          break; 
        case 2212: // Q - set keying compensation
//zzzzzz 
          command_keying_compensation_adjust();
          break;

        case 121: command_set_serial_number(); break;  // R - Set serial number

