K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #ifdef FEATURE_DISPLAY
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed("TuneMode", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Tune Mode", 0, default_display_msg_delay);  
    }        
  #endif  
  

  #if !defined(FEATURE_COMMAND_MODE_ENHANCED_CMD_ACKNOWLEDGEMENT) 
    send_char(command_mode_acknowledgement_character, 0);
  #else
    send_chars((char*)command_t_tune_mode); 
  #endif

  key_tx = 1;
  while (looping) {
    mydelay(1);
    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

    if (paddle_pin_read(paddle_left) == LOW) {
      sending_mode = MANUAL_SENDING;
      tx_and_sidetone_key(1);
      ptt_key();
      latched = 0;
    } else {
       if (paddle_pin_read(paddle_left) == HIGH && latched == 0) {
         sending_mode = MANUAL_SENDING;
         tx_and_sidetone_key(0);
         ptt_unkey();
       }
    }

    if (paddle_pin_read(paddle_right) == LOW && latched == 0) {
      latched = 1;
      sending_mode = MANUAL_SENDING;
      tx_and_sidetone_key(1);
      ptt_key();
      while ((paddle_pin_read(paddle_right) == LOW) && (paddle_pin_read(paddle_left) == HIGH)) {
        mydelay(10);
      }
    } else {
      if ((paddle_pin_read(paddle_right) == LOW) && (latched)) {
        latched = 0;
        sending_mode = MANUAL_SENDING;
        tx_and_sidetone_key(0);
        ptt_unkey();
        while ((paddle_pin_read(paddle_right) == LOW) && (paddle_pin_read(paddle_left) == HIGH)) {
          mydelay(10);
        }
      }
    }
    if ((analogbuttonread(0)) || ((paddle_pin_read(paddle_left) == LOW) && (paddle_pin_read(paddle_right) == LOW))) { // if paddles are squeezed or button0 pressed - exit
      looping = 0;
    }
  
  }
  sending_mode = MANUAL_SENDING;
  tx_and_sidetone_key(0);
  ptt_unkey();
  while (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) ) {mydelay(1);}  // wait for all lines to go high
  key_tx = 0;
  send_dit();
  dit_buffer = 0;
  dah_buffer = 0;
}
#endif //FEATURE_COMMAND_MODE
	
//-------------------------------------------------------------------------------------------------------

  void sidetone_adj(int hz) {

    if (((configuration.hz_sidetone + hz) > sidetone_hz_limit_low) && ((configuration.hz_sidetone + hz) < sidetone_hz_limit_high)) {
      configuration.hz_sidetone = configuration.hz_sidetone + hz;
      config_dirty = 1;
      #if defined(FEATURE_DISPLAY) && defined(OPTION_MORE_DISPLAY_MSGS)
        if (LCD_COLUMNS < 9){
          lcd_center_print_timed(String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);
        } else {
          lcd_center_print_timed("Sidetone " + String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);
        }
      #endif   
    }
  }

//-------------------------------------------------------------------------------------------------------
	
#if defined(FEATURE_COMMAND_MODE) && !defined(OPTION_SIDETONE_DIGITAL_OUTPUT_NO_SQUARE_WAVE)
void command_sidetone_freq_adj() {

  byte looping = 1;

  #ifdef FEATURE_DISPLAY
    if (LCD_COLUMNS < 9){
      lcd_center_print_timed(String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);
    } else {
      lcd_center_print_timed("Sidetone " + String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);  
    } 
  #endif

  while (looping) {
    mydelay(1);
    #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220123
        #ifdef FEATURE_M5STACK_CORE2
          M5.Speaker.tone(700, configuration.hz_sidetone);
        #else
          tone(sidetone_line,configuration.hz_sidetone,100);                                              // generate a tone on the speaker pin
        #endif
    #else  
        tone(sidetone_line, configuration.hz_sidetone, 0);
    #endif
    if (paddle_pin_read(paddle_left) == LOW) {
      #ifdef FEATURE_DISPLAY
	#ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
	  sidetone_adj(-5);
	#else
	  sidetone_adj(5);
	#endif                                               // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION  
        if (LCD_COLUMNS < 9){
          lcd_center_print_timed(String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);
        } else {   
          lcd_center_print_timed("Sidetone " + String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);  
        }      
      #else
	#ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
	  sidetone_adj(-1);
	#else
	  sidetone_adj(1);
	#endif                                              // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
      #endif                                                // FEATURE_DISPLAY
      mydelay(10);
    }
    if (paddle_pin_read(paddle_right) == LOW) {
      #ifdef FEATURE_DISPLAY
	#ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
	  sidetone_adj(5);  
	#else
	  sidetone_adj(-5);
	#endif                                              // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
        if (LCD_COLUMNS < 9){
          lcd_center_print_timed(String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);
        } else {   
          lcd_center_print_timed("Sidetone " + String(configuration.hz_sidetone) + " Hz", 0, default_display_msg_delay);  
        }        
      #else
        #ifdef OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
	   sidetone_adj(1); 
        #else
	    sidetone_adj(-1);
	#endif                                              // OPTION_SWAP_PADDLE_PARAMETER_CHANGE_DIRECTION
      #endif                                                // FEATURE_DISPLAY
      mydelay(10);
    }
    while ((paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) || (analogbuttonread(0))) { // if paddles are squeezed or button0 pressed - exit
      mydelay(1);
      looping = 0;
    }

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER

  }
  while (paddle_pin_read(paddle_left) == LOW || paddle_pin_read(paddle_right) == LOW || analogbuttonread(0) ) {mydelay(1);}  // wait for all lines to go high
          #if defined HARDWARE_ESP32_DEV //SP5IOU 20220123
            noTone(sidetone_line);
          #else
            noTone(sidetone_line);
          #endif
}
#endif                                                        //FEATURE_COMMAND_MODE

//-------------------------------------------------------------------------------------------------------
#ifdef FEATURE_COMMAND_MODE
void command_speed_mode(byte mode) {

  byte looping = 1;
  #ifndef FEATURE_DISPLAY
    static char c[4];
  #endif
  //static String wpm_string;
  
