K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  }  // for (int x = 0;x < 12;x++)


}

//-------------------------------------------------------------------------------------------------------

void send_char(byte cw_char, byte omit_letterspace)
{
  #ifdef DEBUG_SEND_CHAR
    debug_serial_port->print(F("send_char: called with cw_char:"));
    debug_serial_port->print((byte)cw_char);
    if (omit_letterspace) {
      debug_serial_port->print(F(" OMIT_LETTERSPACE"));
    }
    debug_serial_port->println();
  #endif


  #ifdef FEATURE_SLEEP
    last_activity_time = millis(); 
  #endif //FEATURE_SLEEP
  #ifdef FEATURE_LCD_BACKLIGHT_AUTO_DIM
    last_active_time = millis(); 
  #endif //FEATURE_LCD_BACKLIGHT_AUTO_DIM

  if ((cw_char == 10) || (cw_char == 13)) { return; }  // don't attempt to send carriage return or line feed

  sending_mode = AUTOMATIC_SENDING;

  if (char_send_mode == CW) {
    switch (cw_char) {
      case 'A': send_the_dits_and_dahs(".-");   break;
      case 'B': send_the_dits_and_dahs("-..."); break;
      case 'C': send_the_dits_and_dahs("-.-."); break;
      case 'D': send_the_dits_and_dahs("-..");  break;
      case 'E': send_the_dits_and_dahs(".");    break;
      case 'F': send_the_dits_and_dahs("..-."); break;
      case 'G': send_the_dits_and_dahs("--.");  break;
      case 'H': send_the_dits_and_dahs("...."); break;
      case 'I': send_the_dits_and_dahs("..");   break;
      case 'J': send_the_dits_and_dahs(".---"); break;
      case 'K': send_the_dits_and_dahs("-.-");  break;
      case 'L': send_the_dits_and_dahs(".-.."); break;
      case 'M': send_the_dits_and_dahs("--");   break;
      case 'N': send_the_dits_and_dahs("-.");   break;
      case 'O': send_the_dits_and_dahs("---");  break;
      case 'P': send_the_dits_and_dahs(".--."); break;
      case 'Q': send_the_dits_and_dahs("--.-"); break;
      case 'R': send_the_dits_and_dahs(".-.");  break;
      case 'S': send_the_dits_and_dahs("...");  break;
      case 'T': send_the_dits_and_dahs("-");    break;
      case 'U': send_the_dits_and_dahs("..-");  break;
      case 'V': send_the_dits_and_dahs("...-"); break;
      case 'W': send_the_dits_and_dahs(".--");  break;
      case 'X': send_the_dits_and_dahs("-..-"); break;
      case 'Y': send_the_dits_and_dahs("-.--"); break;
      case 'Z': send_the_dits_and_dahs("--.."); break;

      case '0': send_the_dits_and_dahs("-----");break;
      case '1': send_the_dits_and_dahs(".----");break;
      case '2': send_the_dits_and_dahs("..---");break;
      case '3': send_the_dits_and_dahs("...--");break;
      case '4': send_the_dits_and_dahs("....-");break;
      case '5': send_the_dits_and_dahs(".....");break;
      case '6': send_the_dits_and_dahs("-....");break;
      case '7': send_the_dits_and_dahs("--...");break;
      case '8': send_the_dits_and_dahs("---..");break;
      case '9': send_the_dits_and_dahs("----.");break;

      case '=': send_the_dits_and_dahs("-...-");   break;
      case '/': send_the_dits_and_dahs("-..-.");   break;
      case '*': send_the_dits_and_dahs("-...-.-"); break;
      case '.': send_the_dits_and_dahs(".-.-.-");  break;
      case ',': send_the_dits_and_dahs("--..--");  break;
      case '!': send_the_dits_and_dahs("--..--");  break;  //sp5iou 20180328
      //case '!': send_the_dits_and_dahs("-.-.--");break;//sp5iou 20180328
      case '\'': send_the_dits_and_dahs(".----."); break; // apostrophe
      case '(': send_the_dits_and_dahs("-.--.");   break;
      case ')': send_the_dits_and_dahs("-.--.-");  break;
      case '&': send_the_dits_and_dahs(".-...");   break;
      //case '&': send_dit(); loop_element_lengths(3); send_dits(3); break;

      case '+': send_the_dits_and_dahs(".-.-.");   break;
      case '-': send_the_dits_and_dahs("-....-");  break;
      case '_': send_the_dits_and_dahs("..--.-");  break;
      case '"': send_the_dits_and_dahs(".-..-.");  break;
      case '$': send_the_dits_and_dahs("...-..-"); break;
      case '@': send_the_dits_and_dahs(".--.-.");  break;
      case '<': send_the_dits_and_dahs(".-.-.");   break; // AR
      case '>': send_the_dits_and_dahs("...-.-");  break; // SK
     



    
      #if defined(OPTION_WINKEY_PROSIGN_COMPATIBILITY)
        case 0x5C: send_the_dits_and_dahs("-..-.");  break;   // Backslash 
        case '[': send_the_dits_and_dahs(".-...");  break;
        case ':': send_the_dits_and_dahs("-.--.");  break;
        case ';': send_the_dits_and_dahs(".-.-");   break;
        case ']': send_the_dits_and_dahs("-.--.");  break;
      #else
        case ':': send_the_dits_and_dahs("---...");  break;
        case ';': send_the_dits_and_dahs("-.-.-.");  break;

      #endif


      case ' ': 
        loop_element_lengths((configuration.length_wordspace-length_letterspace-2),0,configuration.wpm); 
        break;

      #ifdef OPTION_RUSSIAN_LANGUAGE_SEND_CLI    // Contributed by Павел Бирюков, UA1AQC
        case 192: send_the_dits_and_dahs(".-");break; //А
        case 193: send_the_dits_and_dahs("-...");break; //Б
        case 194: send_the_dits_and_dahs(".--");break; //В
        case 195: send_the_dits_and_dahs("--.");break; //Г
        case 196: send_the_dits_and_dahs("-..");break; //Д
        case 197: send_the_dits_and_dahs(".");break; //Е
        case 168: send_the_dits_and_dahs(".");break; //Ё
        case 184: send_the_dits_and_dahs(".");break; //ё
        case 198: send_the_dits_and_dahs("...-");break; //Ж
        case 199: send_the_dits_and_dahs("--..");break; //З
        case 200: send_the_dits_and_dahs("..");break; //И
        case 201: send_the_dits_and_dahs(".---");break; //Й
        case 202: send_the_dits_and_dahs("-.-");break; //К
        case 203: send_the_dits_and_dahs(".-..");break; //Л
        case 204: send_the_dits_and_dahs("--");break; //М
        case 205: send_the_dits_and_dahs("-.");break; //Н
        case 206: send_the_dits_and_dahs("---");break; //О
        case 207: send_the_dits_and_dahs(".--.");break; //П
        case 208: send_the_dits_and_dahs(".-.");break; //Р
        case 209: send_the_dits_and_dahs("...");break; //С
        case 210: send_the_dits_and_dahs("-");break; //Т
        case 211: send_the_dits_and_dahs("..-");break; //У
        case 212: send_the_dits_and_dahs("..-.");break; //Ф
        case 213: send_the_dits_and_dahs("....");break; //Х
        case 214: send_the_dits_and_dahs("-.-.");break; //Ц
        case 215: send_the_dits_and_dahs("---.");break; //Ч
        case 216: send_the_dits_and_dahs("----");break; //Ш
        case 217: send_the_dits_and_dahs("--.-");break; //Щ
        case 218: send_the_dits_and_dahs("--.--");break; //Ъ
        case 219: send_the_dits_and_dahs("-.--");break; //Ы
        case 220: send_the_dits_and_dahs("-..-");break; //Ь
        case 221: send_the_dits_and_dahs("..-..");break; //Э
        case 222: send_the_dits_and_dahs("..--");break; //Ю
        case 223: send_the_dits_and_dahs(".-.-");break; //Я
        case 255: send_the_dits_and_dahs(".-.-");break; //я
      #endif //OPTION_RUSSIAN_LANGUAGE_SEND_CLI

      case '\n': break;
      case '\r': break;
  
