K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  // 2 - speed
  if (configuration.wpm > 99) {
    winkey_port_write(99,1);
  } else {
    byte_to_send = configuration.wpm;
    winkey_port_write(byte_to_send,1);
  }

  // 3 - sidetone
  switch(configuration.hz_sidetone) {
    case WINKEY_SIDETONE_1 : winkey_port_write(1,1); break;
    case WINKEY_SIDETONE_2 : winkey_port_write(2,1); break;
    case WINKEY_SIDETONE_3 : winkey_port_write(3,1); break;
    case WINKEY_SIDETONE_4 : winkey_port_write(4,1); break;
    case WINKEY_SIDETONE_5 : winkey_port_write(5,1); break;
    case WINKEY_SIDETONE_6 : winkey_port_write(6,1); break;
    case WINKEY_SIDETONE_7 : winkey_port_write(7,1); break;
    case WINKEY_SIDETONE_8 : winkey_port_write(8,1); break;
    case WINKEY_SIDETONE_9 : winkey_port_write(9,1); break;
    case WINKEY_SIDETONE_10 : winkey_port_write(10,1); break;
    default: winkey_port_write(5,1); break;
  }

  // 4 - weight
  winkey_port_write(configuration.weighting,1);

  // 5 - ptt lead
  if (configuration.ptt_lead_time[configuration.current_tx-1] < 256){
    winkey_port_write(configuration.ptt_lead_time[configuration.current_tx-1]/10,1);
  } else {
    winkey_port_write(255,1);
  }

  // 6 - ptt tail
  //if (configuration.ptt_tail_time[configuration.current_tx-1] < 256){
    //winkey_port_write((configuration.ptt_tail_time[configuration.current_tx-1] - (3*int(1200/configuration.wpm)))/10,1);
    winkey_port_write(winkey_session_ptt_tail,1);
  // } else {
  //   winkey_port_write(winkey_port_write(255,1);
  // }

  // 7 - pot min wpm
  #ifdef FEATURE_POTENTIOMETER
    winkey_port_write(pot_wpm_low_value,1);
  #else
    winkey_port_write(15,1);
  #endif

  // 8 - pot wpm range
  #ifdef FEATURE_POTENTIOMETER
    winkey_port_write(pot_wpm_high_value - pot_wpm_low_value,1);
  #else
    winkey_port_write(20,1);
  #endif

  // 9 - 1st extension
  winkey_port_write(first_extension_time,1);

  // 10 - compensation
  winkey_port_write(configuration.keying_compensation,1);

  // 11 - farnsworth wpm
  #ifdef FEATURE_FARNSWORTH
    winkey_port_write(configuration.wpm_farnsworth,1);
  #else
    winkey_port_write(zero,1);
  #endif

  // 12 - paddle setpoint
  winkey_port_write(50,1);  // default value

  // 13 - dah to dit ratio
  winkey_port_write(50,1);  // TODO -backwards calculate

  // 14 - pin config
  #ifdef OPTION_WINKEY_2_SUPPORT
    byte_to_send = 0;
    if (configuration.current_ptt_line != 0) {byte_to_send = byte_to_send | 1;}
    if ((configuration.sidetone_mode == SIDETONE_ON) || (configuration.sidetone_mode == SIDETONE_PADDLE_ONLY)) {byte_to_send = byte_to_send | 2;}
    if (current_tx_key_line == tx_key_line_1) {byte_to_send = byte_to_send | 4;}
    if (current_tx_key_line == tx_key_line_2) {byte_to_send = byte_to_send | 8;}
    #ifndef FEATURE_SO2R_BASE
      if (wk2_both_tx_activated) {byte_to_send = byte_to_send | 12;}
    #endif

    #ifndef OPTION_NO_ULTIMATIC
    if (ultimatic_mode == ULTIMATIC_DIT_PRIORITY) {byte_to_send = byte_to_send | 128;}
    if (ultimatic_mode == ULTIMATIC_DAH_PRIORITY) {byte_to_send = byte_to_send | 64;}  
    #endif

    if (ptt_hang_time_wordspace_units == 1.33) {byte_to_send = byte_to_send | 16;}
    if (ptt_hang_time_wordspace_units == 1.66) {byte_to_send = byte_to_send | 32;}
    if (ptt_hang_time_wordspace_units == 2.0) {byte_to_send = byte_to_send | 48;}
    winkey_port_write(byte_to_send,1);
  #else
    winkey_port_write(5,1); // default value
  #endif

  // 15 - pot range
  #ifdef OPTION_WINKEY_2_SUPPORT
    winkey_port_write(zero,1);
  #else
    winkey_port_write(0xFF,1);
  #endif

}
#endif


/*

Chapter One

It was late on a rainy Sunday evening.  Static crashes on the direct conversion receiver signaled a distant thunderstorm, due to arrive in an hour or so.  Colin knew he would have to disconnect the little microcontroller circuit from the receiver and all the station antennas soon, but it was getting late and he had to get his sleep for work the next day.

The contraption was a tangled mess on his desk, something only a radio amateur or mad scientist could appreciate.  Alligator clips connected the I and Q audio from the simple receiver to the microcontroller.  Colin had been learning about fast Fourier analysis.  This was his first attempt at actually running the code in an effort to decode RTTY signals.   The microcontroller probably lacked the horsepower to do it, and Colin knew expecting any sort of performance from his creation was a long shot.

Colin tuned to some RTTY signals but couldn't copy anything, despite carefully and slowly tuning the receiver in hopes of hitting that sweet spot where perhaps the microcontroller would blurt out some intelligence, some discernable word or text.  Just one recognizable snippet would give him the feeling of accomplishment or even victory, even if his design never proved to be usable in his nightly hobby.

The static crashes grew stronger and more frequent.  Colin had resigned himself to the fact that success would not be achieved this evening.  The approaching storm along with his growing fatigue convinced him to shut things down and head upstairs to bed.  Just then a burst of noise, different from the thunderstorm static crashes, but a type that you normally hear on 80 meters each night blurted out.  The microcontroller sent out its serial port a string of random characters, in a vain attempt to decode the sounds:

GEHZCVFNOVTZBEBA

Colin went about the process of disconnecting the power to everything and disconnecting antennas and went to bed.

The next evening after supper with his family, Colin went to his basement radio room again, determined to work again on his project but perhaps less eager than before due to the increasing futility of his efforts.  The microcontroller sat connected to the receiver, and the controller to the computer.  He listened to the receiver in the background while responding to emails.  There was a QSO in progress, an old man talking about his dog itching a lot.  The two old men in the conversation droned on forever, with Colin chuckling to himself, but too caught up in his email to reach over and tune the rig to another frequency in hopes of finding a more interesting conversation.

A burst of noise came through the rig again, much like the night before, though much stronger.  The simple receiver lacked automatic gain control and the strong signal produced a rather loud, annoying noise emanating from the rig, prompting Colin to reach over and turn the volume down.  Colin noticed on his serial terminal program another random string of characters which the microcontroller dutifully decoded:

GEHZCVFNOVTZBEBA

The string looked familiar to Colin.  He copied and pasted the string into search on his computer.  The search produced one hit, the terminal program log from the previous evening.  Colin opened the file and saw the matching string, 16 characters.  "What are the chances of that happening?", he thought.  He looked through his code again, looking for some sort of mistake, pattern in the code algorithm, or some plausible explanation. The receiver belched again:

GEHZCVFNOVTZBEBA

