K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      if (winkey_status == WINKEY_POINTER_03_COMMAND) { // add multiple nulls to buffer
        #ifdef DEBUG_WINKEY
          debug_serial_port->print(F("service_winkey:PTR3_CMD send_buffer_bytes:"));
          debug_serial_port->print(send_buffer_bytes);          
          debug_serial_port->print(F(" winkey_buffer_counter:"));
          debug_serial_port->print(winkey_buffer_counter);
          debug_serial_port->print(F(" winkey_buffer_pointer:"));
          debug_serial_port->println(winkey_buffer_pointer);          
        #endif //DEBUG_WINKEY       
        byte serial_buffer_position_to_overwrite;
        for (byte x = incoming_serial_byte; x > 0; x--) {
          if (winkey_buffer_pointer > 0) {
            serial_buffer_position_to_overwrite = send_buffer_bytes - (winkey_buffer_counter - winkey_buffer_pointer) - 1;
            if ((send_buffer_bytes) && (serial_buffer_position_to_overwrite < send_buffer_bytes )) {
              send_buffer_array[serial_buffer_position_to_overwrite] = SERIAL_SEND_BUFFER_NULL;
            }
            winkey_buffer_pointer++;
          } else {
              add_to_send_buffer(SERIAL_SEND_BUFFER_NULL);
              winkey_buffer_counter++;
          }
        }
        winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
        #ifdef DEBUG_WINKEY
          debug_serial_port->print(F("service_winkey:PTR3_CMD->NO_CMD send_buffer_bytes:"));
          debug_serial_port->print(send_buffer_bytes);          
          debug_serial_port->print(F(" winkey_buffer_counter:"));
          debug_serial_port->print(winkey_buffer_counter);
          debug_serial_port->print(F(" winkey_buffer_pointer:"));
          debug_serial_port->println(winkey_buffer_pointer);          
        #endif //DEBUG_WINKEY 
      }

      if (winkey_status == WINKEY_POINTER_COMMAND) {
        switch (incoming_serial_byte) {
          case 0x00:
            winkey_buffer_counter = 0;
            winkey_buffer_pointer = 0;
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            #ifdef DEBUG_WINKEY
              debug_serial_port->print(F("service_winkey:PTR_CMD->NOCMD send_buffer_bytes:"));
              debug_serial_port->print(send_buffer_bytes);
              debug_serial_port->print(F(" winkey_buffer_counter:"));
              debug_serial_port->print(winkey_buffer_counter);
              debug_serial_port->print(F(" winkey_buffer_pointer:"));
              debug_serial_port->println(winkey_buffer_pointer);
            #endif //DEBUG_WINKEY               
            break;
          case 0x01:
            winkey_status = WINKEY_POINTER_01_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:PTR1_CMD"));
            #endif //DEBUG_WINKEY              
            break;
          case 0x02:
            winkey_status = WINKEY_POINTER_02_COMMAND;  // move to new position in append mode
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:PTR2_CMD"));
            #endif //DEBUG_WINKEY            
            break;
          case 0x03:
            winkey_status = WINKEY_POINTER_03_COMMAND;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:PTR3_CMD"));
            #endif //DEBUG_WINKEY            
            break;
          default:
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:PTR_CMD->NOCMD"));
            #endif //DEBUG_WINKEY            
            break;
        }
      }

      #ifdef OPTION_WINKEY_2_SUPPORT
        if (winkey_status == WINKEY_SEND_MSG) {
          if ((incoming_serial_byte > 0) && (incoming_serial_byte < 7)) {
            add_to_send_buffer(SERIAL_SEND_BUFFER_MEMORY_NUMBER);
            add_to_send_buffer(incoming_serial_byte - 1);
            #ifdef FEATURE_MEMORIES
              repeat_memory = 255;
            #endif
          }
          winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;  
        }
      #endif //OPTION_WINKEY_2_SUPPORT

      if (winkey_status == WINKEY_ADMIN_COMMAND) {
        switch (incoming_serial_byte) {
          case 0x00: 
            winkey_status = WINKEY_UNSUPPORTED_COMMAND;
            winkey_parmcount = 1;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:calib cmd UNSUPPORTED_COMMAND await 1 parm"));
            #endif //DEBUG_WINKEY            
            break;  // calibrate command
          case 0x01:
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:WINKEY_ADMIN_COMMAND 0x01"));
            #endif //DEBUG_WINKEY          
            #if defined(__AVR__) //#ifndef ARDUINO_SAM_DUE
              asm volatile ("jmp 0"); /*wdt_enable(WDTO_30MS); while(1) {};*/ 
            #else
              setup();
            #endif //__AVR__
            break;  // reset command
          case 0x02:  // host open command - send version back to host
            #ifdef OPTION_WINKEY_2_SUPPORT
              winkey_port_write(WINKEY_2_REPORT_VERSION_NUMBER,1);
            #else //OPTION_WINKEY_2_SUPPORT
              winkey_port_write(WINKEY_1_REPORT_VERSION_NUMBER,1);
            #endif //OPTION_WINKEY_2_SUPPORT
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            manual_ptt_invoke = 0;
            winkey_host_open = 1;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD hostopen"));
            #endif //DEBUG_WINKEY  
            #if defined(OPTION_WINKEY_BLINK_PTT_ON_HOST_OPEN)    
              blink_ptt_dits_and_dahs("..");
            #else
              boop_beep();
            #endif         
            break;
          case 0x03: // host close command
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            manual_ptt_invoke = 0;
            winkey_host_open = 0;
            #ifdef OPTION_WINKEY_SEND_VERSION_ON_HOST_CLOSE
              #ifdef OPTION_WINKEY_2_SUPPORT
                winkey_port_write(WINKEY_2_REPORT_VERSION_NUMBER,1);
              #else //OPTION_WINKEY_2_SUPPORT
                winkey_port_write(WINKEY_1_REPORT_VERSION_NUMBER,1);
              #endif //OPTION_WINKEY_2_SUPPORT 
            #endif  //OPTION_WINKEY_SEND_VERSION_ON_HOST_CLOSE           
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD hostclose"));
            #endif //DEBUG_WINKEY                  
            beep_boop();
            config_dirty = 1;
            #if defined(OPTION_WINKEY_2_SUPPORT) && !defined(OPTION_WINKEY_2_HOST_CLOSE_NO_SERIAL_PORT_RESET)
              primary_serial_port->end();
              primary_serial_port->begin(1200);
            #endif
            break;
          case 0x04:  // echo command
            winkey_status = WINKEY_ADMIN_COMMAND_ECHO;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD_ECHO"));
            #endif //DEBUG_WINKEY              
            break;
          case 0x05: // paddle A2D
            winkey_port_write(WINKEY_RETURN_THIS_FOR_ADMIN_PADDLE_A2D,0);
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD paddleA2D"));
            #endif //DEBUG_WINKEY              
            break;
          case 0x06: // speed A2D
            winkey_port_write(WINKEY_RETURN_THIS_FOR_ADMIN_SPEED_A2D,0);
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD speedA2D"));
            #endif //DEBUG_WINKEY              
            break;
          case 0x07: // Get values
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD winkey_admin_get_values"));
            #endif //DEBUG_WINKEY             
            winkey_admin_get_values_command();
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;
          case 0x08: // reserved
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD0x08reserved-WTF"));
            #endif //DEBUG_WINKEY              
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;  
          case 0x09: // get cal
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMDgetcal"));
            #endif //DEBUG_WINKEY           
            winkey_port_write(WINKEY_RETURN_THIS_FOR_ADMIN_GET_CAL,0);
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;
          #ifdef OPTION_WINKEY_2_SUPPORT
          case 0x0a: // set wk1 mode (10)
            wk2_mode = 1;
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD wk2_mode1"));
            #endif //DEBUG_WINKEY              
            break;
          case 0x0b: // set wk2 mode (11)
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD wk2_mode2"));
            #endif //DEBUG_WINKEY              
            beep();
            beep();
            wk2_mode = 2;
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;            
          case 0x0c: // download EEPPROM 256 bytes (12)
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD winkey_eeprom_download"));
            #endif //DEBUG_WINKEY           
            winkey_eeprom_download();
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;   
          case 0x0d: // upload EEPROM 256 bytes (13)
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD uploadEEPROM"));
            #endif //DEBUG_WINKEY           
            winkey_status = WINKEY_UNSUPPORTED_COMMAND;  // upload EEPROM 256 bytes
            winkey_parmcount = 256;
            break;       
          case 0x0e: //(14)
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD WINKEY_SEND_MSG"));
            #endif //DEBUG_WINKEY          
            winkey_status = WINKEY_SEND_MSG;
            break;
          case 0x0f: // load xmode (15)
            winkey_status = WINKEY_UNSUPPORTED_COMMAND;
            winkey_parmcount = 1;
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD loadxmode"));
            #endif //DEBUG_WINKEY            
            break;            
          case 0x10: // reserved (16)
            winkey_port_write(zero,0);
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;
          case 0x11: // set high baud rate (17)
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD sethighbaudrate"));
            #endif //DEBUG_WINKEY            
            primary_serial_port->end();
            primary_serial_port->begin(9600);
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;
          case 0x12: // set low baud rate (18)
            #ifdef DEBUG_WINKEY
              debug_serial_port->println(F("service_winkey:ADMIN_CMD setlowbaudrate"));
            #endif //DEBUG_WINKEY           
            primary_serial_port->end();
            primary_serial_port->begin(1200);
            winkey_status = WINKEY_NO_COMMAND_IN_PROGRESS;
            break;
          #endif //OPTION_WINKEY_2_SUPPORT  

          #ifdef FEATURE_SO2R_BASE
            case 0xF0: // Send SO2R device information
              #ifdef DEBUG_WINKEY
                debug_serial_port->println(F("service_winkey:ADMIN_CMD getSO2Rdeviceinfo"));
              #endif
            
              static const uint8_t device_info[] = { 0xAA, 0x55, 0xCC, 0x33, // Header
                                                     1, 0, 0, // SO2R Major, minor, patch
                                                     1, 0, // Protocol major, minor
                                                     0, // capabilities - bit 0 is stereo reverse, others undefined
                                                     };

