K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}
#endif
//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void process_serial_command(PRIMARY_SERIAL_CLS * port_to_use) {
  
  int user_input_temp = 0;

  #ifdef FEATURE_AMERICAN_MORSE
    static int previous_dah_to_dit_ratio = 300;
  #endif //FEATURE_AMERICAN_MORSE
        
  //port_to_use->println();
  switch (incoming_serial_byte) {
    case '~':
      #if defined(__AVR__)
        asm volatile ("jmp 0"); /*wdt_enable(WDTO_30MS); while(1) {} ;*/ 
      #else //__AVR__
        setup();
      #endif //__AVR__
      break;  // ~ - reset unit
    case '*':                                                // * - paddle echo on / off
      if (cli_paddle_echo) {
        cli_paddle_echo = 0;
      } else {
        cli_paddle_echo = 1;
      }
      break;
    #if defined(FEATURE_STRAIGHT_KEY_ECHO)
      case '`':
        if (cli_straight_key_echo) {
          cli_straight_key_echo = 0;
        } else {
          cli_straight_key_echo = 1;
        }    
        break;
    #endif //FEATURE_STRAIGHT_KEY_ECHO
    case '+': cli_prosign_flag = 1; break;
    #if defined(FEATURE_SERIAL_HELP)
      case '?': print_serial_help(port_to_use,0); break;                         // ? = print help
      case '/': print_serial_help(port_to_use,1); break;                         // / = paged help
    #endif //FEATURE_SERIAL_HELP
    case 'A':  // A - Iambic A mode
      configuration.keyer_mode = IAMBIC_A; 
      configuration.dit_buffer_off = 0;
      configuration.dah_buffer_off = 0;
      config_dirty = 1; 
      port_to_use->println(F("\r\nIambic A")); 
      break;    
    case 'B':  // B - Iambic B mode
      configuration.keyer_mode = IAMBIC_B;
      configuration.dit_buffer_off = 0;
      configuration.dah_buffer_off = 0;      
      config_dirty = 1;
      port_to_use->println(F("\r\nIambic B")); 
      break;    
    case 'C':  // C - single paddle mode
      configuration.keyer_mode = SINGLE_PADDLE; 
      config_dirty = 1; port_to_use->println(F("\r\nSingle Paddle")); 
      break;    

    #ifndef OPTION_NO_ULTIMATIC
      case 'D': // D - Ultimatic mode
        configuration.keyer_mode = ULTIMATIC; 
        configuration.dit_buffer_off = 1;
        configuration.dah_buffer_off = 1;        
        config_dirty = 1; 
        port_to_use->println(F("\r\nUltimatic")); 
        break;  
    #endif
    case 'E': serial_set_serial_number(port_to_use); break;                                   // E - set serial number
    case 'F': serial_set_sidetone_freq(port_to_use); break;                                   // F - set sidetone frequency
    case 'G': configuration.keyer_mode = BUG; config_dirty = 1; port_to_use->println(F("\r\nBug")); break;              // G - Bug mode
    #ifdef FEATURE_HELL
      case 'H': // H - Hell mode
        if ((char_send_mode == CW) || (char_send_mode == AMERICAN_MORSE)){
          char_send_mode = HELL; port_to_use->println(F("\r\nHell Mode"));
        } else {
          char_send_mode = CW; port_to_use->println(F("\r\nCW Mode"));
        }  
        break;         
    #endif //FEATURE_HELL
    #ifdef FEATURE_AMERICAN_MORSE
      case '=': // = - American Morse
        if ((char_send_mode == CW) || (char_send_mode == HELL)){
          char_send_mode = AMERICAN_MORSE; port_to_use->println(F("\r\nAmerican Morse Mode"));
          previous_dah_to_dit_ratio = configuration.dah_to_dit_ratio;
          configuration.dah_to_dit_ratio = 200;
        } else {
          char_send_mode = CW; port_to_use->println(F("\r\nInternational CW Mode"));
          configuration.dah_to_dit_ratio = previous_dah_to_dit_ratio;
        }  
        break;         
    #endif //FEATURE_AMERICAN_MORSE


    case 'I':                                                                      // I - transmit line on/off
      //port_to_use->print(F("\r\nTX o")); //WD9DMP-1
      if (key_tx && keyer_machine_mode != KEYER_COMMAND_MODE) { //Added check that keyer is NOT in command mode or keyer might be enabled for paddle commands (WD9DMP-1)
        key_tx = 0;
        port_to_use->println(F("\r\nTX off")); //WD9DMP-1
      } else if (!key_tx && keyer_machine_mode != KEYER_COMMAND_MODE) { //Added check that keyer is NOT in command mode or keyer might be enabled for paddle commands (WD9DMP-1)
        key_tx = 1;
        port_to_use->println(F("\r\nTX on")); //WD9DMP-1
      }
      else {port_to_use->print(F("\r\nERROR: Keyer in Command Mode\r\n"));} //Print error message if keyer in Command Mode and user tries to change tx line(s) on/off. (WD9DMP-1)
      break;
    #ifdef FEATURE_MEMORIES
      case 33: repeat_play_memory(port_to_use); break;      // ! - repeat play
      case 124: serial_set_memory_repeat(port_to_use); break; // | - set memory repeat time
      case 48: serial_play_memory(9); break;    // 0 - play memory 10
      case 49:                                  // 1-9 - play memory #
      case 50:
      case 51:
      case 52:
      case 53:
      case 54: 
      case 55:
      case 56: 
      case 57: serial_play_memory(incoming_serial_byte-49); break;
      case 80: repeat_memory = 255; serial_program_memory(port_to_use); break;                                // P - program memory
    #endif //FEATURE_MEMORIES
    case 'Q': serial_qrss_mode(); break; // Q - activate QRSS mode
    case 'R': speed_mode = SPEED_NORMAL; port_to_use->println(F("\r\nQRSS Off")); break; // R - activate regular timing mode
    case 'S': serial_status(port_to_use); break;                                              // S - Status command
    case 'J': serial_set_dit_to_dah_ratio(port_to_use); break;                          // J - dit to dah ratio
    #ifdef FEATURE_TRAINING_COMMAND_LINE_INTERFACE
      case 'K': serial_cw_practice(port_to_use); break;                     // K - CW practice
    #endif //FEATURE_TRAINING_COMMAND_LINE_INTERFACE
    case 'L': serial_set_weighting(port_to_use); break;
    #ifdef FEATURE_FARNSWORTH
      case 'M': serial_set_farnsworth(port_to_use); break;                                // M - set Farnsworth speed
    #endif
    case 'N':                                                                // N - paddle reverse
      port_to_use->print(F("\r\nPaddles "));
      if (configuration.paddle_mode == PADDLE_NORMAL) {
        configuration.paddle_mode = PADDLE_REVERSE;
        port_to_use->println(F("Reversed"));
      } else {
        configuration.paddle_mode = PADDLE_NORMAL;
        port_to_use->println(F("Normal"));
      }
      config_dirty = 1;
    break;
    case 'O': // O - cycle through sidetone modes on, paddle only and off - enhanced by Marc-Andre, VE2EVN
      port_to_use->print(F("\r\nSidetone "));
      if (configuration.sidetone_mode == SIDETONE_PADDLE_ONLY) {
        configuration.sidetone_mode = SIDETONE_OFF;
        boop();      
        port_to_use->println(F("Off"));
      } else if (configuration.sidetone_mode == SIDETONE_ON) {
        configuration.sidetone_mode = SIDETONE_PADDLE_ONLY;
        beep();
        mydelay(200);
        beep();
        port_to_use->println(F("Paddle Only"));
      } else {
        configuration.sidetone_mode = SIDETONE_ON;
        beep();
        port_to_use->println(F("On"));
      }
      config_dirty = 1;
    break;


    case 'T': // T - tune
      #ifdef FEATURE_MEMORIES
        repeat_memory = 255;
      #endif
      serial_tune_command(port_to_use); break;
    case 'U':
      port_to_use->print(F("\r\nPTT O"));
      if (ptt_line_activated) {
        manual_ptt_invoke = 0;
        ptt_unkey();
        port_to_use->println(F("ff"));
      } else {
        manual_ptt_invoke = 1;
        configuration.ptt_disabled = 0;
        config_dirty = 1;
        ptt_key();
        port_to_use->println(F("n"));
      }
      break;
    #ifdef FEATURE_POTENTIOMETER
      case 'V':                // V - toggle pot activation
        port_to_use->print(F("\r\nPotentiometer "));
        configuration.pot_activated = !configuration.pot_activated;
        if (configuration.pot_activated) {
          port_to_use->print(F("A"));
        } else {
          port_to_use->print(F("Dea"));
        }
        port_to_use->println(F("ctivated"));
        config_dirty = 1;
        break;
      case '}':
        serial_set_pot_low_high(port_to_use);
        break;
    #endif
    case 'W': serial_wpm_set(port_to_use);break;                                        // W - set WPM
    case 'X': serial_switch_tx(port_to_use);break;                                      // X - switch transmitter
    case 'Y': serial_change_wordspace(port_to_use); break;
    #ifdef FEATURE_AUTOSPACE
      case 'Z':
        port_to_use->print(F("\r\nAutospace O"));
        if (configuration.autospace_active) {
          configuration.autospace_active = 0;
          config_dirty = 1;
          port_to_use->println(F("ff"));
        } else {
          configuration.autospace_active = 1;
          config_dirty = 1;
          port_to_use->println(F("n"));
        }
        break;
    #endif
    
    case 92:  // \ - double backslash - clear serial send buffer
      clear_send_buffer();
      #if !defined(OPTION_DISABLE_SERIAL_PORT_CHECKING_WHILE_SENDING_CW)
        loop_element_lengths_breakout_flag = 0;
      #endif
      #ifdef FEATURE_MEMORIES
        play_memory_prempt = 1;
        repeat_memory = 255;
      #endif
      break;                           
  
