K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//           } else { //(user_input_buffer[0] == 27)
          
//           // we have a callsign, nr, or section
          
//             switch(current_field){
//               case FIELD_CALLSIGN:
//                 callsign = "";
//                 for (byte x = 0; x < user_input_buffer_characters; x++) {
//                   callsign.concat(char(user_input_buffer[x]));
//                 } 
//                 current_field = FIELD_NR;
//                 break;
                
//               case FIELD_NR:
//                 nr = "";
//                 for (byte x = 0; x < user_input_buffer_characters; x++) {
//                   nr.concat(char(user_input_buffer[x]));
//                 }               
//                 current_field = FIELD_SECTION;
//                 break;
                
//               case FIELD_SECTION:
//                 section = "";
//                 for (byte x = 0; x < user_input_buffer_characters; x++) {
//                   section.concat(char(user_input_buffer[x]));
//                 }               
//                 current_field = FIELD_CALLSIGN;
//                 break;
//             }
//             term.position(13,0);
//             term.print(callsign);
//             term.position(13,9);
//             term.print(nr);
//             term.position(13,14);
//             term.println(section);
//             term.position(15,0);
//             term.print(F("                     ")); 
//             term.position(15,0);                
//           }
//         } //(user_input_buffer[0] == '\\')
//       } //(user_input_buffer_characters > 0)
//       process_user_input_buffer = 0; 
//       user_input_buffer_characters = 0;    
//       escape_flag_time = 0;
//     } //((process_user_input_buffer) && ((escape_flag_time == 0) || ((millis() -escape_flag_time) > 100)))
  
//     //do autonomous events
//     service_send_buffer(NOPRINT);
    
//     switch(overall_state){
//       case CONTEST_PRACTICE_CQ_SENT:
//         if (send_buffer_bytes == 0){
//           if (!cq_answered){
//             if (((millis() - transition_time) > random(250,1500))){  // add some random delay
//               callsign = generate_callsign();
//               caller_sidetone = random(500,1000);
//               configuration.hz_sidetone = caller_sidetone;
//               caller_wpm_delta = random(-5,5);
//               configuration.wpm = configuration.wpm + caller_wpm_delta;
//               for (byte x = 0; x < (callsign.length()); x++) {
//                 add_to_send_buffer(callsign[x]);
//               }
//               cq_answered = 1;
//               transition_time = millis();
//             }
//           } else {  //send it again
//             if ((cq_answered) && ((millis() - transition_time) > random(2000,4000))){
//               configuration.hz_sidetone = caller_sidetone;
//               configuration.wpm = configuration.wpm + caller_wpm_delta;
//               for (byte x = 0; x < (callsign.length()); x++) {
//                 add_to_send_buffer(callsign[x]);
//               }            
//               cq_answered++;
//               transition_time = millis();            
//             }
//           }
//         } else {
//           transition_time = millis();
//         } //send_buffer_bytes == 0
//         break;  //CONTEST_PRACTICE_CQ_SENT
//     } //switch(overall_state)
//   } //while (loop1)
  
//   configuration.hz_sidetone = previous_sidetone;
//   configuration.wpm = previous_wpm;
//   send_buffer_bytes = 0;
// }  
// #endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_cw_practice(PRIMARY_SERIAL_CLS * port_to_use) {


  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';

  check_serial_override = 1;

  byte previous_key_tx_state = key_tx;
  key_tx = 0;
  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      mydelay(1);
      port_to_use->read();
    }  
   
    port_to_use->println(F("\r\n\nCW Training Menu\n"));
    port_to_use->println(F("C - Receive Practice"));
    port_to_use->println(F("I - Keyboard Interactive Receive Practice"));
    port_to_use->println(F("R - Random Groups Receive Practice"));
    port_to_use->println(F("W - Wordsworth Receive Practice"));
    port_to_use->println(F("E - Receive / Transmit Echo Practice"));
    //port_to_use->println(F("2 - PA QSO Party");   // Don't think this is working right / wasn't finished - Goody 2017-05-01
    port_to_use->println(F("\nX - Exit\n"));
    
    menu_loop2 = 1;
    
    while (menu_loop2) {
      mydelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)){
          menu_loop2 = 0;
        }
      }
    }
      
    incoming_char = toUpperCase(incoming_char);
    
    switch(incoming_char){
      case 'X': menu_loop = 0; break;
      case 'C': serial_receive_practice_menu(port_to_use,PRACTICE_NON_INTERACTIVE); break;
      case 'I': serial_receive_practice_menu(port_to_use,PRACTICE_INTERACTIVE); break;
      case 'R': serial_random_menu(port_to_use); break;
      case 'W': serial_wordsworth_menu(port_to_use); break;
      case 'E': serial_receive_transmit_echo_menu(port_to_use); break;
      //case '2': paqso_practice(port_to_use); break;
    } //switch(incoming_char)
    
  } //while(menu_loop)
      
  port_to_use->println(F("Exited Training module..."));
  check_serial_override = 0;
  key_tx = previous_key_tx_state;
  paddle_echo_buffer = 0; 
}
#endif

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_receive_transmit_echo_menu(PRIMARY_SERIAL_CLS * port_to_use) {


  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  
  while(menu_loop) {
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      mydelay(1);
      port_to_use->read();
    }  
   
    port_to_use->println(F("\r\n\nReceive / Transmit Echo Practice Menu\n"));
    port_to_use->println(F("I - International Callsigns"));
    port_to_use->println(F("U - US Callsigns"));
    port_to_use->println(F("E - European Callsigns"));
    port_to_use->println(F("C - Canadian Callsigns"));
    port_to_use->println(F("P - Progressive 5 Character Groups"));
    port_to_use->println(F("2 - Two Letter Words"));
    port_to_use->println(F("3 - Three Letter Words"));
    port_to_use->println(F("4 - Four Letter Words"));
    port_to_use->println(F("N - Names"));
    port_to_use->println(F("Q - QSO Words"));
    port_to_use->println(F("M - Mixed\n"));
    port_to_use->println(F("\nX - Exit\n"));
    
    menu_loop2 = 1;
    
    while (menu_loop2) {   
      mydelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)) {
          menu_loop2 = 0;
        }
      }
    }
      
    incoming_char = toUpperCase(incoming_char);

