K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        }

        // does the user want to exit?
        while(port_to_use->available() > 0) {
          incoming_char = port_to_use->read();
          user_send_loop = 0;
          loop1 = 0;
          loop2 = 0;
          if (correct_answer_led) digitalWrite(correct_answer_led, LOW);                 // clear the LEDs as we exit
          if (wrong_answer_led)   digitalWrite(wrong_answer_led,   LOW);
        }
        #ifdef FEATURE_BUTTONS
          while (analogbuttonread(0)) {                                                 // can exit by pressing the Command Mode button
            mydelay(1);
            user_send_loop = 0;
            loop1 = 0;
            loop2 = 0;
            if (correct_answer_led) digitalWrite(correct_answer_led, LOW);              // clear the LEDs as we exit
            if (wrong_answer_led)   digitalWrite(wrong_answer_led,   LOW);
          }
        #endif                                                                          // FEATURE_BUTTONS

      }                                                                                 //while (user_send_loop)

      if (loop1 && loop2) {

        if (progressive_step_counter < 255) {                                          // we're in progressive mode
          if (user_sent_cw.substring(0,progressive_step_counter) == cw_to_send_to_user.substring(0,progressive_step_counter)) {  // characters are correct
            if (correct_answer_led) digitalWrite(correct_answer_led, HIGH);             // set the correct answer LED high
            if (wrong_answer_led)   digitalWrite(wrong_answer_led,    LOW);             // clear the wrong answer LED
            beep();
            send_char(' ',0);
            send_char(' ',0);
            progressive_step_counter++;
            if (progressive_step_counter == 6) {                                        // all five characters are correct
              loop2 = 0;
              unsigned int NEWtone               =  400;                                // the initial tone freuency for the tone sequence
              unsigned int TONEduration          =   50;                                // define the duration of each tone element in the tone sequence to drive a speaker
              for (int k=0; k<6; k++) {                                                 // a loop to generate some increasing tones
                 #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220115
                    #ifdef FEATURE_M5STACK_CORE2a
                        M5.Speaker.tone(NEWtone, TONEduration);
                    #else
                        tone(sidetone_line,NEWtone,TONEduration);                                              // generate a tone on the speaker pin
                    #endif
                #else  
                    tone(sidetone_line,NEWtone);                                            // generate a tone on the speaker pin
                    mydelay(TONEduration);                                                    // hold the tone for the specified delay period
                    noTone(sidetone_line);
                #endif                                                  // turn off the tone
                NEWtone = NEWtone*1.25;                                                 // calculate a new value for the tone frequency
              }                                                                         // end for
              send_char(' ', 0);
              send_char(' ', 0);
            }
          } else {                                                                      // characters are wrong
            if (wrong_answer_led)   digitalWrite(wrong_answer_led,  HIGH);              // set the wrong answer LED high
            if (correct_answer_led) digitalWrite(correct_answer_led, LOW);              // clear the correct answer LED
            boop();
            send_char(' ', 0);
            send_char(' ', 0);
          }
        } else {
          if (user_sent_cw == cw_to_send_to_user) {                                     // we only get here if progressive_step_counter is equal to 255
            beep();
            send_char(' ', 0);
            send_char(' ',0);        
            loop2 = 0;
          } else {
            boop();
            send_char(' ',0);
            send_char(' ',0);
          }
        }
      }

    }                           // loop2
  }                             // loop1

  
  speed_mode = speed_mode_before; 
  configuration.keyer_mode = keyer_mode_before;
  paddle_echo_buffer = 0;
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

//---------------------------------------------------------------------
	    
#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_receive_practice_menu(PRIMARY_SERIAL_CLS * port_to_use,byte practice_mode){

  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  
  while(menu_loop) {
 
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      mydelay(1);
      port_to_use->read();
    }  
   
    if (practice_mode == PRACTICE_INTERACTIVE){
      port_to_use->println(F("\r\n\nInteractive Receive Practice Menu\n"));
    } else {
      port_to_use->println(F("\r\n\nReceive Practice Menu\n"));
    }
    port_to_use->println(F("I - International Callsigns"));
    port_to_use->println(F("U - US Callsigns"));
    port_to_use->println(F("E - European Callsigns"));
    port_to_use->println(F("C - Canadian Callsigns"));
    port_to_use->println(F("2 - Two Letter Words"));
    port_to_use->println(F("3 - Three Letter Words"));
    port_to_use->println(F("4 - Four Letter Words"));
    port_to_use->println(F("N - Names"));
    port_to_use->println(F("Q - QSO Words"));
    port_to_use->println(F("M - Mixed Words\n"));    
    port_to_use->println(F("\nX - Exit\n"));
    menu_loop2 = 1;
    
    while (menu_loop2){
      mydelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)){
          menu_loop2 = 0;
        }
      }
    }
      
    incoming_char = toUpperCase(incoming_char);
    
