K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    if (practice_mode == PRACTICE_INTERACTIVE){
      switch(incoming_char){
        case 'X': menu_loop = 0; break;
        case 'I': serial_practice_interactive(port_to_use,CALLSIGN_INTERNATIONAL); break;
        case 'U': serial_practice_interactive(port_to_use,CALLSIGN_US); break;
        case 'E': serial_practice_interactive(port_to_use,CALLSIGN_EUROPEAN); break;
        case 'C': serial_practice_interactive(port_to_use,CALLSIGN_CANADA); break;  
        case '2': serial_practice_interactive(port_to_use,PRACTICE_2_CHAR_WORDS); break;
        case '3': serial_practice_interactive(port_to_use,PRACTICE_3_CHAR_WORDS); break;
        case '4': serial_practice_interactive(port_to_use,PRACTICE_4_CHAR_WORDS); break;
        case 'N': serial_practice_interactive(port_to_use,PRACTICE_NAMES); break;
        case 'M': serial_practice_interactive(port_to_use,PRACTICE_MIXED); break;
        case 'Q': serial_practice_interactive(port_to_use,PRACTICE_QSO_WORDS); break;
      } //switch(incoming_char)
    } else {
      switch(incoming_char){
        case 'X': menu_loop = 0; break;
        case 'I': serial_practice_non_interactive(port_to_use,CALLSIGN_INTERNATIONAL); break;
        case 'U': serial_practice_non_interactive(port_to_use,CALLSIGN_US); break;
        case 'E': serial_practice_non_interactive(port_to_use,CALLSIGN_EUROPEAN); break;
        case 'C': serial_practice_non_interactive(port_to_use,CALLSIGN_CANADA); break; 
        case '2': serial_practice_non_interactive(port_to_use,PRACTICE_2_CHAR_WORDS); break;
        case '3': serial_practice_non_interactive(port_to_use,PRACTICE_3_CHAR_WORDS); break;
        case '4': serial_practice_non_interactive(port_to_use,PRACTICE_4_CHAR_WORDS); break;
        case 'N': serial_practice_non_interactive(port_to_use,PRACTICE_NAMES); break;
        case 'M': serial_practice_non_interactive(port_to_use,PRACTICE_MIXED); break;
        case 'Q': serial_practice_non_interactive(port_to_use,PRACTICE_QSO_WORDS); break;               
      } // switch(incoming_char)

    }
  } // while(menu_loop)
      
  port_to_use->println(F("Exiting callsign training..."));
  
}
#endif

//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_set_wordspace_parameters(PRIMARY_SERIAL_CLS * port_to_use,byte mode_select) {

  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  unsigned int temp_value;

  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      mydelay(1);
      port_to_use->read();
    }  
  
    switch(mode_select){
      case WORDSWORTH_WORDSPACE: port_to_use->print(F("\r\nEnter Wordspace >")); break;
      case WORDSWORTH_WPM: port_to_use->print(F("\r\nEnter WPM >")); break;
      case WORDSWORTH_REPETITION: port_to_use->print(F("\r\nEnter Repetition >")); break;
    }


    menu_loop2 = 1;
    temp_value = 0;
    
    while (menu_loop2){
      mydelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char > 47) && (incoming_char < 58)){
          port_to_use->print(incoming_char);
          temp_value = (temp_value * 10) + (incoming_char - 48);
        }
        if (incoming_char == 13){  // Enter Key
          menu_loop2 = 0;
        }
      }
    }
      
    // validate value     
    if (temp_value == 0){
      menu_loop = 0;        // just blow out if nothing was entered
    } else {
      if ((temp_value > 0) && (temp_value < 101) && (mode_select == WORDSWORTH_WPM)){
        configuration.wpm = temp_value;
        config_dirty = 1;
        menu_loop = 0;
      } else {
        if ((temp_value > 1) && (temp_value < 13) && (mode_select == WORDSWORTH_WORDSPACE)){
          configuration.wordsworth_wordspace = temp_value;
          config_dirty = 1;
          menu_loop = 0;     
        } else { 
          if ((temp_value > 0) && (temp_value < 11) && (mode_select == WORDSWORTH_REPETITION)){
            configuration.wordsworth_repetition = temp_value;
            config_dirty = 1;
            menu_loop = 0;     
          } else {           
            port_to_use->println(F("\r\nOMG that's an invalid value. Try again, OM..."));
          }
        }
      }
    }
    
  } //while(menu_loop)
      
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)


//---------------------------------------------------------------------

#if defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)
void serial_random_menu(PRIMARY_SERIAL_CLS * port_to_use){

  byte menu_loop = 1;
  byte menu_loop2 = 1;
  char incoming_char = ' ';
  
  while(menu_loop){
  
    while (port_to_use->available() > 0) {  // clear out the buffer if anything is there
      mydelay(1);
      port_to_use->read();
    }  
    
    port_to_use->println(F("\r\n\nRandom Code Receive Practice Menu\n"));
    port_to_use->println(F("A - Letter Groups"));
    port_to_use->println(F("1 - Number Groups"));
    port_to_use->println(F("M - Mixed Groups"));
    port_to_use->println(F("\nX - Exit\n"));

    menu_loop2 = 1;
    
    while (menu_loop2){
      mydelay(1);
      if (port_to_use->available()){
        incoming_char = port_to_use->read();
        if ((incoming_char != 10) && (incoming_char != 13)){
          menu_loop2 = 0;
        }
      }
    }

    incoming_char = toUpperCase(incoming_char);

    switch(incoming_char){
      case 'A': random_practice(port_to_use,RANDOM_LETTER_GROUPS,5); break;
      case '1': random_practice(port_to_use,RANDOM_NUMBER_GROUPS,5); break;
      case 'M': random_practice(port_to_use,RANDOM_MIXED_GROUPS,5); break;
      case 'X': menu_loop = 0; break;        
    } //switch(incoming_char)
    
  } //while(menu_loop)
      
  port_to_use->println(F("Exiting Random code module..."));
}
#endif //defined(FEATURE_SERIAL) && defined(FEATURE_TRAINING_COMMAND_LINE_INTERFACE) && defined(FEATURE_COMMAND_LINE_INTERFACE)

