K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  if (configuration.ptt_disabled){
    port_to_use->println(F("PTT: Disabled"));
  }

  port_to_use->print(F("TX Inhibit: O"));
  if ((digitalRead(tx_inhibit_pin) == tx_inhibit_pin_active_state)){
    port_to_use->println(F("n"));
  } else {
    port_to_use->println(F("ff"));
  }  
  port_to_use->print(F("TX Pause: O"));
  if ((digitalRead(tx_pause_pin) == tx_pause_pin_active_state)){
    port_to_use->println(F("n"));
  } else {
    port_to_use->println(F("ff"));
  }  

  #if defined(FEATURE_BEACON_SETTING)
    port_to_use->print(F("Beacon Mode At Boot Up: O"));
    if (configuration.beacon_mode_on_boot_up){
      port_to_use->println(F("n"));
    } else {
      port_to_use->println(F("ff"));
    }  
  #endif

  #if defined(FEATURE_PADDLE_ECHO)
    port_to_use->print(F("Paddle Echo: O"));
    if (cli_paddle_echo){
      port_to_use->println(F("n"));
    } else {
      port_to_use->println(F("ff"));
    }  
    port_to_use->print(F("Paddle Echo Timing Factor: "));
    port_to_use->println((float)configuration.cw_echo_timing_factor/(float)100);
  #endif


  #if defined(FEATURE_STRAIGHT_KEY_ECHO)
    port_to_use->print(F("Straight Key Echo: O"));
    if (cli_straight_key_echo){
      port_to_use->println(F("n"));
    } else {
      port_to_use->println(F("ff"));
    }  
  #endif

  port_to_use->print(F("Tx"));                                                  // show the ptt lead time for the current tx
  port_to_use->print(configuration.current_tx);
  port_to_use->print(F(" lead time: "));
  port_to_use->println(configuration.ptt_lead_time[configuration.current_tx - 1]);
  port_to_use->print(F("Tx"));                                                  // show the ptt tail time for the current tx
  port_to_use->print(configuration.current_tx);
  port_to_use->print(F(" tail time: "));
  port_to_use->println(configuration.ptt_tail_time[configuration.current_tx - 1]);

  port_to_use->print(F("PTT hang time: "));                                     // show the hang time
  port_to_use->print(ptt_hang_time_wordspace_units);
  port_to_use->println(F(" wordspace units"));
  port_to_use->print(F("Memory repeat time: "));                                // show the memory repeat time
  port_to_use->println(configuration.memory_repeat_time);

  #ifdef FEATURE_MEMORIES
    serial_status_memories(port_to_use);
  #endif

  #ifdef DEBUG_MEMORYCHECK
    memorycheck();
  #endif

  #ifdef DEBUG_VARIABLE_DUMP
    port_to_use->println(configuration.wpm);
    #ifdef FEATURE_FARNSWORTH
      port_to_use->println(configuration.wpm_farnsworth);
    #endif //FEATURE_FARNSWORTH
    port_to_use->println(1.0*(float(configuration.weighting)/50));
    port_to_use->println(configuration.keying_compensation,DEC);
    port_to_use->println(2.0-(float(configuration.weighting)/50));
    port_to_use->println(-1.0*configuration.keying_compensation);
    port_to_use->println((dit_end_time-dit_start_time),DEC);
    port_to_use->println((dah_end_time-dah_start_time),DEC);
    port_to_use->println(millis(),DEC);
  #endif //DEBUG_VARIABLE_DUMP
  
  #ifdef DEBUG_BUTTONS
    for (int x = 0;x < analog_buttons_number_of_buttons;x++) {
      port_to_use->print(F("analog_button_array:   "));
      port_to_use->print(x);
      port_to_use->print(F(" button_array_low_limit: "));
      port_to_use->print(button_array_low_limit[x]);
      port_to_use->print(F("  button_array_high_limit: "));
      port_to_use->println(button_array_high_limit[x]);
    }
  #endif 
//aaaaaaa
  #if defined(FEATURE_ETHERNET)
#if defined(FEATURE_WIFI) //SP5IOU 20220129
    port_to_use->print(F("\nWifi connected to "));
    port_to_use->print(WiFi.SSID());
    port_to_use->print(F(" RSSI: "));
    port_to_use->println(WiFi.RSSI());

#endif
//    port_to_use->print(F("Ethernet: "));
    port_to_use->print(F("IP Address: ")); //SP5IOU 20220129
    port_to_use->print(configuration.ip[0]);
    port_to_use->print(F("."));
    port_to_use->print(configuration.ip[1]);
    port_to_use->print(F("."));
    port_to_use->print(configuration.ip[2]);
    port_to_use->print(F("."));
    port_to_use->println(configuration.ip[3]);      
  #endif

  port_to_use->println(F(">"));
  
}
#endif

//---------------------------------------------------------------------



#if defined(OPTION_PROSIGN_SUPPORT)
char * convert_prosign(byte prosign_code)
{

  switch(prosign_code){
    case PROSIGN_AA: return((char*)"AA"); break;
    case PROSIGN_AS: return((char*)"AS"); break;
    case PROSIGN_BK: return((char*)"BK"); break;
    case PROSIGN_CL: return((char*)"CL"); break;
    case PROSIGN_CT: return((char*)"CT"); break;
    case PROSIGN_KN: return((char*)"KN"); break;
    case PROSIGN_NJ: return((char*)"NJ"); break;
    case PROSIGN_SK: return((char*)"SK"); break;
    case PROSIGN_SN: return((char*)"SN"); break;
    case PROSIGN_HH: return((char*)"HH"); break; // iz0rus
    default: return((char*)""); break;

  }

}
#endif //OPTION_PROSIGN_SUPPORT

//---------------------------------------------------------------------

int convert_cw_number_to_ascii (long number_in)
{

  // number_in:  1 = dit, 2 = dah, 9 = a space

  switch (number_in) {
    case 12: return 65; break;         // A
    case 2111: return 66; break;
    case 2121: return 67; break;
    case 211: return 68; break;
    case 1: return 69; break;
    case 1121: return 70; break;
    case 221: return 71; break;
    case 1111: return 72; break;
    case 11: return 73; break;
    case 1222: return 74; break;
    case 212: return 75; break;
    case 1211: return 76; break;
    case 22: return 77; break;
    case 21: return 78; break;
    case 222: return 79; break;
    case 1221: return 80; break;
    case 2212: return 81; break;
    case 121: return 82; break;
    case 111: return 83; break;
    case 2: return 84; break;
    case 112: return 85; break;
    case 1112: return 86; break;
    case 122: return 87; break;
    case 2112: return 88; break;
    case 2122: return 89; break;
    case 2211: return 90; break;    // Z

    case 22222: return 48; break;    // 0
    case 12222: return 49; break;
    case 11222: return 50; break;
    case 11122: return 51; break;
    case 11112: return 52; break;
    case 11111: return 53; break;
    case 21111: return 54; break;
    case 22111: return 55; break;
    case 22211: return 56; break;
    case 22221: return 57; break;
    case 112211: return '?'; break;  // ?
    case 21121: return 47; break;   // /
    #if !defined(OPTION_PROSIGN_SUPPORT)
      case 2111212: return '*'; break; // BK 
    #endif 
//    case 221122: return '!'; break;  // ! sp5iou 20180328
    case 221122: return ','; break; 
    case 121212: return '.'; break;
    case 122121: return '@'; break;
    case 222222: return 92; break;  // special hack; six dahs = \ (backslash)
    case 21112: return '='; break;  // BT
    case 211112: return '-'; break;
    //case 2222222: return '+'; break;
    case 9: return 32; break;       // special 9 = space

    #ifndef OPTION_PS2_NON_ENGLISH_CHAR_LCD_DISPLAY_SUPPORT
      case 12121: return '+'; break;
    #else

      case 212122: return 33; break; // ! //sp5iou
      case 1112112: return 36; break; // $ //sp5iou
      #if !defined(OPTION_PROSIGN_SUPPORT)
        case 12111: return 38; break; // & // sp5iou
      #endif  
      case 122221: return 39; break; // ' // sp5iou
      case 121121: return 34; break; // " // sp5iou
      case 112212: return 95; break; // _ // sp5iou
      case 212121: return 59; break; // ; // sp5iou
      case 222111: return 58; break; // : // sp5iou
      case 212212: return 41; break; // KK (stored as ascii ) ) // sp5iou
      #if !defined(OPTION_PROSIGN_SUPPORT)
        case 111212: return 62; break; // SK (stored as ascii > ) // sp5iou
      #endif
      case 12121: return 60; break; // AR (store as ascii < ) // sp5iou
    #endif //OPTION_PS2_NON_ENGLISH_CHAR_LCD_DISPLAY_SUPPORT


