K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
//---------------------------------------------------------------------

#ifdef FEATURE_MEMORIES
byte memory_nonblocking_delay(unsigned long delaytime)
{
  // 2012-04-20 was long starttime = millis();
  unsigned long starttime = millis();

  while ((millis() - starttime) < delaytime) {
    mydelay(1);
    check_paddles();
    #ifdef FEATURE_BUTTONS
      if (((dit_buffer) || (dah_buffer) || (analogbuttonread(0))) && (keyer_machine_mode != BEACON)) {   // exit if the paddle or button0 was hit
    #else
      if (((dit_buffer) || (dah_buffer)) && (keyer_machine_mode != BEACON)) {   // exit if the paddle or button0 was hit
    #endif
      dit_buffer = 0;
      dah_buffer = 0;
      #ifdef FEATURE_BUTTONS
        while (analogbuttonread(0)) {mydelay(1);}
      #endif
      return 1;
    }
  }
  return 0;
}

#endif

//---------------------------------------------------------------------
void check_button0()
{
  #ifdef FEATURE_BUTTONS
    if (analogbuttonread(0)) {button0_buffer = 1;}
  #endif
}

//---------------------------------------------------------------------
/*

program HelloWorld;

{ HelloWorld version 2019.12.27.02 by K3NG }

VAR
 Callsign:string; 

BEGIN
 Write('What is your callsign: ');
 Readln(Callsign);
 WriteLn('Hello ', Callsign);
END.

*/
//---------------------------------------------------------------------
#if defined(FEATURE_MEMORIES) || defined(FEATURE_COMMAND_LINE_INTERFACE)
void send_serial_number(byte cut_numbers,int increment_serial_number,byte buffered_sending){

  String serial_number_string;

  serial_number_string = String(serial_number, DEC);
  if (serial_number_string.length() < 3 ) {
    if (cut_numbers){
      if (buffered_sending){
        add_to_send_buffer('T');
      } else {
        if (keyer_machine_mode != KEYER_COMMAND_MODE){display_serial_number_character('T');} //Display the SN as well as play it unless playing back after programming for verification(WD9DMP)
        send_char('T',KEYER_NORMAL);
      }
    } else {
      if (buffered_sending){
        add_to_send_buffer('0');
      } else {
        if (keyer_machine_mode != KEYER_COMMAND_MODE){display_serial_number_character('0');} //Display the SN as well as play it unless playing back after programming for verification(WD9DMP)
        send_char('0',KEYER_NORMAL);
      }
    }
  }
  if (serial_number_string.length() == 1) {
    if (cut_numbers){
      if (buffered_sending){
        add_to_send_buffer('T');
      } else {
        if (keyer_machine_mode != KEYER_COMMAND_MODE){display_serial_number_character('T');} //Display the SN as well as play it unless playing back after programming for verification(WD9DMP)
        send_char('T',KEYER_NORMAL);
      }
    } else {
      if (buffered_sending){
        add_to_send_buffer('0');
      } else {
        if (keyer_machine_mode != KEYER_COMMAND_MODE){display_serial_number_character('0');} //Display the SN as well as play it unless playing back after programming for verification(WD9DMP)
        send_char('0',KEYER_NORMAL);
      }
    }
  }
  for (unsigned int a = 0; a < serial_number_string.length(); a++)  {
    if ((serial_number_string[a] == '0') && (cut_numbers)){
      if (buffered_sending){
        add_to_send_buffer('T');
      } else {
        if (keyer_machine_mode != KEYER_COMMAND_MODE){display_serial_number_character('T');} //Display the SN as well as play it unless playing back after programming for verification(WD9DMP)
        send_char('T',KEYER_NORMAL);
      }
    } else {
      if ((serial_number_string[a] == '9') && (cut_numbers)) {
        if (buffered_sending){
          add_to_send_buffer('N');
        } else {
          if (keyer_machine_mode != KEYER_COMMAND_MODE){display_serial_number_character('N');} //Display the SN as well as play it unless playing back after programming for verification(WD9DMP)
          send_char('N',KEYER_NORMAL);
        }
      } else {
        if (buffered_sending){
          add_to_send_buffer(serial_number_string[a]);        
        } else {
          if (keyer_machine_mode != KEYER_COMMAND_MODE){display_serial_number_character(serial_number_string[a]);} //Display the SN as well as play it unless playing back after programming for verification(WD9DMP)
          send_char(serial_number_string[a],KEYER_NORMAL);
        }

     }
    }
  }

  serial_number = serial_number + increment_serial_number;

}

#endif
//New function below to send serial number character to CLI as well as LCD (WD9DMP)
//---------------------------------------------------------------------
#if defined(FEATURE_MEMORIES) || defined(FEATURE_COMMAND_LINE_INTERFACE)
void display_serial_number_character(char snumchar){
  #if defined(FEATURE_SERIAL)
  #ifdef FEATURE_COMMAND_LINE_INTERFACE
    primary_serial_port->write(snumchar);
    #ifdef FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
      secondary_serial_port->write(snumchar);
    #endif //FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
  #endif //FEATURE_COMMAND_LINE_INTERFACE
#endif // (FEATURE_SERIAL)
#ifdef FEATURE_DISPLAY
  if (lcd_send_echo) {
    display_scroll_print_char(snumchar);
    service_display();
    }
#endif // FEATURE_DISPLAY
}

#endif
//---------------------------------------------------------------------
	
#ifdef FEATURE_MEMORIES
byte play_memory(byte memory_number) {
  
  unsigned int jump_back_to_y = 9999;
  byte jump_back_to_memory_number = 255;
  static byte prosign_flag = 0;
  static byte prosign_before_flag = 0;
  byte eeprom_byte_read = 0;  
  byte pause_sending_buffer_backspace = 0;

  play_memory_prempt = 0;

  #if defined(OPTION_PROSIGN_SUPPORT)
    byte eeprom_temp = 0;
    static char * prosign_temp = 0;
  #endif  

  if (memory_number > (number_of_memories - 1)) {
    boop();
    return 0;
  }

  #ifdef DEBUG_PLAY_MEMORY
    debug_serial_port->print(F("play_memory: called with memory_number:"));
    debug_serial_port->println(memory_number);
  #endif  
  
  #ifdef FEATURE_MEMORY_MACROS
    byte eeprom_byte_read2;
    int z;
    byte input_error;
    byte delay_result = 0;
    int int_from_macro;
  #endif //FEATURE_MEMORY_MACROS

  button0_buffer = 0;

  if (keyer_machine_mode == KEYER_NORMAL) {
    #if defined(FEATURE_SERIAL)
      #ifdef FEATURE_WINKEY_EMULATION
        if (primary_serial_port_mode != SERIAL_WINKEY_EMULATION) {
          primary_serial_port->println();
        }
      #else
        primary_serial_port->println();
      #endif

      #ifdef FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
        secondary_serial_port->println();
      #endif //FEATURE_COMMAND_LINE_INTERFACE_ON_SECONDARY_PORT
    #endif
  }
  
  for (int y = (memory_start(memory_number)); (y < (memory_end(memory_number)+1)); y++) {

