K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  //write terminating 255 at end
  #ifdef DEBUG_MEMORY_WRITE
    debug_serial_port->println(F("program_memory: writing memory termination"));
  #endif

  EEPROM.write((memory_start(memory_number) + memory_location_index),255);

  #ifdef OPTION_PROG_MEM_TRIM_TRAILING_SPACES
    for (int x = (memory_location_index-1); x > 0; x--) {
      if (EEPROM.read((memory_start(memory_number) + x)) == 32) {
        EEPROM.write((memory_start(memory_number) + x),255);
      } else {
        x = 0;
      }
    }
  #endif

  #ifdef FEATURE_DISPLAY
    lcd_center_print_timed("Done", LCD_ROWS-2, default_display_msg_delay);
  #endif

  play_memory(memory_number);
}
#endif

//---------------------------------------------------------------------

#ifdef FEATURE_MEMORIES
int memory_start(byte memory_number) {
  return (memory_area_start + (memory_number * ((memory_area_end - memory_area_start) / number_of_memories)));
}
#endif

//---------------------------------------------------------------------

#ifdef FEATURE_MEMORIES
int memory_end(byte memory_number) {
  return (memory_start(memory_number) - 1 + ((memory_area_end - memory_area_start)/number_of_memories));
}
#endif

//---------------------------------------------------------------------
// Paddle and Key Interrupt Handlers
/*-----------------------------------------------------------*/

#if defined(HARDWARE_ESP32_DEV) && !defined(FEATURE_MCP23017_EXPANDER)
//---------------------------------------------------------------------
static void IRAM_ATTR left_paddle_intr_handler(void *arg)
{
    paddle_left_state = gpio_get_level((gpio_num_t) paddle_left); 
}

//---------------------------------------------------------------------
static void IRAM_ATTR right_paddle_intr_handler(void *arg)
{
    paddle_right_state = gpio_get_level((gpio_num_t) paddle_right);   
}

//---------------------------------------------------------------------
#ifdef FEATURE_STRAIGHT_KEY
  static void IRAM_ATTR straight_key_intr_handler(void *arg)
  {
      straight_key_state = gpio_get_level((gpio_num_t) pin_straight_key);       
  }
#endif

//---------------------------------------------------------------------
void init_ESP32_GPIO_key_pins(void) {        
    // Setup CPU side GPIO interrupts for paddle pins
    gpio_install_isr_service(0);
    gpio_set_direction((gpio_num_t) paddle_left, GPIO_MODE_INPUT);
    gpio_set_pull_mode((gpio_num_t) paddle_left, GPIO_PULLUP_ONLY);  // no pullup on pin 35
    gpio_set_intr_type((gpio_num_t) paddle_left, GPIO_INTR_ANYEDGE);
    gpio_set_direction((gpio_num_t) paddle_right, GPIO_MODE_INPUT);
    gpio_set_pull_mode((gpio_num_t) paddle_right, GPIO_PULLUP_ONLY);  // no pullup on pin 35
    gpio_set_intr_type((gpio_num_t) paddle_right, GPIO_INTR_ANYEDGE);
    gpio_isr_handler_add((gpio_num_t) paddle_left, left_paddle_intr_handler, (void *)(gpio_num_t) paddle_left);
    gpio_isr_handler_add((gpio_num_t) paddle_right, right_paddle_intr_handler, (void *)(gpio_num_t) paddle_right);
    #ifdef FEATURE_STRAIGHT_KEY
      // Setup CPU side GPIO interrupt for straight key 
      gpio_set_direction((gpio_num_t) pin_straight_key, GPIO_MODE_INPUT);
      gpio_set_pull_mode((gpio_num_t) pin_straight_key, GPIO_PULLUP_ONLY);  // no pullup on pin 35
      gpio_set_intr_type((gpio_num_t) pin_straight_key, GPIO_INTR_ANYEDGE);
      gpio_isr_handler_add((gpio_num_t) pin_straight_key, straight_key_intr_handler, (void *)(gpio_num_t) pin_straight_key);
    #endif
    // Now any pin state change will call the handler.
}
#endif

//---------------------------------------------------------------------
#if defined(FEATURE_MCP23017_EXPANDER) && defined(HARDWARE_ESP32_DEV)
#define BIT_PADDLE_LEFT	  ( 1 << 0)
#define BIT_PADDLE_RIGHT	( 1 << 1)    
#define BIT_STRAIGHT_KEY	( 1 << 2)
#include "freertos/FreeRTOS.h"
#include <freertos/event_groups.h>
//------ For Port Expander Only ---------------------------------------------------------------
static void IRAM_ATTR paddle_intr_handler(void *arg)
{
    // On interrupt set bit in event group
    BaseType_t hp_task, xResult;
    BaseType_t xHigherPriorityTaskWoken = pdFALSE;
    if (xEventGroupSetBitsFromISR(Key_Events,  BIT_PADDLE_LEFT | BIT_PADDLE_RIGHT | BIT_STRAIGHT_KEY, &hp_task) != pdFAIL) {        
      #if ESP_IDF_VERSION >= ESP_IDF_VERSION_VAL(5, 0, 0)        
        portYIELD_FROM_ISR(hp_task);
      #else
        portYIELD_FROM_ISR();
      #endif
    }
}

//-------------------------------------------------------------------
void read_io_handler(void *pvParameters)
{
    EventBits_t e_bits;
    uint16_t bits = 0;
    mydelay(100);
    while (1)
    {
        if (xEventGroupWaitBits(Key_Events, BIT_PADDLE_LEFT | BIT_PADDLE_RIGHT | BIT_STRAIGHT_KEY, pdTRUE, pdFALSE, portMAX_DELAY)) {
            mcp23x17_port_read(&MCP23017, &bits);  // read all pins                    
            paddle_left_state = bits & (1 << paddle_left);  // mask left paddle                                    
            paddle_right_state = bits & (1 << paddle_right);  // mask right paddle                         
            #ifdef FEATURE_STRAIGHT_KEY
                straight_key_state = bits & (1 << pin_straight_key);  // mask right paddle                             
            #endif
            bits = 0x00;
        }
        vTaskDelay(1);
    } 
}

//-------------------------------------------------------------------

  void init_MCP23017(void) {
    BaseType_t xReturned;

    Key_Events = xEventGroupCreate();
    // Set the expander port A pins for the paddles to input with pullup
    //Wire1.begin(CONFIG_I2CDEV_DEFAULT_SDA_PIN, CONFIG_I2CDEV_DEFAULT_SCL_PIN, 1000000);   // Touch has 1 instance set in library so we get 2nd
    ESP_ERROR_CHECK(i2cdev_init());  // on 21, 22.  Use bus num 1 since the TP assumes bus 0.
    ESP_ERROR_CHECK(mcp23x17_init_desc(&MCP23017, MCP23X17_ADDR, I2C_NUM_1, (gpio_num_t ) CONFIG_I2CDEV_DEFAULT_SDA_PIN, (gpio_num_t ) CONFIG_I2CDEV_DEFAULT_SCL_PIN));
    MCP23017.cfg.master.clk_speed = 1000000;
    
    mcp23x17_set_mode(&MCP23017, paddle_left, MCP23X17_GPIO_INPUT);
    mcp23x17_set_pullup(&MCP23017, paddle_left, true);
    mcp23x17_set_interrupt(&MCP23017, paddle_left, MCP23X17_INT_ANY_EDGE);

    mcp23x17_set_mode(&MCP23017, paddle_right, MCP23X17_GPIO_INPUT);
    mcp23x17_set_pullup(&MCP23017, paddle_right, true);
    mcp23x17_set_interrupt(&MCP23017, paddle_right, MCP23X17_INT_ANY_EDGE);
    
    #ifdef FEATURE_STRAIGHT_KEY
        mcp23x17_set_mode(&MCP23017, pin_straight_key, MCP23X17_GPIO_INPUT);
        mcp23x17_set_pullup(&MCP23017, pin_straight_key, true);
        mcp23x17_set_interrupt(&MCP23017, pin_straight_key, MCP23X17_INT_ANY_EDGE);
    #endif

