K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    // create task that sets the global variable for paddle pin state when interrupt event arrives for our watched pins.
    xReturned = xTaskCreate(read_io_handler, "read_io_handler", 4096, NULL, 0, NULL);

    // Setup CPU side GPIO interrupt for IntA 
    gpio_set_direction((gpio_num_t) MCP23017_INTA_GPIO, GPIO_MODE_INPUT);
    //gpio_set_pull_mode((gpio_num_t) MCP23017_INTA_GPIO, GPIO_PULLUP_ONLY);  // no pullup on pin 35
    gpio_set_intr_type((gpio_num_t) MCP23017_INTA_GPIO, GPIO_INTR_ANYEDGE);
    gpio_install_isr_service(0);
    gpio_isr_handler_add((gpio_num_t) MCP23017_INTA_GPIO, paddle_intr_handler, (void *)(gpio_num_t) MCP23017_INTA_GPIO);
    
    uint16_t val;
    if (ESP_OK == mcp23x17_port_read(&MCP23017, &val)) {
      debug_serial_port->print("Completed MCP23017 Init for Paddle Lines val=");
    } else {
      debug_serial_port->print("Paddle Lines Monitoring Init on MCP23017 FAILED val=");
    }
    debug_serial_port->println(val, HEX);
    // Now any pin state change will call the handler.
  }
#endif
//---------------------------------------------------------------------

void initialize_pins() {
#if defined (ARDUINO_MAPLE_MINI) || defined(ARDUINO_GENERIC_STM32F103C) || defined(HARDWARE_ESP32_DEV) //sp5iou 20180329, sp5iou 20220129
  #ifdef FEATURE_MCP23017_EXPANDER
    init_MCP23017();
  #elif defined(HARDWARE_ESP32_DEV)
    init_ESP32_GPIO_key_pins();
  #else
    pinMode (paddle_left, INPUT_PULLUP);
    pinMode (paddle_right, INPUT_PULLUP);
  #endif
#else
  pinMode (paddle_left, INPUT);
  digitalWrite (paddle_left, HIGH);
  pinMode (paddle_right, INPUT);
  digitalWrite (paddle_right, HIGH);
#endif //defined (ARDUINO_MAPLE_MINI)||defined(ARDUINO_GENERIC_STM32F103C) sp5iou 20180329

  #if defined(FEATURE_CAPACITIVE_PADDLE_PINS)
    if (capactive_paddle_pin_inhibit_pin){
      pinMode (capactive_paddle_pin_inhibit_pin, INPUT);
      digitalWrite (capactive_paddle_pin_inhibit_pin, LOW);    
    }
  #endif //FEATURE_CAPACITIVE_PADDLE_PINS
  
  if (audio_enable){  // enable audio amp (LOW). DAC pin outputs to audio amp and then out to speaker
    pinMode (audio_enable, OUTPUT);
    digitalWrite (audio_enable, audio_enable_active_state);
  }

  if (tx_key_line_1) {
    pinMode (tx_key_line_1, OUTPUT);
    digitalWrite (tx_key_line_1, tx_key_line_inactive_state);
  }
  if (tx_key_line_2) {
    pinMode (tx_key_line_2, OUTPUT);
    digitalWrite (tx_key_line_2, tx_key_line_inactive_state);
  }
  if (tx_key_line_3) {
    pinMode (tx_key_line_3, OUTPUT);
    digitalWrite (tx_key_line_3, tx_key_line_inactive_state);
  }
  if (tx_key_line_4) {
    pinMode (tx_key_line_4, OUTPUT);
    digitalWrite (tx_key_line_4, tx_key_line_inactive_state);
  }
  if (tx_key_line_5) {
    pinMode (tx_key_line_5, OUTPUT);
    digitalWrite (tx_key_line_5, tx_key_line_inactive_state);
  }
  if (tx_key_line_6) {
    pinMode (tx_key_line_6, OUTPUT);
    digitalWrite (tx_key_line_6, tx_key_line_inactive_state);
  }
    

  if (ptt_tx_1) {
    pinMode (ptt_tx_1, OUTPUT);
    digitalWrite (ptt_tx_1, ptt_line_inactive_state);
  }
  if (ptt_tx_2) {
    pinMode (ptt_tx_2, OUTPUT);
    digitalWrite (ptt_tx_2, ptt_line_inactive_state);
  }
  if (ptt_tx_3) {
    pinMode (ptt_tx_3, OUTPUT);
    digitalWrite (ptt_tx_3, ptt_line_inactive_state);
  }
  if (ptt_tx_4) {
    pinMode (ptt_tx_4, OUTPUT);
    digitalWrite (ptt_tx_4, ptt_line_inactive_state);
  }
  if (ptt_tx_5) {
    pinMode (ptt_tx_5, OUTPUT);
    digitalWrite (ptt_tx_5, ptt_line_inactive_state);
  }
  if (ptt_tx_6) {
    pinMode (ptt_tx_6, OUTPUT);
    digitalWrite (ptt_tx_6, ptt_line_inactive_state);
  }
  if (sidetone_line) {
    pinMode (sidetone_line, OUTPUT);
    digitalWrite (sidetone_line, sidetone_line_inactive_state);
  }
  if (tx_key_dit) {
    pinMode (tx_key_dit, OUTPUT);
    digitalWrite (tx_key_dit, tx_key_dit_and_dah_pins_inactive_state);
  }
  if (tx_key_dah) {
    pinMode (tx_key_dah, OUTPUT);
    digitalWrite (tx_key_dah, tx_key_dit_and_dah_pins_inactive_state);
  }

  #ifdef FEATURE_CW_DECODER
    pinMode (cw_decoder_pin, INPUT_PULLUP);
    // pinMode (cw_decoder_pin, INPUT);
    // digitalWrite (cw_decoder_pin, HIGH);

    #if defined(OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR)
      digitalWrite (cw_decoder_audio_input_pin, LOW);
      cwtonedetector.init(cw_decoder_audio_input_pin);
    #endif //OPTION_CW_DECODER_GOERTZEL_AUDIO_DETECTOR

    if (cw_decoder_indicator){
      pinMode(cw_decoder_indicator,OUTPUT);
      digitalWrite(cw_decoder_indicator, LOW);
    }
  #endif //FEATURE_CW_DECODER
  
  #if defined(FEATURE_COMMAND_MODE) && defined(command_mode_active_led)
    if(command_mode_active_led) {
      pinMode (command_mode_active_led, OUTPUT);
      digitalWrite (command_mode_active_led,LOW);
    }
  #endif //FEATURE_COMMAND_MODE && command_mode_active_led
  
  
  #ifdef FEATURE_LED_RING
    pinMode(led_ring_sdi,OUTPUT);
    pinMode(led_ring_clk,OUTPUT);
    pinMode(led_ring_le,OUTPUT);
  #endif //FEATURE_LED_RING  

  #ifdef FEATURE_ALPHABET_SEND_PRACTICE
    if (correct_answer_led) {
      pinMode(correct_answer_led, OUTPUT);
      digitalWrite(correct_answer_led, LOW);
    }
    if (wrong_answer_led) {
      pinMode(wrong_answer_led, OUTPUT);
      digitalWrite(wrong_answer_led, LOW);
    }
  #endif //FEATURE_ALPHABET_SEND_PRACTICE

  #ifdef FEATURE_PTT_INTERLOCK
    pinMode(ptt_interlock,INPUT_PULLUP);
    // pinMode(ptt_interlock,INPUT);
    // if (ptt_interlock_active_state == HIGH){
    //   digitalWrite(ptt_interlock,LOW);
    // } else {
    //   digitalWrite(ptt_interlock,HIGH);
    // }
  #endif //FEATURE_PTT_INTERLOCK

  #if defined(FEATURE_STRAIGHT_KEY) && !defined(FEATURE_MCP23017_EXPANDER) && !defined(HARDWARE_ESP32_DEV)
    pinMode(pin_straight_key,INPUT);
    if (STRAIGHT_KEY_ACTIVE_STATE == HIGH){
      digitalWrite (pin_straight_key, LOW);
    } else {
      digitalWrite (pin_straight_key, HIGH);
    }
    #if defined(ARDUINO_MAPLE_MINI)|| defined(ARDUINO_GENERIC_STM32F103C) || defined(__STM32F1__)//SP5IOU 20210802
          pinMode(pin_straight_key,INPUT_PULLUP); //SP5IOU 20210802
    #endif //SP5IOU 20210802
  #endif //FEATURE_STRAIGHT_KEY

