K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
}

#endif //FEATURE_CW_DECODER

//--------------------------------------------------------------------- 

void initialize_keyer_state(){
  
  key_state = 0;
  key_tx = 1;

  configuration.wpm = initial_speed_wpm;
  pot_wpm_low_value = initial_pot_wpm_low_value;
  configuration.paddle_interruption_quiet_time_element_lengths = default_paddle_interruption_quiet_time_element_lengths;
  configuration.hz_sidetone = initial_sidetone_freq;
  configuration.memory_repeat_time = default_memory_repeat_time;
  configuration.cmos_super_keyer_iambic_b_timing_percent = default_cmos_super_keyer_iambic_b_timing_percent;
  configuration.dah_to_dit_ratio = initial_dah_to_dit_ratio;
  configuration.length_wordspace = default_length_wordspace;
  configuration.weighting = default_weighting;
  configuration.wordsworth_wordspace = default_wordsworth_wordspace;
  configuration.wordsworth_repetition = default_wordsworth_repetition;
  configuration.wpm_farnsworth = initial_speed_wpm;
  configuration.cli_mode = CLI_NORMAL_MODE;
  configuration.wpm_command_mode = initial_command_mode_speed_wpm;
  configuration.ptt_buffer_hold_active = 0;
  configuration.sidetone_volume = sidetone_volume_low_limit + ((sidetone_volume_high_limit - sidetone_volume_low_limit) / 2);
  configuration.ptt_disabled = 0;
  configuration.beacon_mode_on_boot_up = 0;
  configuration.cw_echo_timing_factor = 100 * default_cw_echo_timing_factor;
  configuration.autospace_timing_factor = 100 * default_autospace_timing_factor;
  configuration.keying_compensation = default_keying_compensation;

  configuration.ptt_lead_time[0] = initial_ptt_lead_time_tx1;
  configuration.ptt_tail_time[0] = initial_ptt_tail_time_tx1;
  configuration.ptt_lead_time[1] = initial_ptt_lead_time_tx2;
  configuration.ptt_tail_time[1] = initial_ptt_tail_time_tx2;
  #if !defined(OPTION_SAVE_MEMORY_NANOKEYER)
    configuration.ptt_lead_time[2] = initial_ptt_lead_time_tx3;
    configuration.ptt_tail_time[2] = initial_ptt_tail_time_tx3;
    configuration.ptt_lead_time[3] = initial_ptt_lead_time_tx4;
    configuration.ptt_tail_time[3] = initial_ptt_tail_time_tx4;
    configuration.ptt_lead_time[4] = initial_ptt_lead_time_tx5;
    configuration.ptt_tail_time[4] = initial_ptt_tail_time_tx5;
    configuration.ptt_lead_time[5] = initial_ptt_lead_time_tx6;
    configuration.ptt_tail_time[5] = initial_ptt_tail_time_tx6;  

    for (int x = 0; x < 5; x++){
      configuration.ptt_active_to_sequencer_active_time[x] = 0;
      configuration.ptt_inactive_to_sequencer_inactive_time[x] = 0;
    }
  #endif //OPTION_SAVE_MEMORY_NANOKEYER        

  #ifndef FEATURE_SO2R_BASE
    switch_to_tx_silent(1);
  #endif

  #if (!defined(ARDUINO_SAM_DUE) || (defined(ARDUINO_SAM_DUE) && defined(FEATURE_EEPROM_E24C1024))) && !defined(HARDWARE_GENERIC_STM32F103C) &&(HARDWARE_MAPPLE_MINI)&& !defined (HARDWARE_ESP32_DEV)
    memory_area_end = EEPROM.length() - 1;
  #else
    #if defined(HARDWARE_GENERIC_STM32F103C)
      memory_area_end = 253;
  #else
    #if (defined HARDWARE_ESP32_DEV)
      memory_area_end = 1023;//SP5IOU 20220129
  #else
      memory_area_end = 1023; // not sure if this is a valid assumption
  #endif
  #endif  
  #endif

}  

//--------------------------------------------------------------------- 
void initialize_potentiometer(){

  #ifdef FEATURE_POTENTIOMETER
    pinMode(potentiometer,INPUT);
    pot_wpm_high_value = initial_pot_wpm_high_value;
    last_pot_wpm_read = pot_value_wpm();
    configuration.pot_activated = 1;
//    Serial.print(pot_value_wpm());//SP5IOU 20220129
  #endif
  
}
  
//---------------------------------------------------------------------   
void initialize_rotary_encoder(){  
  
  #ifdef FEATURE_ROTARY_ENCODER
    #ifdef OPTION_ENCODER_ENABLE_PULLUPS
      #if defined (ARDUINO_MAPLE_MINI)||defined(ARDUINO_GENERIC_STM32F103C) ||defined(HARDWARE_ESP32_DEV)//sp5iou 20180329 //SP5IOU 20220129
        pinMode(rotary_pin1, INPUT_PULLUP);//sp5iou 20180329
        pinMode(rotary_pin2, INPUT_PULLUP);//sp5iou 20180329
      #else // (ARDUINO_MAPLE_MINI)||defined(ARDUINO_GENERIC_STM32F103C) //sp5iou 20180329
        pinMode(rotary_pin1, INPUT);
        pinMode(rotary_pin2, INPUT);
        digitalWrite(rotary_pin1, HIGH);
        digitalWrite(rotary_pin2, HIGH);
       #endif 
    #endif //OPTION_ENCODER_ENABLE_PULLUPS
  #endif //FEATURE_ROTARY_ENCODER
  
}

//---------------------------------------------------------------------   

void initialize_default_modes(){
  
  
  // setup default modes
  keyer_machine_mode = KEYER_NORMAL;
  configuration.paddle_mode = PADDLE_NORMAL;
  configuration.keyer_mode = IAMBIC_B;
  configuration.sidetone_mode = SIDETONE_ON;

  #ifdef initial_sidetone_mode
    configuration.sidetone_mode = initial_sidetone_mode;
  #endif
  #if defined DEBUG_SETUP
    Serial.println(F("Went here 2"));
  #endif
  char_send_mode = CW;
  
  #if defined(FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING) && defined(OPTION_CMOS_SUPER_KEYER_IAMBIC_B_TIMING_ON_BY_DEFAULT) // DL1HTB initialize CMOS Super Keyer if feature is enabled
    configuration.cmos_super_keyer_iambic_b_timing_on = 1;
  #endif //FEATURE_CMOS_SUPER_KEYER_IAMBIC_B_TIMING // #end DL1HTB initialize CMOS Super Keyer if feature is enabled
  #if defined DEBUG_SETUP
    Serial.println(F("Went here 3"));
  #endif

  mydelay(2500);  // wait a little bit for the caps to charge up on the paddle lines
  #if defined DEBUG_SETUP
    Serial.println(F("Went here 4"));
  #endif
}  

//--------------------------------------------------------------------- 

void initialize_watchdog(){
  
  #ifdef OPTION_WATCHDOG_TIMER
    wdt_enable(WDTO_4S);
  #endif //OPTION_WATCHDOG_TIMER

}  

//--------------------------------------------------------------------- 

void check_eeprom_for_initialization(){
    #if defined(HARDWARE_GENERIC_STM32F103C)
//      EEPROM.PageBase0 = 0x801F000; //SP5IOU 20210802
//      EEPROM.PageBase1 = 0x801F800; //SP5IOU 20210802
//      EEPROM.PageSize  = 0x800;     //SP5IOU 20210802 Increasinng size of eeprom emulation x2
//      EEPROM.init(); //sp5iou 20180328 to reinitialize / initialize EEPROM
    #endif
   #if defined(HARDWARE_ESP32_DEV) //SP5IOU 20220129
    EEPROM.begin(1024);
   #endif
  // do an eeprom reset to defaults if paddles are squeezed
  if (paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) {
    while (paddle_pin_read(paddle_left) == LOW && paddle_pin_read(paddle_right) == LOW) {mydelay(1);}
    initialize_eeprom();
  }
  
  // read settings from eeprom and initialize eeprom if it has never been written to
  if (read_settings_from_eeprom()) {
   initialize_eeprom();
  }
}

