K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  keyboard.begin(ps2_keyboard_data, ps2_keyboard_clock);
  #endif //FEATURE_PS2_KEYBOARD
  
}
//--------------------------------------------------------------------- 

#if defined(FEATURE_PS2_KEYBOARD) && defined(OPTION_PS2_KEYBOARD_RESET)
void ps2int_write() {

  // code contributed by Bill, W9BEL
  //----- Called from initialize_ps2_keyboard to reset Mini KBD ---------
  // The ISR for the external interrupt in read mode


  uint8_t buffer[45];
  uint8_t head, tail, writeByte = 255;
  uint8_t curbit = 0, parity = 0, ack =0;
 
  if(curbit < 8) {
    if(writeByte & 1) {
      parity ^= 1;
      digitalWrite(ps2_keyboard_data, HIGH);
    } else
      digitalWrite(ps2_keyboard_data, LOW);
    writeByte >>= 1;
  } else if(curbit == 8) { // parity
    if(parity)
      digitalWrite(ps2_keyboard_data, LOW);
    else
      digitalWrite(ps2_keyboard_data, HIGH);
  } else if(curbit == 9) { // time to let go
    pinMode(ps2_keyboard_data, INPUT); // release line
    digitalWrite(ps2_keyboard_data, HIGH); // pullup on
  } else { // time to check device ACK and hold clock again
    //holdClock();
    digitalWrite(ps2_keyboard_clock, LOW); // pullup off
    pinMode(ps2_keyboard_clock, OUTPUT); // pull clock low
    ack = !digitalRead(ps2_keyboard_data);
  }
  curbit++;
}
#endif 

//--------------------------------------------------------------------- 
#ifdef FEATURE_BT_KEYBOARD

void pairing_handler(uint32_t pid) {
    debug_serial_port->print(F("Please enter the following pairing code followed with ENTER on your keyboard: "));
    debug_serial_port->println(pid);    
    mydelay(5);
    char pass[28];
    clear_display_row(1);
    sprintf(pass, "Pairing Code %lu", pid);
    lcd_center_print_timed(pass, 2, 15000);
}

void keyboard_lost_connection_handler() {
    debug_serial_port->println(F("====> Lost connection with keyboard <===="));
    BT_Keyboard_Lost = true;
    if (bt_keyboard_LED) digitalWrite(bt_keyboard_LED, bt_keyboard_LED_pin_inactive_state);
    Keyboard_Disconnected_signal = true;
}

void keyboard_connected_handler() {
    debug_serial_port->println(F("----> Connected to keyboard <----"));
    BT_Keyboard_Lost = false;
    if (bt_keyboard_LED) digitalWrite(bt_keyboard_LED, bt_keyboard_LED_pin_active_state);   
    Keyboard_Connected_signal = true;
}
#endif

void initialize_bt_keyboard(){  // iint the BT 4.2 stack for ESP32-WROOM-32 for BLE and BT Classic
  esp_err_t ret;
  
  #if !defined(FEATURE_BT_KEYBOARD)
    return;
  #endif

    //esp_log_level_set(TAG, ESP_LOG_ERROR);
    pinMode(bt_keyboard_LED, OUTPUT);
    digitalWrite(bt_keyboard_LED, bt_keyboard_LED_pin_inactive_state);
    // To test the Pairing code entry, uncomment the following line as pairing info is
          // kept in the nvs. Pairing will then be required on every boot.
    //ESP_ERROR_CHECK(nvs_flash_erase());
    
    ret = nvs_flash_init();
    if ((ret == ESP_ERR_NVS_NO_FREE_PAGES) || (ret == ESP_ERR_NVS_NEW_VERSION_FOUND)) {
      ESP_ERROR_CHECK(nvs_flash_erase());
      ret = nvs_flash_init();
    }
    ESP_ERROR_CHECK(ret);

    debug_serial_port->println(F("BT and BLE device Scan Setup"));

    btStarted();  // workarond to avoid bt_controller init failure #259

    //btStart();
    //btStartMode(BT_MODE_CLASSIC_BT);

    if (bt_keyboard.setup(pairing_handler, keyboard_connected_handler,
                          keyboard_lost_connection_handler)) { // Must be called once
        bt_keyboard.devices_scan(); // Required to discover new keyboards and for pairing
                                  // Default duration is 5 seconds
    }

    if (!bt_keyboard.is_connected()) {
        debug_serial_port->println("No BT keyboards found");
        lcd_center_print_timed("No BT Keyboards", 2, 3000);
    }

    queueflush();
}

#if defined(FEATURE_BT_KEYBOARD) || defined(FEATURE_TOUCH_DISPLAY)
////////////////////////////////////////////////////////////////////////
//
// Here is a queue to store the characters that I've typed.
// To simplify the code, it can store a maximum of QUEUESIZE-1 characters
// before it fills up.  What is a byte wasted between friends?
//
//  This queue is shared between the BT keyboard and seelct Touch buttons
//
////////////////////////////////////////////////////////////////////////

void queueadd(const char ch)
{
    queue[qtail++] = ch ;
    qtail &= QUEUEMASK ;
}
 
void queueadd(const char *s)
{
  while (*s) {
      mydelay(1);
      queueadd(*s++);
  }
}
 
char queuepop()
{
    char ch ;
    ch = queue[qhead++];
    qhead &= QUEUEMASK;
    return ch;
}
 
int queuefull()
{
    return (((qtail+1)%QUEUEMASK) == qhead);
}
 
int queueempty()
{
    return (qhead == qtail);
}
 
int queue_available()
{
    return (qhead - qtail);
}

void queueflush()
{
    qhead = qtail;
}

void mydelay(unsigned long ms)
{
    //unsigned long t = millis() ;

    vTaskDelay(portTICK_PERIOD_MS * ms);

    //while (millis()-t < ms)
    //#ifdef PS2
    //    ps2poll() ;
    //#else
    //  ;
    //#endif
}
#endif // BT_KEYBOARD

//--------------------------------------------------------------------- 

#ifdef FEATURE_TOUCH_DISPLAY
  #ifdef FEATURE_TFT7789_3_2inch_240x320_LCD
    #include "TAMC_GT911.h"
    #define TOUCH_SDA  33
    #define TOUCH_SCL  32
    #define TOUCH_INT  21  // not used because R25 is not installed on DIYMalls 3.2" display
    #define TOUCH_RST  25
    #define TOUCH_WIDTH  320
    #define TOUCH_HEIGHT 240
    TAMC_GT911 tp = TAMC_GT911(TOUCH_SDA, TOUCH_SCL, TOUCH_INT, TOUCH_RST, TOUCH_WIDTH, TOUCH_HEIGHT);
  #endif
#endif

// Text associated with touch buttons
// Text content sized to fit in teh window.  Later desire to make scrllable with button and/or touch gesture
const char btn6_text[] = {"This is even longer test text for Button #6"};
const char btn7_text[] = {"This is for Button #7"};
const char btn8_text[] = {"This is test text for Button #8"};

void initialize_display() {

  #ifdef FEATURE_DISPLAY    
    #if defined(HARDWARE_ESP32_DEV) //SP5IOU fix for nothing on serial port for ESP32_dev
      #ifdef FEATURE_LCD_LIQUIDCRYSTAL_I2C
        Wire.begin(21, 22, 100000); // SDA = GPIO 25, SCL = GPIO 26 for ESp32-WROOM32 Dev Module
      #endif
      #ifdef FEATURE_TFT_DISPLAY
        initialize_TFT_LCD_display();
      #endif

      #ifdef FEATURE_TOUCH_DISPLAY
        #ifdef FEATURE_TFT7789_3_2inch_240x320_LCD
          tp.begin();  // does a Wire.begin() on 1st I2C bus 0
          tp.setRotation(ROTATION_LEFT);
          debug_serial_port->println("Completed setup on 2nd i2c bus for GT911 Touch Sensor");
        #endif
      #endif
    #endif

    #if defined (FEATURE_LCD_SAINSMART_I2C) || defined(FEATURE_LCD_I2C_FDEBRABANDER)
      lcd.begin();
      lcd.home();
    #elif !defined (FEATURE_TFT_DISPLAY)
      lcd.begin(LCD_COLUMNS, LCD_ROWS);
      lcd.clear();
    #endif

    #ifdef FEATURE_LCD_ADAFRUIT_I2C
      lcd.setBacklight(lcdcolor);
    #endif //FEATURE_LCD_ADAFRUIT_I2C

    #ifdef FEATURE_LCD_ADAFRUIT_BACKPACK 
      lcd.setBacklight(HIGH);
    #endif

    #ifdef FEATURE_LCD_MATHERTEL_PCF8574 
      lcd.setBacklight(HIGH);
    #endif

    #ifdef OPTION_DISPLAY_NON_ENGLISH_EXTENSIONS  // OZ1JHM provided code, cleaned up by LA3ZA
      // Store bit maps, designed using editor at http://omerk.github.io/lcdchargen/
      byte U_umlaut[8] =   {B01010,B00000,B10001,B10001,B10001,B10001,B01110,B00000}; // 'Ü'  
      byte O_umlaut[8] =   {B01010,B00000,B01110,B10001,B10001,B10001,B01110,B00000}; // 'Ö'  
      byte A_umlaut[8] =   {B01010,B00000,B01110,B10001,B11111,B10001,B10001,B00000}; // 'Ä'    
      byte AE_capital[8] = {B01111,B10100,B10100,B11110,B10100,B10100,B10111,B00000}; // 'Æ' 
      byte OE_capital[8] = {B00001,B01110,B10011,B10101,B11001,B01110,B10000,B00000}; // 'Ø' 
      byte empty[8] =      {B00000,B00000,B00000,B00000,B00000,B00000,B00000,B00000}; // empty 
      byte AA_capital[8] = {B00100,B00000,B01110,B10001,B11111,B10001,B10001,B00000}; // 'Å'   
      byte Ntilde[8] =     {B01101,B10010,B00000,B11001,B10101,B10011,B10001,B00000}; // 'Ñ' 
      
