K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    for (int t = 0; t < buttonCount; t++) {
      if (btn[t].p_btn.isPressed())  {  
        button_ID = t; 
        debug_serial_port->print("Button #"); debug_serial_port->print(t);          
        debug_serial_port->print("  Pressed?="); debug_serial_port->print(btn[t].p_btn.isPressed());
        debug_serial_port->print("  Type(S=1,L-2,V=3=)"); debug_serial_port->print(btn[t].len); 
        debug_serial_port->print("  Press Duration="); debug_serial_port->println(btn[t].duration);  
        break;        
      }
    }
    
    if (button_ID >= buttonCount || btn[button_ID].len == 0 || btn[button_ID].len == 2) {
      debug_serial_port->print("Button ID="); debug_serial_port->print(button_ID);
      debug_serial_port->print("   Invalid Duration, Bailing.  Time="); debug_serial_port->println(btn[button_ID].duration);
      return;
    }
    
    // set to true if only want to process this button (along with CW_BOX to reset this)  
    static bool repeat_key = false;  // also set the repeat_key_ID to specify which key is repeating

    mydelay(1);
    // F-Key (always button_ID == 0) cycles through rows of action buttons
    if (button_ID == BUTTON_F1) {
      if (button_row == 0) {
        button_row = 1; // switch to row 2 if button_row = 0
        draw_buttons_row_2();
        debug_serial_port->println("Switch to Row 2");
      } else {
        button_row = 0;
        draw_buttons_row_1();
        debug_serial_port->println("Switch to Row 1");
      }
      btn[0].p_btn.press(false);
      button_active = false;
      return;
    }

    // process the action buttons in each row
    button = button_ID + (button_row * 10);
    
    if ((repeat_key && button == repeat_key_ID)|| !repeat_key || button == CW_BOX1 || button == CW_BOX2) {  // filter keys if repeat on
    //if (button != last_button || button == CW_BOX1 || button == CW_BOX2) {      
      switch (button) {
        case BUTTON_1:           
          button_active = false;    // re-enable buttons 
          btn[1].p_btn.drawButton(true, "M1-R");  // set background color to show it is active
          BtnX_active = button;          
          queueadd(PS2_F1_ALT);   // add char to the queue  
          break;

        case BUTTON_2: // This will cycle the memory # each time it is pressed.           
          if (BtnX_active != 0)  // another keyboard queue key is active until canceled
            break;
            
          btn[2].p_btn.drawButton(true, "MEM");  // set background color to show it is active
          if (mem_number < 10) {// cycle through the 10 memories
            length = print_memory(mem_number, mem_string);  // Get memory string
            sprintf(popup_text, "Memory %d:%s", (int)mem_number+1, mem_string);           
            popup(true);            // post up the popup_text string in window
            mem_number++;           // next memory if buton pressed again  
            button_active = false;  // re-enable buttons
            repeat_key_ID = button;  
            repeat_key = true;
          }
          else {  // stop repeat.  Use CW_BOX to remove window like all other keys.     
            button_active = true;   // block buttons, use CW_BOX touch to cancel             
            repeat_key_ID = 255;
            repeat_key = false;
          }          
          break;

        case BUTTON_3:
          button_active = false; // re-enable buttons
          queueadd(PS2_UPARROW);   // add char to the queue                    
          break;

        case BUTTON_4:
          button_active = false; // re-enable buttons
          queueadd(PS2_DOWNARROW);   // add char to the queue                   
          break;

        /// Row 2 buttons ///
        case BUTTON_5: // btn1 with button == 1
          // add some delay to prevent fast repeat
          button_active = false;    // re-enable buttons    
          queueadd(PS2_TAB);
          if (BtnX_active == 0) {          
            debug_serial_port->println("PAUSE");
            repeat_key_ID = button;  
            repeat_key = true; 
            BtnX_active = button;
            btn[1].p_btn.drawButton(true, "RES");  // set background color to show it is active                         
          } else {
            debug_serial_port->println("RESUME");            
            repeat_key_ID = 255;  
            repeat_key = false; 
            BtnX_active = 0;
            btn[1].p_btn.drawButton(false, "WAIT");  // set background color to show it is active
          }                                  
          break;

        case BUTTON_6:
          button_active = false;    // re-enable buttons 
          strcpy(popup_text, btn6_text);
          popup_toggle();
          break;

        case BUTTON_7:
          button_active = false;    // re-enable buttons 
          strcpy(popup_text, btn7_text);
          popup_toggle();
          break;

        case BUTTON_8:
          button_active = false;    // re-enable buttons 
          strcpy(popup_text, btn8_text);
          popup_toggle();
          break;

        case CW_BOX1:
        case CW_BOX2:
        default: 
          debug_serial_port->println(F("Button: CW Box or Default"));
          if (popup_active)
            popup(false);
          button_active = false; // re-enable buttons
          repeat_key_ID = 255;
          repeat_key = false;
          keyboard_button = 0;
          mem_number = 0;

          if (button_row == 0) draw_buttons_row_1();
          if (button_row == 1) draw_buttons_row_2();
          
          debug_serial_port->print(F("BtnX Active="));debug_serial_port->print(BtnX_active);
          debug_serial_port->print(F("  PTT="));debug_serial_port->println(ptt_line_activated);
          //if (BtnX_active || ptt_line_activated) {    
            debug_serial_port->println(F("Sending Keyboard ESC key"));       
            BtnX_active = 0;        
            queueflush(); 
            queueadd(PS2_ESC);  //  Stop any send in progress, clear buffer                  
          //}
          break;
      }      
      last_button = button;  // update last button ID      
    }
  #endif
}

// Detects if a button is pressed and assign a button ID to it.
#if defined(FEATURE_TOUCH_DISPLAY)

