K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
  #ifndef USE_TOUCH_TASK
    void check_touch_buttons(void) {
     #else
     void check_touch_buttons(void * pvParameters) {

      /* The parameter value is expected to be 1 as 1 is passed in the
      pvParameters value in the call to xTaskCreate() below. */

      configASSERT( ( ( uint32_t ) pvParameters ) == 1 );

      while (1)
      {
        mydelay(10);
       #endif
        // Check for touch action, determine if they are for a configured button, or something else      
        uint8_t button_ID = 255;  // default to no button pressed
        static uint32_t scanTime = millis();
        static uint32_t tpTime = millis();
        uint32_t duration = 0;

        // Scan buttons every 50ms at most
        if (millis() - scanTime >= 50) {  // check every 50ms for any activity
          scanTime = millis();

          #ifdef FEATURE_TFT7789_3_2inch_240x320_LCD          
            tp.read();
            if (tp.isTouched) {           
              t_x = tp.points[0].x;
              t_y = tp.points[0].y;  
          #endif
          
          #ifdef FEATURE_TFT_HOSYOND_320x480_LCD
            uint16_t threshold = 7;  // 1-20 pressure level for resistedive screen.  TFT_eSPI has a Z param also
            if (lcd.getTouch(&t_x, &t_y, threshold)) {
          #endif
          
            bool pressed = true;                               
            button_ID = 255;
            button_active = false;     // set active flag if any valid button triggered on       

            for (uint8_t b = 0; b < buttonCount; b++) {
              btn[b].p_btn.press(false);       
              duration = 0;
              btn[b].len = 0;  // 0, 1=short, 2=long, 3=very_long press time duration
              btn[b].duration = 0;    

              if (btn[b].p_btn.contains(t_x, t_y)) {
                // look for just pressed           
                //if (!button_active || b == CW_BOX1) {   // skip if button still active.  CW_BOX touch clears the popup.                                   

                tpTime = millis();
                pressed = true;
                while (pressed) {  // measure duration of button press
                  mydelay(30);
                  
                  #ifdef FEATURE_TFT7789_3_2inch_240x320_LCD  
                    tp.read();
                    pressed = tp.isTouched;
                  #endif

                  #ifdef FEATURE_TFT_HOSYOND_320x480_LCD
                    pressed = lcd.getTouch(&t_x, &t_y, threshold);
                  #endif

                  duration += (millis() - tpTime);                  

                  if (duration >= 120 && duration < 700) {               
                    //debug_serial_port->print("*Short duration = "); debug_serial_port->println(duration);
                    btn[b].len = 1;
                    btn[b].duration = duration;
                  }

                  if (duration >= 700 && duration < 1800) {  // using medium length zone as a buffer band, not used for keys
                    //debug_serial_port->print("**Long duration = "); debug_serial_port->println(duration);      
                    btn[b].len = 2; 
                    btn[b].duration = duration;                   
                  } 

                  if (duration >= 1800) {
                    //debug_serial_port->print("***Very Long duration = "); debug_serial_port->println(duration);      
                    btn[b].len = 3;
                    btn[b].duration = duration;
                  }

                  if (btn[b].len == 0) 
                    btn[b].duration = duration;
                }

                if (btn[b].len != 1 && btn[b].len != 3) {  // skip press duraion too short or in middle guard band                        
                  btn[b].p_btn.press(false); 
                  break;
                }
                btn[b].p_btn.press(true); // record state info for valid button. - process_buttons() will pick up event and add it to the ch queue)
                button_ID = b;
                button_active = true;     // set active flag if any valid button triggered on                                 
              } else {
                btn[b].p_btn.press(false); // touch landed outside current button hot spot, set to false
              }                   
            }   // loop through button list and update state for each 
          }   // touched
        }   // end of scan period
      #ifdef USE_TOUCH_TASK
      } // end of while loop for task mode 
      debug_serial_port->println("Error: Exited Check Buttons Task Loop");
      #endif   
    }
#endif

//-------------------------------------------------------------------------------------------------------
#if defined(OPTION_BLINK_HI_ON_PTT) || (defined(OPTION_WINKEY_BLINK_PTT_ON_HOST_OPEN) && defined(FEATURE_WINKEY_EMULATION))
void blink_ptt_dits_and_dahs(char const * cw_to_send){

  sending_mode = AUTOMATIC_SENDING;

  for (int x = 0;x < strlen(cw_to_send);x++){
    switch(cw_to_send[x]){
      case '.':
        ptt_key();
        mydelay(100);
        ptt_unkey();
        mydelay(100);
        break;
      case '-':
        ptt_key();
        mydelay(300);
        ptt_unkey();
        mydelay(100);
        break;
      case ' ':
        mydelay(400);
        break;        
    }

    #ifdef OPTION_WATCHDOG_TIMER
      wdt_reset();
    #endif  //OPTION_WATCHDOG_TIMER
  }
}
#endif //defined(OPTION_BLINK_HI_ON_PTT) || (defined(OPTION_WINKEY_BLINK_PTT_ON_HOST_OPEN) && defined(FEATURE_WINKEY_EMULATION))

//--------------------------------------------------------------------- 
#ifdef FEATURE_USB_KEYBOARD
void KbdRptParser::OnKeyDown(uint8_t mod, uint8_t key)	
{
  
  #ifdef FEATURE_MEMORIES  
    enum usb_kbd_states {USB_KEYBOARD_NORMAL, USB_KEYBOARD_WPM_ADJUST, USB_KEYBOARD_FARNS_WPM_ADJUST, USB_KEYBOARD_SN_ENTRY, USB_KEYBOARD_PROGRAM_MEM};
  #else
    enum usb_kbd_states {USB_KEYBOARD_NORMAL, USB_KEYBOARD_WPM_ADJUST, USB_KEYBOARD_FARNS_WPM_ADJUST, USB_KEYBOARD_SN_ENTRY};
  #endif
  
