K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      if (so2r_rx_2) {
        digitalWrite(so2r_rx_2, HIGH);
      }

      if (so2r_rx_2s) {
        digitalWrite(so2r_rx_2s, HIGH);
      }

      if (so2r_rx_s) {
        digitalWrite(so2r_rx_s, LOW);
      }
      break;

    case SO2R_RX_S:
    case SO2R_RX_R:
    // Receive on radio 1 and 2 (stereo)
      if (so2r_rx_1) {
        digitalWrite(so2r_rx_1, LOW);
      }

      if (so2r_rx_1s) {
        digitalWrite(so2r_rx_1s, HIGH);
      }

      if (so2r_rx_2) {
        digitalWrite(so2r_rx_2, LOW);
      }

      if (so2r_rx_2s) {
        digitalWrite(so2r_rx_2s, HIGH);
      }

      if (so2r_rx_s) {
        digitalWrite(so2r_rx_s, HIGH);
      }
      break;
  }
}

//-------------------------------------------------------------------------------------------------------

void so2r_command() {
  if ((incoming_serial_byte & 0xf0) == 0x90)
  {
    // 0 is RX 1
    // 1 is RX 2
    // 2 is RX 1 and RX2 stereo
    // 3 is RX 1 and RX2 stereo (reverse if possible but this box doesn't have that capability) 
    so2r_rx = (incoming_serial_byte & 3) + 1;
    so2r_set_rx();
  
    byte tx = SO2R_TX_1;
    if (incoming_serial_byte & 4) {
      tx = SO2R_TX_2;
    }

    // Don't switch transmitter while transmitting.
    if (tx == so2r_tx) {
      so2r_pending_tx = 0;
    }
    else {
      if (ptt_line_activated) {
        so2r_pending_tx = tx;
        #ifdef FEATURE_WINKEY_EMULATION
          if (winkey_sending && winkey_host_open) {
            // Fake a paddle interrupt to stop computer sending
            winkey_port_write(0xc2|winkey_sending|winkey_xoff,0); // 0xc2 - BREAKIN bit set high
            winkey_interrupted = 1;
          }
        #endif

      } else {
        so2r_tx = tx;
        so2r_set_tx();
      }
    }
    return;
  }

  #ifdef FEATURE_SO2R_ANTENNA
    if ((incoming_serial_byte & 0xf0) == 0xa0)
    {
      so2r_antenna_1 = incoming_serial_byte & 0x0f;
      // TBD:  Provide antenna information outputs
      return;
    }

    if ((incoming_serial_byte & 0xf0) == 0xb0)
    {
      so2r_antenna_2 = incoming_serial_byte & 0x0f;
      // TBD:  Provide antenna information outputs
      return;
    }
  #endif //FEATURE_SO2R_ANTENNA

  switch (incoming_serial_byte) {
      case 0x80:  // SO2R Close
        #ifdef FEATURE_SO2R_SWITCHES
          so2r_open = 0;
          so2r_debounce = 0;
          so2r_latch = 0;
        #endif
        break;

      case 0x81:  // SO2R Open
        #ifdef FEATURE_SO2R_SWITCHES
          so2r_open = 1;
        #endif
        break;

      case 0x82:  // PTT Off
        so2r_ptt = 0;
        break;

      case 0x83:  // PTT On
        so2r_ptt = 1;
        ptt_key();
        break;

      case 0x84:  // Latch Off
        so2r_latch = 0;
        so2r_set_rx();
        break;

      case 0x85:  // Latch On
        so2r_latch = 1;
        so2r_set_rx();
        break;
  }
}

//-------------------------------------------------------------------------------------------------------

#ifdef FEATURE_SO2R_SWITCHES
  void so2r_switches()
    {
      if (so2r_open) {
      return;
    }

    if (so2r_debounce) {
      if ((so2r_debounce_time - millis()) < 20) {
        return;
      }
      so2r_debounce = 0;
    }

    if (so2r_tx_switch) {
      uint8_t tx = 1;
      if (digitalRead(so2r_tx_switch) != LOW) {
        tx = 2;
      }
      if (tx != so2r_tx)
      {
        if (ptt_line_activated) {
          #ifdef FEATURE_WINKEY_EMULATION
            if (winkey_sending && winkey_host_open) {
              // Fake a paddle interrupt to stop computer sending
              winkey_port_write(0xc2|winkey_sending|winkey_xoff,0); // 0xc2 - BREAKIN bit set high
              winkey_interrupted = 1;
            }
          #endif
        }
        else {
          so2r_tx = tx;
          so2r_set_tx();
          so2r_debounce_time = millis();
          so2r_debounce = 1;
        }
      }

      if (so2r_rx1_switch) {
        uint8_t rx = 1; // RX 1
        if (digitalRead(so2r_rx1_switch) != LOW) {
          if (so2r_rx2_switch && (digitalRead(so2r_rx2_switch) != LOW)) {
            rx = 3; // Stereo
          }
          else {
            rx = 2; // RX 2
          }
        }

        if (rx != so2r_rx) {
          so2r_rx = rx;
          so2r_set_rx();
          so2r_debounce_time = millis();
          so2r_debounce = 1;
        }
      }
    }
  }
#endif // FEATURE_SO2R_SWITCHES
#endif //FEATURE_SO2R_BASE

//-------------------------------------------------------------------------------------------------------


// DL2DBG contributed code (adapted into code by Goody K3NG)
// Based on https://forum.arduino.cc/index.php?topic=446209.15


#if defined(FEATURE_SINEWAVE_SIDETONE)
#include <driver/dac_oneshot.h>
#include <driver/dac_cosine.h>
#include <driver/dac_continuous.h>

const float pi = 3.14159265359;  // Define Pi as a constant
const float T = 100;  // sample time in microseconds
float freq = 600;  // frquency of tone in Hz
float omega = 2*pi*1;  // part of sine wave conversion factor
const float A = 490;  // amplitude
// next line initializes oscillation with amplitude A
float a[]={(float) 0.0, ((float) A) * (float) (sin(omega*T/1000000.0)), (float) 0.0}; 
// c1 is the difference equation coefficient
const float c1 = (8.0 - 2.0*pow(omega*T/1000000.0,2))/(4.0+pow(omega*T/1000000.0,2));
const int resolution = 8;

//#define FEATURE_SINEWAVE_SIDETONE_USING_TIMER_1

void compute_sinetone(int hz, int volume){ //dl2dbg 
  omega = omega*hz;

  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_1)
    Timer1.detachInterrupt();
  #endif  
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_3)
    Timer3.detachInterrupt();
  #endif
  a[0]= 0.0;
  a[1]= volume*sin(omega*T/1000000.0);
  a[2]= 0.0;
  sinewave_interrupt_compute();
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_1)
    Timer1.attachInterrupt(sinewave_interrupt_compute);
  #endif  
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_3)
    Timer3.attachInterrupt(sinewave_interrupt_compute);
  #endif
}
#endif //FEATURE_SINEWAVE_SIDETONE

//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_SINEWAVE_SIDETONE)

