K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
void sinewave_interrupt_compute(){ //dl2dbg
  a[2] = c1 * a[1] - a[0];
  a[0] = a[1] ;
  a[1] = a[2] ;  
  dacWrite(sidetone_line, map( a[2],-512, 512, 0, 1000));
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_1)
    Timer1.setPwmDuty(sidetone_line, map( a[2],-512, 512, 0, 1000));
  #endif  
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_3)
    Timer3.setPwmDuty(sidetone_line, map( a[2],-512, 512, 0, 1000));
  #endif
}
#endif //FEATURE_SINEWAVE_SIDETONE

//-------------------------------------------------------------------------------------------------------
#if defined(FEATURE_SINEWAVE_SIDETONE)

void initialize_tonsin(){ //dl2dbg

  configuration.sidetone_volume = sidetone_volume_low_limit + ((sidetone_volume_high_limit - sidetone_volume_low_limit) / 2);
  compute_sinetone(configuration.hz_sidetone,configuration.sidetone_volume);
  ledcAttach(sidetone_line, configuration.hz_sidetone, 255);
 
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_1)
    Timer1.initialize(T);  // set sample time for discrete tone signal
    Timer1.pwm(sidetone_line, 0, T);
    Timer1.attachInterrupt(sinewave_interrupt_compute);
    Timer1.stop();
  #endif  
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_3)
    Timer3.initialize(T);  // set sample time for discrete tone signal
    Timer3.pwm(sidetone_line, 0, T);
    Timer3.attachInterrupt(sinewave_interrupt_compute);
    Timer3.stop();
  #endif
}
#endif //FEATURE_SINEWAVE_SIDETONE
//-------------------------------------------------------------------------------------------------------

#if defined(FEATURE_SINEWAVE_SIDETONE)
void sinetone(uint8_t pin_dummy_variable, unsigned short freq){  //dl2dbg
  static int last_freq;
  static int last_volume;

  if ((freq != last_freq) || (configuration.sidetone_volume != last_volume)){ 
    compute_sinetone(freq,configuration.sidetone_volume);
    last_freq = freq;
    last_volume = configuration.sidetone_volume;
  }

  //delay (2); compute_sinetone(freq,sidetone_volume/4);
  //delay (2); compute_sinetone(freq,sidetone_volume/2);
  //compute_sinetone(freq,configuration.sidetone_volume); 

  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_1)
    Timer1.restart();
  #endif  
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_3)
    Timer3.restart();
  #endif
}
#endif //FEATURE_SINEWAVE_SIDETONE

//------------------------------------------------------------------------------------------------------- 

#if defined(FEATURE_SINEWAVE_SIDETONE)
void nosineTone(uint8_t pin_dummy_variable) {    // disable tone on specified pin, if any    dl2dbg
  //delay (2); compute_sinetone(freq,sidetone_volume/2);
  //delay (2); compute_sinetone(freq,sidetone_volume/4);
  compute_sinetone(configuration.hz_sidetone,0);
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_1)
    Timer1.stop();
  #endif  
  #if defined(FEATURE_SINEWAVE_SIDETONE_USING_TIMER_3)
    Timer3.stop();
  #endif
  //digitalWrite(sidetone_line,LOW);
}

#endif //FEATURE_SINEWAVE_SIDETONE

//-------------------------------------------------------------------------------------------------------

void debug_blink(){
  #if defined(DEBUG_STARTUP_BLINKS)
    digitalWrite(13,HIGH);
    mydelay(250);
    digitalWrite(13,LOW);
    mydelay(1000);
  #endif //DEBUG_STARTUP
}    

//-------------------------------------------------------------------------------------------------------

//
//
// Congratulations.  You've gotten to the end.  But this is just the beginning.
//
//

/*



  #ifdef FEATURE_CLOCK
    int temp_year = 0;
    byte temp_month = 0;
    byte temp_day = 0;
    byte temp_minute = 0;
    byte temp_hour = 0;
    byte negative_flag = 0;
  #endif // FEATURE_CLOCK



    #ifdef FEATURE_CLOCK
    case 'C':         // show clock
      update_time();
      sprintf(return_string, "%s", timezone_modified_clock_string());


      break;
    case 'O':         // set clock UTC time
      temp_year = ((input_buffer[2] - 48) * 1000) + ((input_buffer[3] - 48) * 100) + ((input_buffer[4] - 48) * 10) + (input_buffer[5] - 48);
      temp_month = ((input_buffer[6] - 48) * 10) + (input_buffer[7] - 48);
      temp_day = ((input_buffer[8] - 48) * 10) + (input_buffer[9] - 48);
      temp_hour = ((input_buffer[10] - 48) * 10) + (input_buffer[11] - 48);
      temp_minute = ((input_buffer[12] - 48) * 10) + (input_buffer[13] - 48);
      if ((temp_year > 2013) && (temp_year < 2070) &&
          (temp_month > 0) && (temp_month < 13) &&
          (temp_day > 0) && (temp_day < 32) &&
          (temp_hour >= 0) && (temp_hour < 24) &&
          (temp_minute >= 0) && (temp_minute < 60) &&
          (input_buffer_index == 14)) {

        clock_year_set = temp_year;
        clock_month_set = temp_month;
        clock_day_set = temp_day;
        clock_hour_set = temp_hour;
        clock_min_set = temp_minute;
        clock_sec_set = 0;
        millis_at_last_calibration = millis();

        #if defined(FEATURE_RTC_DS1307)
        rtc.adjust(DateTime(temp_year, temp_month, temp_day, temp_hour, temp_minute, 0));
        #endif // defined(FEATURE_RTC_DS1307)
        #if defined(FEATURE_RTC_PCF8583)
        rtc.year = temp_year;
        rtc.month = temp_month;
        rtc.day = temp_day;
        rtc.hour  = temp_hour;
        rtc.minute = temp_minute;
        rtc.second = 0;
        rtc.set_time();
        #endif // defined(FEATURE_RTC_PCF8583)

        #if (!defined(FEATURE_RTC_DS1307) && !defined(FEATURE_RTC_PCF8583))
        strcpy(return_string, "Clock set to ");
        update_time();
        strcat(return_string, timezone_modified_clock_string());
        #else
        strcpy(return_string, "Internal clock and RTC set to ");
        update_time();
        strcat(return_string, timezone_modified_clock_string());
        #endif
      } else {
        strcpy(return_string, "Error. Usage: \\OYYYYMMDDHHmm");
      }
      break;

    case 'V': //  \Vx[xxx][.][xxxx]   Set time zone offset
      negative_flag = 0;
      place_multiplier = 1;
      for (int x = input_buffer_index - 1; x > 1; x--) {
        if (char(input_buffer[x]) == '-') {
          negative_flag = 1;
        } else {
          if (char(input_buffer[x]) != '.') {
            tempfloat += (input_buffer[x] - 48) * place_multiplier;
            place_multiplier = place_multiplier * 10;
          } else {
            decimalplace = x;
          }
        }
      }
      if (decimalplace) {
        tempfloat = tempfloat / pow(10, (input_buffer_index - decimalplace - 1));
      }
      if (negative_flag){tempfloat = tempfloat * -1.0;}
      if ((tempfloat >= -24.0) && (tempfloat <= 24.0)) {
        configuration.clock_timezone_offset = tempfloat;
        configuration_dirty = 1;
        strcpy(return_string, "Timezone offset set to ");
        dtostrf(tempfloat, 0, 2, temp_string);
        strcat(return_string, temp_string);
      } else {
        strcpy(return_string, "Error.");
      }
      break;
    #endif // FEATURE_CLOCK

// --------------------------------------------------------------

#ifdef FEATURE_CLOCK
char * timezone_modified_clock_string(){

  static char return_string[32] = "";
  char temp_string[16] = "";


  dtostrf(local_clock_years, 0, 0, temp_string);
  strcpy(return_string, temp_string);
  strcat(return_string, "-");
  if (local_clock_months < 10) {
    strcat(return_string, "0");
  }
  dtostrf(local_clock_months, 0, 0, temp_string);
  strcat(return_string, temp_string);
  strcat(return_string, "-");
  if (local_clock_days < 10) {
    strcat(return_string, "0");
  }
  dtostrf(local_clock_days, 0, 0, temp_string);
  strcat(return_string, temp_string);
  strcat(return_string, " ");

