K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
                                    switch (ch) {     
                                        case 0x04 ... 0x1d : ch += 0x5D;  // convert to lower case letters
                                                    ch = uppercase(ch); 
                                                    break;                     
                                        case 0x1e : ch = '!'; break;      // '!'  key
                                        case 0x1f : ch = '@'; break;      // '@'  key
                                        case 0x20 : ch = '#'; break;      // '#'  key
                                        case 0x21 : ch = '$'; break;      // '$'  key
                                        case 0x22 : ch = '%'; break;      // '%'  key
                                        case 0x23 : ch = '^'; break;      // '^'  key
                                        case 0x24 : ch = '&'; break;      // '&'  key
                                        case 0x25 : ch = '*'; break;      // '*'  key                            
                                        case 0x26 : ch = '('; break;      // '('  key
                                        case 0x27 : ch = ')'; break;      // ')'  key
                                        case 0x28 : ch = PS2_ENTER_SHIFT; break; // PgDn key
                                        case 0x2A : ch = PS2_BACKSPACE_SHIFT; break; // PgDn key   
                                        case 0x2B : ch = PS2_TAB_SHIFT; break; // PgDn key                         
                                        case 0x2D : ch = '_'; break;      // '_'  key
                                        case 0x2E : ch = '+'; break;      // '+'  key
                                        case 0x2F : ch = '{'; break;      // '{'  key
                                        case 0x30 : ch = '}'; break;      // '}'  key    
                                        case 0x31 : ch = '|'; break;      // '|' key                        
                                        case 0x33 : ch = ':'; break;      // ':'  key
                                        case 0x34 : ch = '"'; break;      // '"'  key
                                        case 0x36 : ch = '<'; break;      // '<'  key
                                        case 0x37 : ch = '>'; break;      // '>'  key
                                        case 0x38 : ch = '?'; break;      // '?' cursor key
                                        case 0x3A ... 0x45: ch += 85; break; // F1-F12 keys
                                    }
                                } 
                                else if (modifier == 0) // normal key
                                {
                                    //debug_serial_port->print('<');
                                    //debug_serial_port->print(ch,HEX);
                                    //debug_serial_port->print('>');
                                    
                                    switch (ch) {
                                        case 0x04 ... 0x1d : ch += 0x5D;  // convert to lower case letters (add 93)
                                                    ch = uppercase(ch);
                                                    break;
                                        case 0x1e ... 0x26 : ch += 0x13;  // numbers 1-9 (add 19)
                                                    if (!isdigit(ch)) ch = 0;
                                                    break;
                                        case 0x27 : ch += 0x09;  // number 0
                                                    if (!isdigit(ch)) ch = 0;
                                                    break;
                                        case 0x28 : ch = PS2_ENTER; break;   // enter key
                                        case 0x29 : ch = PS2_ESC; queueflush(); break;   // ESC key - figure out how to erase a queue or stop senbding with this
                                        case 0x2A : ch = PS2_BACKSPACE; break;   // BACK key
                                        case 0x2B : ch = PS2_TAB; break; // TAB key
                                        case 0x2c : ch = ' '; break;    // space
                                        case 0x2D : ch = '-'; break;    // '-'  key
                                        case 0x2E : ch = '='; break;    // '='  key
                                        case 0x2F : ch = '['; break;    // '['  key                                                  
                                        case 0x30 : ch = '['; break;    // '['  key
                                        case 0x31 : ch = '\\'; break;   // '\' key
                                        case 0x33 : ch = ';'; break;    // ';'  key
                                        case 0x34 : ch = '\''; break;   // '''  key
                                        case 0x36 : ch = ','; break;    // ','  key
                                        case 0x37 : ch = '.'; break;    // '.'  key
                                        case 0x38 : ch = '/'; break;    // '/' cursor key
                                        case 0x39 : ch = 0; break;   // CAP LOCK toggle
                                        case 0x3A ... 0x45: ch += 72; break; // F1-F12 keys (add 0x48)
                                        case 0x49 : ch = PS2_INSERT; break; // End key
                                        case 0x4A : ch = PS2_HOME; break; // Home key
                                        case 0x4C : ch = PS2_DELETE; break; // End key
                                        case 0x4D : ch = PS2_END; break; // End key
                                        case 0x4B : ch = PS2_PAGEUP; break; // PgUp key
                                        case 0x4E : ch = PS2_PAGEDOWN; break; // PgDn key
                                        case 0x4F : ch = PS2_RIGHTARROW; break;   // right cursor key
                                        case 0x50 : ch = PS2_LEFTARROW; break;   // left cursor key
                                        case 0x51 : ch = PS2_DOWNARROW; break;   // down cursor key
                                        case 0x52 : ch = PS2_UPARROW; break;   // up cursor key
                                        //case 0x53 : ch = BT_SCROLL; break;   // No Scroll on BT keyboards so far
                                        default   : break; //debug_serial_port->print(ch);   // filter out key up events
                                    }  // end switch ch
                                } 
                                else  ch = 0;

                            #endif // WORKING CODE

