K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
    M5.begin(cfg);
    M5.Power.begin();
    auto ms = millis();
        
    lcd.setRotation(1);
    lcd.setTextDatum(ML_DATUM);
    //lcd.setWindow(0,0,w,h);
    if (M5.Speaker.begin())
        debug_serial_port->println(F("** M5 Speaker started"));
    else
        debug_serial_port->println(F("*** M5 Speaker startup failed"));

    M5.Speaker.setVolume(100);  // 0 - 255
    M5.Speaker.tone(700,1000);

    //lcd.println(F("primary display\n"));

    #ifdef TEST
    // Get the number of available displays
    int display_count = M5.getDisplayCount();

    for (int i = 0; i < display_count; ++i) {
        // All displays are available in M5.Lcds.
        // ※ Note that the order of which displays are numbered is the order in which they are detected, so the order may change.
        int textsize = M5.Displays(i).height() / 60;
        if (textsize == 0) { textsize = 1; }
        M5.Displays(i).setTextSize(textsize);
        M5.Displays(i).printf("No.%d\n", i);
    }
    
    // If an external display is to be used as the main display, it can be listed in order of priority.
    M5.setPrimaryDisplayType( {
        m5::board_t::board_M5ModuleDisplay,
    //    m5::board_t::board_M5AtomDisplay,
    //    m5::board_t::board_M5ModuleRCA,
    //    m5::board_t::board_M5UnitGLASS,
    //    m5::board_t::board_M5UnitGLASS2,
    //    m5::board_t::board_M5UnitMiniOLED,
    //    m5::board_t::board_M5UnitOLED,
    //    m5::board_t::board_M5UnitLCD,
    //    m5::board_t::board_M5UnitRCA,
    } );

    // The primary display can be used with M5.Display.
   
    lcd.print(F("primary display\n"));
    
    // Examine the indexes of a given type of display
    int index_module_display = M5.getDisplayIndex(m5::board_t::board_M5ModuleDisplay);

    if (index_module_display >= 0) {
        M5.Displays(index_module_display).print(F("This is a Module Display\n"));
    } 
    
    //M5.Display.clear(TFT_BLACK);
    
    //w = M5.Displays(0).width();
    h = 240; //M5.Displays(0).height();
    w = 320;
    //h = 240;

    //M5.Displays(0).fillScreen(TFT_BLACK);
    //M5.Displays(0).setRotation(1);
    //M5.Displays(0).clearDisplay();
    //M5.Displays(0).setTextColor(TFT_WHITE, TFT_BLACK, true);
    //M5.Displays(0).setTextDatum(top_center);
    //M5.Displays(0).drawString("CW Keyer", w / 2, 0, &fonts::FreeMonoBold12pt7b);

    #endif

    if (!M5.Speaker.isEnabled())
    {
        debug_serial_port->println(F("Speaker not found..."));
    }
    beep_boop();
}
#endif

#ifdef FEATURE_IDEASPARK_LCD_B
void traceHeap() {
	static uint32_t _free_heap_size = 0;
	if (_free_heap_size == 0) _free_heap_size = esp_get_free_heap_size();

	int _diff_free_heap_size = _free_heap_size - esp_get_free_heap_size();
	ESP_LOGI(__FUNCTION__, "_diff_free_heap_size=%d", _diff_free_heap_size);
	ESP_LOGI(__FUNCTION__, " esp_get_free_heap_size() : %6"PRIu32"\n", esp_get_free_heap_size() );
#if 0
	printf("esp_get_minimum_free_heap_size() : %6"PRIu32"\n", esp_get_minimum_free_heap_size() );
	printf("xPortGetFreeHeapSize() : %6zd\n", xPortGetFreeHeapSize() );
	printf("xPortGetMinimumEverFreeHeapSize() : %6zd\n", xPortGetMinimumEverFreeHeapSize() );
	printf("heap_caps_get_free_size(MALLOC_CAP_32BIT) : %6d\n", heap_caps_get_free_size(MALLOC_CAP_32BIT) );
	// that is the amount of stack that remained unused when the task stack was at its greatest (deepest) value.
	printf("uxTaskGetStackHighWaterMark() : %6d\n", uxTaskGetStackHighWaterMark(NULL));
#endif
}
#endif

#ifdef FEATURE_IDEASPARK_LCD_B  // hanging onto this unused code as an example of custom fonts loaded from files on SPIFFS partitions.
void ST7789(void *pvParameters)
{
    // set font file
    FontxFile fx16G[2];
    FontxFile fx24G[2];
    FontxFile fx32G[2];
    FontxFile fx32L[2];
    InitFontx(fx16G,"/fonts/ILGH16XB.FNT",""); // 8x16Dot Gothic
    InitFontx(fx24G,"/fonts/ILGH24XB.FNT",""); // 12x24Dot Gothic
    InitFontx(fx32G,"/fonts/ILGH32XB.FNT",""); // 16x32Dot Gothic
    InitFontx(fx32L,"/fonts/LATIN32B.FNT",""); // 16x32Dot Latin

    FontxFile fx16M[2];
    FontxFile fx24M[2];
    FontxFile fx32M[2];
    InitFontx(fx16M,"/fonts/ILMH16XB.FNT",""); // 8x16Dot Mincyo
    InitFontx(fx24M,"/fonts/ILMH24XB.FNT",""); // 12x24Dot Mincyo
    InitFontx(fx32M,"/fonts/ILMH32XB.FNT",""); // 16x32Dot Mincyo
    
    //TFT_t dev;

    // Change SPI Clock Frequency
    //spi_clock_speed(40000000); // 40MHz
    //spi_clock_speed(60000000); // 60MHz
    spi_master_init(&dev, CONFIG_MOSI_GPIO, CONFIG_SCLK_GPIO, CONFIG_CS_GPIO, CONFIG_DC_GPIO, CONFIG_RESET_GPIO, CONFIG_BL_GPIO);
    lcdInit(&dev, CONFIG_WIDTH, CONFIG_HEIGHT, CONFIG_OFFSETX, CONFIG_OFFSETY);

    #if CONFIG_INVERSION
      ESP_LOGI(TAG, "Enable Display Inversion");
      //lcdInversionOn(&dev);
      lcdInversionOff(&dev);
    #endif

    //char file[32];
    
    while(1) {   // Do screen work here

      //TextBoxTest(&dev, fx32G, CONFIG_WIDTH, CONFIG_HEIGHT);
			//WAIT;

        // Multi Font Test
      uint16_t color;
      uint8_t ascii[40];
      uint16_t margin = 10;
      lcdFillScreen(&dev, BLACK);
      color = WHITE;
      lcdSetFontDirection(&dev, 0);
      uint16_t xpos = 0;
      uint16_t ypos = 15;
      int xd = 0;
      int yd = 1;
      if(CONFIG_WIDTH < CONFIG_HEIGHT) {
        lcdSetFontDirection(&dev, 1);
        xpos = (CONFIG_WIDTH-1)-16;
        ypos = 0;
        xd = 1;
        yd = 0;
      }
      strcpy((char *)ascii, "16Dot Gothic Font");
      lcdDrawString(&dev, fx16G, xpos, ypos, ascii, color);

      xpos = xpos - (24 * xd) - (margin * xd);
      ypos = ypos + (16 * yd) + (margin * yd);
      strcpy((char *)ascii, "24Dot Gothic Font");
      lcdDrawString(&dev, fx24G, xpos, ypos, ascii, color);

      xpos = xpos - (32 * xd) - (margin * xd);
      ypos = ypos + (24 * yd) + (margin * yd);
      if (CONFIG_WIDTH >= 240) {
        strcpy((char *)ascii, "32Dot Gothic Font");
        lcdDrawString(&dev, fx32G, xpos, ypos, ascii, color);
        xpos = xpos - (32 * xd) - (margin * xd);;
        ypos = ypos + (32 * yd) + (margin * yd);
      }

