K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
      xpos = xpos - (10 * xd) - (margin * xd);
      ypos = ypos + (10 * yd) + (margin * yd);
      strcpy((char *)ascii, "16Dot Mincyo Font");
      lcdDrawString(&dev, fx16M, xpos, ypos, ascii, color);

      xpos = xpos - (24 * xd) - (margin * xd);;
      ypos = ypos + (16 * yd) + (margin * yd);
      strcpy((char *)ascii, "24Dot Mincyo Font");
      lcdDrawString(&dev, fx24M, xpos, ypos, ascii, color);

      if (CONFIG_WIDTH >= 240) {
        xpos = xpos - (32 * xd) - (margin * xd);;
        ypos = ypos + (24 * yd) + (margin * yd);
        strcpy((char *)ascii, "32Dot Mincyo Font");
        lcdDrawString(&dev, fx32M, xpos, ypos, ascii, color);
      }
      lcdDrawFinish(&dev);
      lcdSetFontDirection(&dev, 0);
      WAIT;
    }

    // never reach here
	  while (1) {
		  mydelay(5000);
	  }
}

static void listSPIFFS(char * path) {
	DIR* dir = opendir(path);
	assert(dir != NULL);
	while (true) {
    mydelay(1);
		struct dirent*pe = readdir(dir);
		if (!pe) break;
		ESP_LOGI(__FUNCTION__,"d_name=%s d_ino=%d d_type=%x", pe->d_name,pe->d_ino, pe->d_type);
	}
	closedir(dir);
}

esp_err_t mountSPIFFS(char * path, char * label, int max_files) {
	esp_vfs_spiffs_conf_t conf = {
		.base_path = path,
		.partition_label = label,
		.max_files = (size_t) max_files,
		.format_if_mount_failed = true
	};

	// Use settings defined above to initialize and mount SPIFFS filesystem.
	// Note: esp_vfs_spiffs_register is an all-in-one convenience function.
	esp_err_t ret = esp_vfs_spiffs_register(&conf);

	if (ret != ESP_OK) {
		if (ret ==ESP_FAIL) {
			ESP_LOGE(TAG, "Failed to mount or format filesystem");
		} else if (ret== ESP_ERR_NOT_FOUND) {
			ESP_LOGE(TAG, "Failed to find SPIFFS partition");
		} else {
			ESP_LOGE(TAG, "Failed to initialize SPIFFS (%s)",esp_err_to_name(ret));
		}
		return ret;
	}

#if 0
	ESP_LOGI(TAG, "Performing SPIFFS_check().");
	ret = esp_spiffs_check(conf.partition_label);
	if (ret != ESP_OK) {
		ESP_LOGE(TAG, "SPIFFS_check() failed (%s)", esp_err_to_name(ret));
		return ret;
	} else {
			ESP_LOGI(TAG, "SPIFFS_check() successful");
	}
#endif

	size_t total = 0, used = 0;
	ret = esp_spiffs_info(conf.partition_label, &total, &used);
	if (ret != ESP_OK) {
		ESP_LOGE(TAG,"Failed to get SPIFFS partition information (%s)",esp_err_to_name(ret));
	} else {
		ESP_LOGI(TAG,"Mount %s to %s success", path, label);
		ESP_LOGI(TAG,"Partition size: total: %d, used: %d", total, used);
	}

	return ret;
}

void initialize_st7789_lcd()
{
    ESP_LOGI(TAG, "Initializing SPIFFS");
    // Maximum files that could be open at the same time is 7.
    ESP_ERROR_CHECK(mountSPIFFS((char *) "/fonts", (char *) "storage1", 7));
    listSPIFFS((char *) "/fonts/");

    // Maximum files that could be open at the same time is 1.
    ESP_ERROR_CHECK(mountSPIFFS((char *) "/icons", (char *) "storage2", 1));
    listSPIFFS((char *) "/icons/");

    xTaskCreate(ST7789, "ST7789", 1024*6, NULL, 2, NULL);
}
#endif

#ifdef FEATURE_TFT_DISPLAY
  void initialize_TFT_LCD_display(void) 
  {
        #ifdef FEATURE_M5STACK_CORE2
            //lcd.setRotation(1);
            //lcd.invertDisplay(true);
            //initialize_m5stack_core2();
            // h and w are defined as 320 and 240 globally.  Crashes when calling height() or width() functions.            
        #else
            lcd.init();  // init the st7789 based ideaspark tft lcd on ESP32-WROOM module
            //lcd.invertDisplay(1);
            lcd.setRotation(3);
            lcd.fillScreen(TFT_BLACK);  
        #endif
        lcd.setTextDatum(MY_DATUM); // Centre text on x,y position
        // Set up new screen and draw status bar and icons in it
        lcd.setTextColor(TFT_YELLOW, TFT_BLACK);
        //lcd.setFreeFont(FM9);
        lcd.setTextFont(STATUS_BAR_FONT);  // &fonts::FreeMonoBold12pt7b)
        lcd.drawString("K7MDL Keyer", SCROLL_TEXT_LEFT_SIDE, STATUS_BAR_X_CURSOR);  
        lcd.setTextColor(TFT_RED);
        lcd.drawRoundRect(0, 0, SCREEN_WIDTH, SCREEN_BOX_HEIGHT, 6, TFT_RED);
        lcd.drawFastHLine(0, SCROLL_BOX_TOP-2, SCREEN_WIDTH, TFT_RED);
        lcd.drawFastHLine(0,SCROLL_BOX_TOP-1, SCREEN_WIDTH, TFT_RED);
        //lcd.setTextWrap(false, false);                         // turn off text wrap, else will overwrite the borders
        lcd.setTextWrap(true, true);                         // turn off text wrap, else will overwrite the borders
        //update_icons();
        lcd.setTextColor(TFT_WHITE,TFT_BLACK);
        // now updae scroll box area with satus messages and eventually CW text to send
        //lcd.drawCentreString("Searching for BT Keyboard ...", SCREEN_WIDTH/2, SCREEN_HEIGHT/2, 2);
        //lcd.drawString("Searching for BT Keyboard ...", SCROLL_BOX_LEFT_SIDE, SCREEN_HEIGHT/2, 2);
        //mydelay(5000);
        
        //  Some possibly useful draw functions
        //lcd.setAddrWindow(10, 31, 316, 166);
        // Test some print formatting functions
        //float fnumber = 123.45;
        // Set the font colour to be blue with no background, set to font 4
        ////lcd.setTextColor(TFT_BLUE, true);    lcd.setTextFont(4);
        //lcd.print(F("Float = ")); lcd.println(fnumber);           // Print floating point number
        //lcd.print(F("Binary = ")); lcd.println((int)fnumber, BIN); // Print as integer value in binary
        //lcd.print(F("Hexadecimal = ")); lcd.println((int)fnumber, HEX); // Print as integer number in Hexadecimal

        lcd.setCursor(SCROLL_TEXT_LEFT_SIDE, SCROLL_TEXT_TOP_LINE);
        lcd.setTextColor(TFT_WHITE,TFT_BLACK);  
        //lcd.setTextFont(4); //&fonts::FreeMonoBold12pt7b)
        lcd.setTextDatum(MY_DATUM); // Centre text on x,y position
        lcd.setFreeFont(TFT_FONT_MEDIUM);
  }
#endif

#ifdef FEATURE_BT_KEYBOARD
  void BT_Keyboard_Status(void)
  {
        //ToDo: Set up as a periodic scan for reconnect or new keyboard
        if (BT_Keyboard_Lost == true) {
            if (Keyboard_Disconnected_signal) {                
                debug_serial_port->println(F("Lost BT Keyboard Connection"));
                //clear_display_row(1);
                lcd_center_print_timed("Lost Connection", 2, 3000);
                Keyboard_Disconnected_signal = false;
            }
        }
        else{
            if (Keyboard_Connected_signal) {
                lcd_center_print_timed("Keyboard Connected", 2, 3000);
                //clear_display_row(1);
                debug_serial_port->println(F("BT Keyboard Connected"));
                Keyboard_Connected_signal = false;
            }
        }
  }
#endif

void setup()
{
    initialize_serial_ports();        // Goody - this is available for testing startup issues  
    initialize_pins();
    initialize_display();
    create_buttons();
    update_icons();
    // initialize_debug_startup();       // Goody - this is available for testing startup issues
    // debug_blink();                    // Goody - this is available for testing startup issues
    initialize_keyer_state();
    initialize_potentiometer();
    initialize_rotary_encoder();
    initialize_default_modes();
    initialize_watchdog();
    initialize_ethernet_variables();
    #if defined(DEBUG_EEPROM_READ_SETTINGS)
        initialize_serial_ports();
    #endif
    check_eeprom_for_initialization();
    check_for_beacon_mode();
    check_for_debug_modes();
    initialize_analog_button_array();
    #if !defined(DEBUG_EEPROM_READ_SETTINGS)
        initialize_serial_ports();
    #endif 
    initialize_ps2_keyboard();
    initialize_usb();
    initialize_cw_keyboard();
    initialize_bt_keyboard();
    #if defined(FEATURE_WIFI) && defined(HARDWARE_ESP32_DEV) //SP5IOU 20220129
        wifiConnect(configuration.wifissid,configuration.wifipassword);
    #endif
    initialize_ethernet();
    initialize_udp();
    initialize_web_server();
    initialize_sd_card();  
    initialize_debug_startup();
}

//#define USE_TASK     // for main program in a task

#ifdef USE_TASK
void main_loop(void * pvParameters )
{
  /* The parameter value is expected to be 1 as 1 is passed in the
    pvParameters value in the call to xTaskCreate() below. */

  configASSERT( ( ( uint32_t ) pvParameters ) == 1 );

