K7MDL2/K3NG_Keyer_ESP32_BT_Keyboard/main/main.cpp
        }

        service_sending_pins();

        service_millis_rollover(); 
    }
}
  
// --------------------------------------------------------------------------------------------
void loop()
//extern "C"  
//{
//  void app_main(void) 
  {
    BaseType_t xReturned;
    TaskHandle_t xHandle_MAIN = NULL;
    TaskHandle_t xHandle_BT = NULL;
    TaskHandle_t xHandle_TOUCH = NULL;

    //initArduino();  // Initialize the Arduino environment

    // this is where the magic happens
    
    //setup(); // call setup for here when not in Arduino statup mode
    
    #if defined(FEATURE_TOUCH_DISPLAY) && defined(USE_TOUCH_TASK)
        xReturned = xTaskCreate(
                    check_touch_buttons,      /* Function that implements the task. */
                    "Check_Touch_Buttons",          /* Text name for the task. */
                    2000,      /* Stack size in words, not bytes. */
                    ( void * ) 1,    /* Parameter passed into the task. */
                    7,/* Priority at which the task is created. */
                    &xHandle_TOUCH );
    #endif


    #if defined(FEATURE_BT_KEYBOARD) && defined(USE_BT_TASK)
        xReturned = xTaskCreate(
                    check_bt_keyboard,       /* Function that implements the task. */
                    "Check_BT_Keyboard",          /* Text name for the task. */
                    8000,      /* Stack size in words, not bytes. */
                    ( void * ) 1,    /* Parameter passed into the task. */
                    0,/* Priority at which the task is created. */
                    &xHandle_BT );
    #endif
    
    #if defined(USE_TASK)
    xReturned = xTaskCreate(
                main_loop,       /* Function that implements the task. */
                "Main_Loop",          /* Text name for the task. */
                12000,      /* Stack size in words, not bytes. */
                ( void * ) 1,    /* Parameter passed into the task. */
                0,/* Priority at which the task is created. */
                &xHandle_MAIN );
    #endif

    while (1)
    {
      mydelay(1);
      #ifdef USE_TASK
        mydelay(5000);
      #else
        main_loop();
      #endif        
      
      #if defined (FEATURE_BT_KEYBOARD) 
        #ifdef USE_BT_TASK
          check_bt_keyboard();
        #endif
      #endif

      //esp_task_wdt_reset();
    }

    //if( xReturned == pdPASS )
    //{
        // The task was created. Use the task's handle to delete the task.
        //vTaskDelete( xHandle );
    //}
  }

//}